[
    {
        "Id": "515",
        "Title": "View the Grand Canyon by helicopter - is it real?",
        "Body": "<p>I going to visit the United States and its famous geographic places, such as the Grand Canyon.I heard that there are some helicopter tours are available during visiting the Grand Canyon. Is this true?  </p><p>How much does it cost and what firms are noted for their services?</p><p>Do I need any documents to take this tour? Any info is appreciated.</p><p><img src=\"https://i.stack.imgur.com/d5zmQ.jpg\" alt=\"Grand Canyon image\"></p>",
        "Tags": "['usa', 'sightseeing', 'tours', 'grand-canyon', 'helicopters']"
    },
    {
        "Id": "128516",
        "Title": "Munich to Rome by train (avoiding tunnels)",
        "Body": "<p>I want to travel from Munich to Rome by train. There are several routes to take, for example <strong>Munich → Bologna → Rome</strong> or <strong>Munich → Bolzano → Rome</strong> or <strong>through Switzerland</strong>, etc.. </p><p>I would love to know:</p><ul><li>Which route should I take if I want to cross as few  tunnels as possible (i.e. which route is the most tunnel-free)</li><li>How long is the longest tunnel between on the given route?</li></ul><p>I want to avoid tunnels because I am claustrophobic and hate them. I can tolerate short tunnels <em>(<1000-1500 m)</em>. Before I rule out travelling by train I just want to be sure if there is a route without tunnels that exceed let's say <em>2000 metres</em> or not.</p>",
        "Tags": "['trains', 'italy', 'austria']"
    },
    {
        "Id": "26117",
        "Title": "How much cash can you carry on a flight within the European Union?",
        "Body": "<p>Is there any specific limit of money you can carry on cash while flying from one European Union country to another?</p>",
        "Tags": "['air-travel', 'europe', 'money', 'international-travel']"
    },
    {
        "Id": "6",
        "Title": "How can I visit Antarctica?",
        "Body": "<p>A year ago I was reading some magazine, and found out that there is availability to get a trip to Antarctica.<br>Unfortunately, there was no info about how I could get there.<br>Do you know anything about it? Best way to get there, best route, maybe some feedback?</p>",
        "Tags": "['extreme-tourism', 'antarctica']"
    },
    {
        "Id": "113157",
        "Title": "Why does Paris have two large train stations next to each other? (Gare du Nord, Gare de l'Est)",
        "Body": "<p>In Paris, there are two large train stations close to each other, but still separate and at a walking distance: \"The (train) station of the North\" - Gare du Nord, and \"The (train) station of the East\" - Gare de l'Est.</p><p>Now, you might think maybe one of them faces North and the others faces East, so that trains don't have to make the turn, or something (I still don't see why the couldn't have two platform areas as part of the same station even in this case) - but they both face North-North-East.</p><p>So what's the logic of having both these stations? I'm guessing there's some historical, rather than technical, reason for this. Also, is it fair to assume that trains travelling from/to East of Paris will always stop at Est and trains travelling from/to North of Paris will always stop at Nord?</p>",
        "Tags": "['trains', 'paris', 'train-stations', 'history']"
    },
    {
        "Id": "111112",
        "Title": "Is 45 minutes enough to check in and board plane at Chicago O'Hare airport?",
        "Body": "<p>I estimate that I will have 45 minutes between arriving at O'Hare and when my flight leaves. I will have two bags to check in, and I'm on an international flight with EVA Air that leaves at 12:30 AM. Will 45 mins be enough time for me to check my bags, go through security, and board the plane?</p><p>Question update: What if, in a different scenario, I have 1 hour 30 minutes between arriving at O'Hare and the flight's departure, also with 2 bags to check?</p><p>Below is a screenshot of the flight I intend to board.</p><p>Additional UPDATE: This is the full plan for my trip in the case where I expect to arrive 1hr30 mins before boarding:</p><p>Leave Ann Arbor 6:51pm, arrive at Chicago O'Hare at 10:25pm (see screenshot below) on Amtrak (this is the only transport (coaches considered) that's compatible with my schedule that day).</p><p>Pre-schedule an Uber to go from Chicago Union Station to O'Hare, taking around 35 mins (also see screenshot below). Hope to get there no later than 11:05 in the worst case scenario. I can have the Uber drive me straight to terminal 5, which is where EVA Air will be.</p><p><a href=\"https://i.stack.imgur.com/sS29e.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/sS29e.png\" alt=\"Amtrak schedule\"></a></p><p><a href=\"https://i.stack.imgur.com/66kCW.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/66kCW.png\" alt=\"Google Maps Uber time estimate\"></a></p><p><a href=\"https://i.stack.imgur.com/2Yyx8.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/2Yyx8.png\" alt=\"EVA Air flight itinerary\"></a>.</p><p>I appreciate all the answers and comments - they've really helped.</p>",
        "Tags": "['air-travel', 'trains', 'airports', 'short-connections', 'ord']"
    },
    {
        "Id": "48649",
        "Title": "Is it safe to drive at night in the Canadian Rockies?",
        "Body": "<p>As part of a road trip, I am thinking of crossing the Canadian Rockies by car during night time, from Banff, AB to Kamloops, BC.</p><p>I am aware that some areas in Canada are not recommended to be driven through at night, mostly because of large animals that may cross the roads. Is it the case of this section, in the middle of the Banff National Park, or can I drive through it by night with a \"regular\" sedan car without worrying at all?</p>",
        "Tags": "['safety', 'driving', 'night-transport', 'british-columbia', 'canadian-rockies']"
    },
    {
        "Id": "47625",
        "Title": "What do the dashes close to each other near French freeway exits mean?",
        "Body": "<p>During my last trip to France via car I noticed that French freeways (autoroutes) have a somewhat strange road marking I am not familiar with.</p><p>Usually, there are two lanes going my direction on a freeway. These lanes are separated by a dashed line indicating I am allowed to cross this line to pass cars by moving to the left lane.</p><p>A few hundred meters before each exit the frequency of these dashes changes. They are much closer together but still don't form a solid line. As soon as the exit is passed, the line changes back to dashes spread further apart, just as before.</p><p>In case you do not know what I mean, have a look at e.g. <a href=\"https://www.google.de/maps/place/48%C2%B053%2729.9%22N+2%C2%B054%2716.6%22E/@48.891641,2.904625,409m/data=!3m2!1e3!4b1!4m2!3m1!1s0x0:0x0\">this freeway exit near Paris on Google Maps</a>.</p><p>What do these dashes near the exit mean? Am I supposed to not change lanes in this area?</p>",
        "Tags": "['legal', 'france', 'driving']"
    },
    {
        "Id": "1033",
        "Title": "What are Ireland's top places to visit with a toddler?",
        "Body": "<p>I am planning a visit with my daughter (2 years) and wife around Ireland (and Northern Ireland) for ten days. We start from Cork and finish in Dublin. What are the most interesting places to visit? In particular we are not interested in stuff not suitable for children (night-life, etc) and we would prefer to see something different from that in the UK and the rest of Europe.</p><p>We have a Rough Guide, but I found it almost impossible to figure out what is really worth seeing. I would be grateful for any suggestions.</p><p>EDIT:Regarding historic sites, usually (mostly) outdoor sites are OK, it's just the museum type sightseeing is too boring for the little one.</p>",
        "Tags": "['planning', 'children', 'ireland', 'northern-ireland']"
    },
    {
        "Id": "7180",
        "Title": "Key vs. combo lock security for international travel",
        "Body": "<p>I leave on my trip next month, and I wanted to buy locks for my backpack since I'll certainly be passing through crowded areas of the city where it may be difficult for me to notice a pickpocket attempt. What I want to know, is whether a key or combo lock offers a higher level of security over the other. Also, would anyone know where I might be able to purchase a set of 4-5 locks that unlock with a single key?</p>",
        "Tags": "['luggage', 'gear', 'security']"
    },
    {
        "Id": "46093",
        "Title": "How to find and compare flights carried out by a specific type of plane?",
        "Body": "<p>I'd really like to fly with an Airbus A380. But how do I find and compare the price of flights that are carried out by specific kind of plane? I don't want to fly just anywhere; I plan to go from Vienna, Austria to Indonesia this summer, possibly with a stop-over in Hong Kong, Singapore or Bangkok.</p><p>I checked if any there are any regular commercial flights with A380s to/from my home town. There aren't, so the way to go is probably to first fly to a major hub somewhere in the Middle East or South East Asia (which I'd have to do anyway since there don't seem to be many direct flights from Vienna to SEA). </p><p>So far, I simply searched for flights like you'd usually do and then checked which planes they use; this is very, very tedious, especially when one is very flexible in dates.  </p><p><strong>How do I find cheap flights that are carried out by a specific type of plane?</strong></p>",
        "Tags": "['air-travel', 'online-resources', 'bookings', 'aircraft', 'flight-search-engines']"
    },
    {
        "Id": "178696",
        "Title": "Travel in western Ukraine: how safe / unsafe is it?",
        "Body": "<p>For many years I've wanted to do some hiking or mountain biking in the mountains of western Ukraine (Zakarpatska Oblast - the safest one at the moment). First, the Covid-19 pandemic threw a wrench into my plans, then the war. But I'd really like to go there this spring/summer, if possible. Of course, the short answer is \"forget about it, don't travel there\". That's what governments of just about all countries (incl. mine) advise their citizens. But I'm looking here for a longer, more nuanced answer. Here are several points that I'd like to get clarified:</p><ol><li><p>Will I be admitted into the country? I'm an EU national, fully vaccinated against Covid (last dose in December 2021), and I know I have to buy Ukrainian travel insurance (can be bought very cheaply on <a href=\"https://visitukraine.today/\" rel=\"nofollow noreferrer\">VisitUkraine.today</a>). However, entering Ukraine with my mountain bike, I'm afraid I'll stand out of the crowd, because I guess not many leisure travellers enter Ukraine these days. Could I be refused entry?</p></li><li><p>Are trains in the west of Ukraine reliable? I plan to travel from Chop to Sianky (Uzhok pass) and spend some time in the mountains near the border with Poland and Slovakia. According to the online sources, the trains do operate there. Should I expect disruptions (e.g. due to power shortages) or any other problems? On a side note, can I pay for the train ticket in Chop (a major station) using a foreign credit card?</p></li><li><p>If stopped by the Ukrainian police (I've read it happens a lot these days), is there a chance of them getting unfriendly if they find out I'm just a tourist wandering around with no business to do in Ukraine? Will I be viewed as a nuisance?</p></li></ol>",
        "Tags": "['safety', 'ukraine', 'travel-warning']"
    },
    {
        "Id": "151055",
        "Title": "Why isn't there public transport on Christmas Day in the UK?",
        "Body": "<p>There are no trains, no underground, no trams, almost or no buses at all on 25th of December in the UK. The 10 million London goes to a halt. We live in Manchester.  A single bus service goes from approx. 8am to 8pm between the City center and the Airport.</p><p>Why?</p><p>For me, someone coming from Eastern Europe, it's completely unimaginable having no public transport for a full day.</p><p>How was this before that time when car ownership was quite common (let's say before the second world war for example)?</p>",
        "Tags": "['uk', 'public-transport', 'london', 'manchester']"
    },
    {
        "Id": "86545",
        "Title": "Delayed plane: Why is the delay on the departure time larger than the the delay on the arrival time?",
        "Body": "<p>My plane got delayed, and I noticed that the delay on the departure time was larger than the the delay on the arrival time. How come? </p><p>Is that a strategy that airlines use to reduce the amount of complaints among the passengers, even though they don't plan to go faster? Or does it mean some aspect of the trip will actually be done faster (e.g., higher priority to land, faster speed, etc.)? Or does it mean the original arrival time had some margin? etc.</p><hr><p>Example:</p><p><a href=\"https://i.stack.imgur.com/pjOTC.png\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/pjOTC.png\" alt=\"enter image description here\"></a></p><ul><li>3:14 PM - 2:48 PM <a href=\"https://www.timeanddate.com/date/durationresult.html?m1=1&d1=20&y1=2017&m2=1&d2=20&y2=2017&h1=14&i1=48&s1=0&h2=15&i2=14&s2=0\" rel=\"noreferrer\">=</a> 26 minutes</li><li>5:06 PM - 4:43 PM <a href=\"https://www.timeanddate.com/date/durationresult.html?m1=1&d1=20&y1=2017&m2=1&d2=20&y2=2017&h1=16&i1=43&s1=0&h2=17&i2=06&s2=0\" rel=\"noreferrer\">=</a> 23 minutes</li></ul>",
        "Tags": "['air-travel']"
    },
    {
        "Id": "155155",
        "Title": "Can I simply apply for a chargeback on my credit card if my flight was cancelled and I'm unable to reach the airline?",
        "Body": "<p>As explained in a <a href=\"https://travel.stackexchange.com/questions/155018/how-to-request-a-refund-from-condor-airlines-without-calling-them\">relevant question</a>, my flight with Condor [from Frankfurt to Prague] was recently cancelled. I've emailed them asking for a refund 5 days ago, but so far received no response. Today another flight with British Airways was cancelled and likewise they only offer a voucher if asking for a refund online. To get your actual money back they're asking you to call them and their lines are all plugged up.</p><p>Given that I'm unable to reach the airline at this moment, can I just apply for a chargeback on my credit card? If it matters I have a US-issued credit card and live in the US.</p><p>Update: in the end I was able to get a refund by asking BA on Twitter.</p>",
        "Tags": "['airlines', 'money', 'cancellations', 'refunds', 'covid-19']"
    },
    {
        "Id": "56343",
        "Title": "Why do airplanes not use two regular 3.5mm jacks?",
        "Body": "<p>I'm flying this Friday again and can't find my two-to-one 3.5 mm jack adapter and I was wondering why did they decided to go this way? </p><p>One like this:  </p><p><a href=\"https://i.stack.imgur.com/c0qlLs.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/c0qlLs.jpg\" alt=\"I'm talking about these\"></a> </p><p>I know why they were using the two prongs, to avoid of theft of the airline distributed headphones. But why not use two regular jacks and just switch the channels on the second one? This way everybody could use his own headphones.</p>",
        "Tags": "['air-travel', 'airlines', 'aircraft']"
    },
    {
        "Id": "4634",
        "Title": "Home exchange sites?",
        "Body": "<p>I'm looking into a home exchange / house exchange deal where I can swap my place with someone else for a month. Does anyone know any good sites for locating other people in the same scenario? </p><p>I've used <a href=\"http://www.airbnb.com/\">Airbnb</a> before and found it great. The fact people can link data to their account or have reviews gives you a little more trust in renting from a stranger. </p>",
        "Tags": "['online-resources', 'rental', 'homestay']"
    },
    {
        "Id": "27",
        "Title": "What are some good ways to find things to explore on-site in an unfamiliar place?",
        "Body": "<p>When traveling, one of my favorite things to do is simply explore the local area and see what's going on.  I do enjoy guided tours on some occassions, but I'm more interested in finding cool local markets/restaurants/historical sites, photography opportunities, or nearby nature walks/hikes that are hidden gems.</p><p>For example, when in Sydney, a relative pointed us to <a href=\"http://goo.gl/maps/uMc3\">a small nature reserve</a> (one of hundreds or thousands when simply looking at a map) that turned out to be a deep, beautiful forest in the middle of a neighborhood.</p><p>Before a trip, I usually search online for reviews of \"things to do\" but mostly I just come up with tourist traps.  So how do I find the <em>opposite</em> of tourist traps once I'm actually on site?</p>",
        "Tags": "['sightseeing', 'planning', 'tourist-traps']"
    },
    {
        "Id": "5149",
        "Title": "What is the LONGEST Tour operated by travel companies?",
        "Body": "<p>I remember 6 years ago, discovering \"The Great South American Journey\" operated by Gap adventures (now G Adventures), a 5 month trip around the continent (although essentially a bunch of their smaller tours joined together).</p><p>Then this year, I found <a href=\"http://www.africantrails.co.uk/tour/ultimate-trans-africa-uk-to-turkey\">this</a>: a <strong>43 week</strong> tour of Africa, covering something like <strong>28 countries</strong> in that time.</p><p>I was wondering - two parts, what's the longest official tour offered in the world in terms of time travelling, and which official tour covers the most number of countries?</p>",
        "Tags": "['tours', 'factoids', 'long-haul', 'long-term', 'statistics']"
    },
    {
        "Id": "61984",
        "Title": "Is there any good place to visit between Paddington Station and Grosvenor Square, for a 5-year-old boy?",
        "Body": "<p>I am travelling to London with my nearly-5-year-old son this coming Monday. The main purpose of the visit is to get him a new passport. We'll arrive on Monday evening and stay near Paddington Station. We'll visit the embassy at Grosvenor Square area on Tuesday morning. We plan to be there by 10am. The application process itself may take 1-2 hours, and we plan to leave London at 3pm. So we do have a bit of time before we leave. </p><p>Is there any good place to visit somewhere between Paddington Station and Grosvenor Square, something that is suited for a 5-year-old boy? I know Hyde Park is an option, but it is so big and I do not know anything of interest closer to the area we will be travelling. Anything slightly further would be fine, too, as long as it won't take much travel time.</p><p>By current forecast it looks like it is not going to rain, but it would be nice to have other options if it rains.</p>",
        "Tags": "['london', 'children']"
    },
    {
        "Id": "168993",
        "Title": "Why was this border agent rude to me?",
        "Body": "<p>My passport has a protective thin transparent case. There's a place to put cards and money on the inner side of the last page. A tiny space. I keep a US$100 bill there. A passport isn't attractive to thieves so that's my rationale for keeping money there. I also keep cash in my wallet and backpack.</p><p>Recently I had an unusual interaction with a border agent. I've entered foreign countries in four continents more than a dozen times and never had a rude border agent except this one. This border agent was quite rude. A few moments after getting my passport, they raised their voice and told me to do something in their native language even though they knew I don't speak it. They later spoke in English and told me to take the money out. I did. They used a magnifier of some sort(?) to look at that page.</p><ol><li><p>Was it my fault that I put that money there?</p></li><li><p>Did I block off something important?</p></li><li><p>Maybe they thought that bill was a bribe??</p></li><li><p>What were they looking at with that device? What's on that page?</p></li></ol>",
        "Tags": "['customs-and-immigration', 'passports', 'borders']"
    },
    {
        "Id": "186406",
        "Title": "Markets in Germany with a large selection of seafood",
        "Body": "<p>I am planning to invite Asian family in law to Germany. They are big fans of seafood, especially crabs, shrimps and mussels.In my experience, the selection at the markets in Germany is rather sparse compared to the places in Asia I have visited so far. I would still like to try to include a German city with a comparable selection in our itinerary.</p><p>My own googling shows several recommendations for markets (e.g. Hamburg, Munich) in Germany, but not many details about the products sold. I'm also wary of the culturally different views on what constitutes a great selection.</p><p>Could anyone recommend markets in Germany that have a great selection of fresh seafood?</p>",
        "Tags": "['germany', 'food-and-drink']"
    },
    {
        "Id": "30247",
        "Title": "Internet access at Dubai airport?",
        "Body": "<p>I'll soon be transiting twice through Dubai Airport Terminal 3 and would like to make a quick Skype video call back home while there.  What are my options, free or paid?  I'm open to wifi, Internet kiosks, local SIM, anything that gets the job done and doesn't cost an arm and a leg (read: roaming mobile data).</p><p>The <a href=\"https://travel.stackexchange.com/questions/27758/where-can-i-take-a-shower-at-dubai-airport\">always useless</a> <a href=\"http://www.dubaiairport.com/en/passengers/AirportServices/Pages/FreeWiFi.aspx\" rel=\"nofollow noreferrer\">official DXB website claims</a> \"reliable and fast\" free wifi, but the last time I passed through (Dec 2012) it was flakier than a Kelloggs factory, to the point of being impossible to even send an email, much less stream live video.  Personal recent experience of it being usable at DXB peak hours (middle of the night) would be welcome though!</p>",
        "Tags": "['internet', 'dubai', 'wifi', 'dxb']"
    },
    {
        "Id": "103464",
        "Title": "Is the use of \"Kiev\" (or other Russian-based spelling) considered offensive in Ukraine?",
        "Body": "<p>Someone edited <a href=\"https://travel.stackexchange.com/questions/103282/why-do-restaurants-and-cafes-in-ukraine-make-a-transaction-on-each-food-separate\">my question</a>, which originally used \"Kiev\" to mean the capital of Ukraine, but edited into \"Kyiv\". I just briefly googled it and found that \"Kiev\" is a Russian word while \"Kyiv\" is a Ukrainian one.</p><p>I wonder if it is considered offensive, or otherwise not welcomed among Ukrainians. </p><p>I feel that people don't care about my pronunciation, so the issue would be only in the written context (e.g. chat with AirBnB hosts, ask help for a stranger on a smartphone, etc...). </p><p>So, is it offensive for locals? Or approximately how many people (in percentage) care about it? </p>",
        "Tags": "['ukraine', 'kyiv']"
    },
    {
        "Id": "80936",
        "Title": "What are the legal consequences for a tourist who runs out of gas on the Autobahn?",
        "Body": "<p>There are many international travelers and tourists that enjoy driving cars on Germany's Autobahn every day, some of them would be unaware that running out of gas on the autobahn is illegal. </p><p>Although I have visited Germany twice and always traveled with trains and buses there, I just came to know after reading a few articles that parking a car on the Autobahn with an empty tank is illegal.</p><p><a href=\"https://i.stack.imgur.com/460IL.jpg\"><img src=\"https://i.stack.imgur.com/460IL.jpg\" alt=\"Autobahn picture\"></a></p><p>Question: What happens if a tourist runs out of gas on the Autobahn and isn't aware of German autobahn law? How to cope with this situation?</p><p>Can drivers finding themselves in this predicament be subject to fines? Is penalty the same for everyone regardless of nationality?</p>",
        "Tags": "['legal', 'germany', 'safety', 'driving', 'planning']"
    },
    {
        "Id": "185386",
        "Title": "Is Global Entry worth it?",
        "Body": "<p>I am an international student attending boarding school in the US. I am on an F1 student visa. I will likely visit home (India) one to three times a year for the next three to five years. All international flights will be out of Boston Logan (BOS) or New York City (JFK). I cannot stay on campus for breaks, so I will definitely have to fly <em>somewhere</em> a minimum of five (round) trips a year. Is Global Entry (and the TSA PreCheck that comes with it) worth it? What have your experiences been with both of those? Does TSA PreCheck really save that much time when flying domestic? Is immigration easier and/or significantly quicker with Global Entry? What about non-immigrants using Global Entry?</p>",
        "Tags": "['f1-visas', 'global-entry', 'tsa-precheck']"
    },
    {
        "Id": "111146",
        "Title": "What is the easiest place to cross the US Rocky Mountains, going to Oregon, in a large truck?",
        "Body": "<p>I'm working on the arrangements to move my household.  I will need to drive a large moving truck from Kansas to Oregon in early June.  I'm concerned that driving such a large truck through the mountains may be difficult because of the mountainous terrain (which we don't have in Kansas). </p><p>What is the easiest place to cross the Rocky Mountains in a large moving truck?</p>",
        "Tags": "['usa', 'driving', 'safety', 'routes', 'mountains']"
    },
    {
        "Id": "42540",
        "Title": "(Where) Can I go to a \"sleeper\" cinema?",
        "Body": "<p>I came upon an <a href=\"http://www.boredpanda.com/beautiful-cinemas-around-the-world/#post0\" rel=\"nofollow noreferrer\">article going around Facebook</a> which shows some unusual cinemas around the world. The first photo shows a number of movie-goers lying in beds watching a flick:</p><p><img src=\"https://i.stack.imgur.com/0lQCM.jpg\" alt=\"enter image description here\"></p><p>The article offers sparse details, at best, only claiming the location is \"Olympia Music Hall, France\" and a comment says \"It was actually an event held by IKEA in France.\"</p><p>Are there any cinemas that do this regularly?</p>",
        "Tags": "['where-on-earth', 'entertainment', 'sleeping', 'cinema']"
    },
    {
        "Id": "27693",
        "Title": "How many laptops can I take on an international flight from the US to Europe?",
        "Body": "<p>I am wondering how many laptops I can take from the U.S. to Europe – of course within baggage – but what about declaration value? What if I took 15 stacked in a suitcase, each worth $70? That is only a bit over $1000 and cheaper than many people's overly expensive Apple laptops. Of course I might have plans to sell them, but am I OK if I am under a particular declaration amount? I have receipts.</p>",
        "Tags": "['international-travel', 'electronic-items', 'import-taxes']"
    },
    {
        "Id": "2044",
        "Title": "What type of mosquito repellent is most effective?",
        "Body": "<p>There are many different kinds of insect repellents and bug sprays on the market: sprays and lotions, chemical and natural, huge percentages of DEET and lower percentages, etc.</p><p>What type of mosquito repellent is most effective (for travelers to tropical destinations)? What types should be avoided or are just a marketing ploy?</p><p>I'm not asking for specific product recommendations, but general advice about types of insect repellent (e.g. 100% DEET vs. 30% vs. citronella oil, etc.).</p><p><strong>Edit:</strong> Starting a bounty to try to get a few more details. Thanks for the answers so far! But it would be great to see some real details (with references) about the effectiveness of different kinds of repellents, different concentrations of DEET, sprays vs. lotions, etc.</p>",
        "Tags": "['health', 'tropical-destinations', 'insects']"
    },
    {
        "Id": "27183",
        "Title": "Is it considered uncouth to check in early into a hotel?",
        "Body": "<p>I usually <strong>never</strong> early check into budget hotels. In relatively more expensive hotels (3-star or higher) I feel that it's appropriate to check in early, but not in cheaper hotels or hostels.</p><p>I don't know if my policy is correct or not, but sometimes I might run into problems if I'm arriving somewhere around 11:00 AM whereas the check-in time might be 2:00 PM. Would it be considered uncouth in either case (expensive vs. cheap) to request an early check in beforehand?</p><p>Does the appropriation of this differ <em>country by country</em>?</p>",
        "Tags": "['hotels', 'hostels']"
    },
    {
        "Id": "163375",
        "Title": "Which information is stored in European Passports other than what is written in it?",
        "Body": "<p>My question is what information other than the one on the main page of the passport is stored on the chip.E.g. does a spanish passport chip contain information about everytime I travelled abroad with my passport even if it did not require a visa? Does it contain information such as marital status and home address?</p>",
        "Tags": "['customs-and-immigration', 'passports']"
    },
    {
        "Id": "52781",
        "Title": "\"Tropical beach\" in continental Europe?",
        "Body": "<p>I'm looking for a very specific destination. Basically - as close to \"tropical paradise\" as possible, while still in continental Europe - flying is not an option, so aren't ships, but we can use ferries.</p><p>There is also more - the place I'm looking for has to have sandy beaches, and, what's more - it should be possible to rent a house (villa?) with such private beach.</p><p>Given that travel by car takes long(ish) time, I would prefer something close to me (Poland). Croatia would work great if it wasn't for the sandy-beach requirement, which is virtually impossible to match (from what I understand there are some such beaches, but all public, and filled with people, without any kind of privacy).</p>",
        "Tags": "['europe', 'where-on-earth', 'beaches']"
    },
    {
        "Id": "177203",
        "Title": "List of all reasons why somebody can be denied boarding",
        "Body": "<p>While flying internationally throughout the years, I've been denied boarding multiple times for multiple reasons such that I now feel that every time I fly, I am entering a lottery. Can someone provide a list of all the reasons why someone can be denied boarding? I imagine that I could then go through the list as a checklist and that it would provide piece of mind that I am getting onto the airplane. I am interested in all evaluations that happen during check in and at the boarding gate. I would love it if you could include a link to an authoritative resource.</p>",
        "Tags": "['air-travel', 'denied-boarding']"
    },
    {
        "Id": "90165",
        "Title": "What happens on the immigration gate if a passenger lost their fingerprints?",
        "Body": "<p>This is not about me but my science teacher back in my junior high school. After performing scientific experiments for most of his lifetime, he lost all his fingerprints and bragged about it.</p><p>However, the immigrant gate in many countries requires you to register your fingerprint. In this case, it the person who lost his/her fingerprint denied to the entry? Otherwise, how can those people pass their physical verification check?</p>",
        "Tags": "['customs-and-immigration', 'legal', 'biometric-passports']"
    },
    {
        "Id": "123447",
        "Title": "Should I say hello to the passport control officers, or just quietly give them my passport?",
        "Body": "<p>What is the etiquette? What do the passport control officers expect? I’m asking from the point of politeness and efficiency.</p>",
        "Tags": "['customs-and-immigration', 'etiquette', 'officials']"
    },
    {
        "Id": "23607",
        "Title": "Do I need to have money when entering a country as a tourist?",
        "Body": "<p>Am I legally required to be in possession of X dollars/money to gain entry as a tourist, on a tourist visa, in any country ? <br/><br/>If I arrive in the US on a B1/B2 (USA tourist visa) then can the CBP/DHS officers at the port of entry ask me to return to my home country if I am not carrying any money (or limited money, say $100 USD) ? Food and stay will be taken care of by friends/religious establishments.</p><p><strong>Edit</strong> : No money meaning, No plastic/paper money. No funds in a foreign account. Nothing, but may be just a $100.</p>",
        "Tags": "['money', 'regulations', 'solo-travel', 'b1-b2-visas']"
    },
    {
        "Id": "51259",
        "Title": "Where can I take a selfie with kangaroos in Australia?",
        "Body": "<p>I see a lot of people doing this. I believe this is not safe, isn't it?</p><p>Where can I do this?</p>",
        "Tags": "['australia', 'nature-and-wildlife']"
    },
    {
        "Id": "1596",
        "Title": "Changing unusual foreign currencies in London",
        "Body": "<p>I've just returned from several unusual countries in Asia, and annoyingly despite being told I'd have no problem, I'm unable to find anyone in London to change back to pounds.</p><p>I've tried Travelex in Heathrow, a currency exchange place, and the post office.</p><p>The currencies include cash from: Mongolia, Kyrgyzstan, Kazakhstan and Uzbekistan.</p><p>Most of the responses when shown the money is to the tone of \"What the hell currency is this?\" which doesn't fill me with confidence.</p><p>Any suggestions welcomed for places that may change this. Otherwise I may need to go back next year ;)</p>",
        "Tags": "['money', 'london', 'tips-and-tricks', 'exchange']"
    },
    {
        "Id": "107069",
        "Title": "How does overbooking work with reserved seats?",
        "Body": "<p>I never understood how overbooking of flights actually works. I understand the economic principle, just not how its practically done. For the most part there are two types of airlines, low cost carriers and full service airlines.</p><p>On full service airlines you can reserve a seat for free during the booking and on low cost airlines you can't reserve a seat for free, but most often get one assigned when you have to check in online in advance, which most of them require. Either way, you normally have a seat number when you arrive at the airport.</p><p>How can more people show up to the airport than seats are available if it is already sorted out who sits where?</p><p>Do they just assign two people per seat? If both people show up and another seat is empty, wouldn't that would result in massive seat swapping during boarding?</p>",
        "Tags": "['airlines', 'bookings', 'seating', 'overbooking']"
    },
    {
        "Id": "102463",
        "Title": "What is the point of checking in online?",
        "Body": "<p>Since it is often encouraged by airlines, I have adopted the habit of checking in online for flights, even if I am planning on taking suitcases with me.</p><p>How does this benefit me? If travelling with hand luggage only, one can often skip the check-in counters and proceed directly to security (an obvious timesaver), so let us assume that I will check bags.</p><ul><li>I have seen very few airports with dedicated bag drop counters for the passengers who have already checked in at home, so I will have to queue just like those who didn't make use of online check-in. (However at the airports I've been at with such counters, the amount of time saved has been significant, sometimes with nobody waiting at the bag drop counter and dozens at the regular check-in counter.)</li><li>Unless travelling on an ultra low cost carrier, airport check-in does not cost more.</li></ul><p>How does it benefit the airline? There must be a reason they always send those reminder e-mails 24h before departure?</p><ul><li>I don't think they are saving a lot of money on employees, since they still have to man the bag drop counters.</li><li>Agents usually reprint my boarding pass without asking if I actually need one (I don't because I already have it), so printing costs are not reduced either.</li><li>If everyone checked in at the airport and a passenger was delayed for boarding, it would be easier to decide if they should be waited for because they are already at the airport (i. e. checked in) or if the flight should just leave because they didn't even make it to the airport yet (i. e. not checked in).</li></ul>",
        "Tags": "['air-travel', 'luggage', 'airlines', 'check-in']"
    },
    {
        "Id": "21568",
        "Title": "Must I provide proof of onward travel when entering South Africa?",
        "Body": "<p>I will be flying one-way from Europe to Cape Town, South Africa in early December.</p><p>Some time later (early January), I will fly from South Africa to the USA. My employer will be purchasing this ticket; so I don't have it yet (and may not have it at the time I enter South Africa).</p><p>As a U.S. citizen, are there any requirements for proof of onward travel when entering South Africa?</p><p><a href=\"http://travel.state.gov/travel/cis_pa_tw/cis/cis_1008.html#entry_requirements\">travel.state.gov</a> doesn't mention any such requirements, but it also doesn't mention that there are NOT such requirements, so I want to be sure.</p>",
        "Tags": "['us-citizens', 'south-africa', 'proof-of-onward-travel']"
    },
    {
        "Id": "2624",
        "Title": "Is it safe to travel to Egypt in early 2012?",
        "Body": "<p>Have people been travelling in Egypt after March 2011?  What's the situation like over there?  The election is also happening at the end of November.  Should I wait until after the election to book my tour?  I'm planning to visit early 2012.</p>",
        "Tags": "['safety', 'egypt', 'event-based-effects']"
    },
    {
        "Id": "17984",
        "Title": "Is leaving airport at a stop before the final destination illegal?",
        "Body": "<p>There are tricks such as <a href=\"http://hackmytrip.com/2012/01/introduction-to-fuel-dumping/\">\"fuel dumping\"</a> or <a href=\"http://boardingarea.com/blogs/viewfromthewing/2012/01/07/how-to-use-hidden-city-and-throwaway-ticketing-to-save-money-on-airfare/\">\"hidden city ticketing\"</a> which involve booking a ticket composed of several connecting flights, then leaving the airport at a stop, possibly even \"hopping off\" a plane (intermediate landing). Rationale: Sometimes these tickets are cheaper than a ticket to one of the stops. So one adds an additional leg and discards it.</p><p>Some people say that when using such tricks, one enters a <em>legal gray area</em>. But I wonder:</p><p><em>Could leaving the airport at a stop really be illegal, i.e. violating an airline's or a travel agency's terms?</em></p><p>Also there are suggestions that one should not request an upgrade, because then the trick may be discovered by the airline. Here I wonder:</p><p><em>How can they know that one will throw away the last leg?</em></p>",
        "Tags": "['air-travel', 'legal', 'tips-and-tricks', 'price']"
    },
    {
        "Id": "4675",
        "Title": "3 days in London. What do I absolutely have to see?",
        "Body": "<p>In a few weeks I will be in London for the first time for 3 days to take care of some business. I thought I could take advantage of the situation and do some sightseeing.</p><p>What are the places I must absolutely visit? So far I got the Big Ben and Westminster Abbey. Also, what are some good places to go out and have some fun in the night?</p><p>EDIT: Thank you all for your responses. London is a wonderful place, and your answers allowed me to have a very good time there.</p><p>One thing I haven't seen mentioned, if you are looking for pubs go to Clapham Common. Had a blast there.</p>",
        "Tags": "['sightseeing', 'london', 'nightlife']"
    },
    {
        "Id": "10819",
        "Title": "General security concerns about Cancun, Mexico",
        "Body": "<p>I am planning to go on vacation with my girlfriend (We are both in our early twenties) in a 5 star hotel in Cancun, Mexico. </p><p>My concerns:</p><ul><li>I've seen a documentary where a young guy got drugged in Mexico at a restaurant and woke up missing a kidney.</li><li>Everyone tells me Mexico is dangerous</li><li>I've read that some places in Mexico are dangerous i.e. Ciudad Juarez</li></ul><p>I am afraid that we will look vulnerable (2 young adults alone). Some of the hotel we want to go include prepaid restaurant coupons. I am afraid that we will have to travel outside of our hotel to the restaurant, dine and get drugged and wake up missing some organs.</p><p>UPDATE: The vacations were amazing. Although some places might look sketchy, the overall experience was very safe. The trip is well organized by the travel agency/hotel so there is nothing to be worried about.</p>",
        "Tags": "['safety', 'security', 'mexico', 'cancun']"
    },
    {
        "Id": "119361",
        "Title": "Proper clothing for rather pale person in very hot and sunny climate",
        "Body": "<p>I'm from central Europe and more on the pale side; I don't tan easily.</p><p>When hiking locally (Alps, etc) I usually get away just fine with short trousers/T-shirts and a panama hat (i.e., straw), but then that's only for a day apiece or so (and mostly in autumn/winter/spring anyway, so heat is not the issue). I am aware that these kind of clothes are not applicable for a desert; I am certain that I would get sunburned, quickly.</p><p>What's the best solution for very hot climates (e.g. Egypt), and 1-2 weeks, mostly being out and about? What material cools, wicks sweat away, and keeps the sun away from my skin best?</p><p>I appreciate that the locals have great solutions for that, but I would prefer something which is \"culture-neutral\", i.e., I don't wish to commit a faux-pas by inadvertently wearing something that may have a political meaning locally (i.e., some garb having strong connotations in some area, which I might not be aware about). And also something that does not stand out in Europe, and will be good for hiking here as well.</p><p>Is there something significantly better than just any old white/beige, well-ventilated cotton trousers? Are the more technical \"outdoor\" garbs much better? I don't need lots of pockets, etc.</p>",
        "Tags": "['hiking', 'clothing']"
    },
    {
        "Id": "182782",
        "Title": "Using English in Europe",
        "Body": "<p>I'm from the United States (born and raised) and have dual citizenship (Portugal). At some point, I want to spend time (more than just a vacation) in Europe. Linguistically, I feel confined to Portugal, Spain, France, Ireland, and (if I can improve a bit) Italy.</p><p>How much is English spoken around the EU? I assume the general rule is true that English is spoken in tourist areas, but I want to know about the \"real\" parts. Are there places where I can get by with only English? Most importantly, is it seen as <a href=\"https://en.wikipedia.org/wiki/Ugly_American_(pejorative)\" rel=\"noreferrer\">rude</a> (acting like someone has to cater to me despite me being in their country) to use English?</p>",
        "Tags": "['international-travel', 'europe', 'language-barrier', 'english-language']"
    },
    {
        "Id": "110666",
        "Title": "Is RTP-NL operational yet?",
        "Body": "<p>The Netherlands is implementing a Registered Traveller Programme to allow holders of certain passports to use the automatic gates at Schiphol (AMS) abbreviated RTP-NL. Announced last year, the implementation of that program has been delayed until Q1 2018, which is now. Does anyone know if that program is taking applications yet?</p>",
        "Tags": "['netherlands', 'customs-and-immigration']"
    },
    {
        "Id": "74315",
        "Title": "What should I do if I forgot to turn in a hotel room key card after checking out?",
        "Body": "<p>I recently stayed at a hotel and received two room key cards to access the room: one for me and one for my brother. They are like credit cards with a magnetic strip to swipe into the door lock. My brother did the check out and turned in his room key card, but I forgot to turn mine in and didn't realize it until I was already at the airport.</p><p>What do I do about this? I'm not sure if it still works or not, or if it has any value to the hotel. Do I mail the room key card back to the hotel? Or do I just recycle the card?</p>",
        "Tags": "['hotels', 'etiquette']"
    },
    {
        "Id": "76362",
        "Title": "Can I get a hotel room in the US when I am 18 years old?",
        "Body": "<p>A friend and I would love to visit Seattle next year. By then, we'll both be 18 years old. Is it possible for us to get a hotel room for about a week, even though we aren't 21 years old? If not, is there any other possibility where we can sleep?</p>",
        "Tags": "['usa', 'hotels', 'age-limits']"
    },
    {
        "Id": "71245",
        "Title": "Can I ask for two meals for my flight without paying extra?",
        "Body": "<p>I know, this is a funny/sort of stingy question, but the last time I took a plane, after having the meal they serve, I was still kind of hungry so my girlfriend told me to ask for another one. I didn't do it but I kept wondering if it was possible.</p><p>Is there anyone that works on an airline that could confirm how it works for these cases?</p>",
        "Tags": "['tips-and-tricks', 'in-flight-services']"
    },
    {
        "Id": "131661",
        "Title": "Why is it sometimes cheaper to fly within the UK than taking the train?",
        "Body": "<p>We are planning to travel to Scotland from Manchester and after looking at the prices for both flights and trains. It's cheaper to fly there than taking a train. I've also noticed the same thing when comparing flights and train prices from London to Manchester.</p><p>Why are train tickets so expensive?</p><p>For example, on the 6th of February, 2019 a return ticket from Manchester to Aberdeen for 23-24 March costs £133.30. </p><pre><code>OFF-PEAK RETURNAny off-peak train. Return within 1 month.1 Adult @ £133.30</code></pre><p>Flights between Manchester and Aberdeen today for that weekend vary between £30-£66. Flying is also faster including check-in times. </p>",
        "Tags": "['air-travel', 'uk', 'trains', 'tickets']"
    },
    {
        "Id": "69711",
        "Title": "What is the longest stretch of the Autobahn that is guaranteed to have no speed limits?",
        "Body": "<p>I would like to rent a nice sports car this summer and go for a drive on the Autobahn. What is the longest stretch of the German highways that is <em>guaranteed</em> (short of a natural disaster) to have no speed limits? </p><p>If there's more than one such long stretch, which one is likely to have the least amount of traffic?</p>",
        "Tags": "['germany', 'driving', 'where-on-earth', 'traffic']"
    },
    {
        "Id": "186447",
        "Title": "Can you travel without ID to another country to get to your passport country's embassy if there is none in the current country (Europe)?",
        "Body": "<p>I am trying to find a plausible answer to a question about a scenario in a movie that involves travel across borders in Europe and what is possible in real life.</p><p>Question:<br />If I am in a country that does not have an embassy of my passport country, and my passport is lost while there, can I travel without any ID to a second country that DOES have an embassy in order to get a new passport or ID (or any other excuse that can get you across the border)?</p><p>Context:<br />In the movie The Bourne Identity, Jason Bourne was able to get from Imperia, Italy to Zurich, Switzerland with only cash using the train. At the time he had no ID whatsoever on him, just cash.</p><p>Many people wonder how Jason got from Italy to Switzerland without any form of ID. The movie was filmed/released in 2002 and at that time Switzerland was not part of the Schengen area, so I am pretty sure there would have been ID checks when crossing the border.</p><p>Personal experience:<br />I travelled from Germany to Denmark (both Schengen countries) in 2022 by train and was asked to show my passport which I thought was very strange. Don't recall if I had to show my passport when I travelled from Germany to the Netherlands. Surprisingly, I travelled by plane within Schengen countries a lot and was not once asked to show my passport, only when I travelled by train.</p><p>So I am wondering if there is some rule or excuse that could get you across borders anywhere, preferably throughout Europe for the sake of this question, either now or before when the movie was filmed, without any ID at all in special circumstances, like the one mentioned above ie \"I lost my passport and am on my way to the nearest embassy in the next country to get a new one?\" or if this is \"just a movie\" in this case. And movies aside, if I did get in a situation where I lost my ID and the nearest embassy is in another country, what can I do? Can I go there (cross the border) without ID?</p>",
        "Tags": "['schengen', 'trains', 'europe', 'borders', 'id']"
    },
    {
        "Id": "3666",
        "Title": "Can I see Lebanon from Cyprus?",
        "Body": "<p>On the map, Cyprus seems not to far away from Lebanon. Approximately 100 kilometers. Is it possible to see parts of Lebanon from anywhere in Cyprus?</p>",
        "Tags": "['vantage-points', 'cyprus', 'lebanon']"
    },
    {
        "Id": "81492",
        "Title": "Why is international first class much more expensive than international economy class?",
        "Body": "<p>I fly domestic first class a lot and it is rarely more than double the cost of an economy ticket. For example, for Thanksgiving my first class ticket is costing about $1200 where the economy tickets cost about $800.</p><p>I am looking to book an international flight, however, and the cost for first class is WAY WAY higher than economy, almost prohibitively so (see graphic below). <strong>Why is the proportional cost for international first class so much higher?</strong></p><p><a href=\"https://i.stack.imgur.com/jZVXY.png\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/jZVXY.png\" alt=\"first class ticket cost\"></a></p>",
        "Tags": "['air-travel', 'budget', 'international-travel', 'luxury']"
    },
    {
        "Id": "51286",
        "Title": "Non-seafood food options in Tokyo?",
        "Body": "<p>I don't eat a lot of seafood but will eat pretty much anything else. I know a lot of Japanese cuisine is based on seafood - but are there other Japanese meat or vegetable dishes I should try? I'd like to try as much as possible to not eat Western (boring) food while I'm visiting. </p>",
        "Tags": "['japan', 'food-and-drink', 'tokyo']"
    },
    {
        "Id": "78938",
        "Title": "Is sweating more common during air travel?",
        "Body": "<p>When I'm travelling by air, my clothes (underwear in particular) seem to collect more sweat than usual. This happens even when the environment is not particularly warm, I'm not wearing a jumper or long pants, and I'm not using the blanket supplied. I'm not nervous about flying either. I occasionally get up to go to the toilet, and travel in economy class in an aisle seat. I don't get car-sick, in fact I can read quite comfortably even while I'm in a bumpy car ride, and I'm not aware of getting air sick.</p><p>Is there anything about air travel (perhaps the narrow seats?) that makes sweating more of a problem? What can I do to prevent it? </p><p><a href=\"https://travel.stackexchange.com/q/20639/324\">How to hide your bodily odors after a long flight?</a> is more how to hide sweating that does happen.</p>",
        "Tags": "['air-travel', 'hygiene']"
    },
    {
        "Id": "150628",
        "Title": "Why should you have travel insurance?",
        "Body": "<p>I have been wondering this for a while. I imagine that when I greatly simplify things, the price of travel insurance consists of essentially two parts:</p><ol><li><p>what you are going to cost the insurance company</p><ul><li>sum of all the individual things that can happen to you multiplied by their probability</li></ul></li><li><p>insurance company's fee</p><ul><li>insurance companies are \"for-profit\"</li><li>this also covers their PR, marketing, etc.</li></ul></li></ol><p><strong>An example</strong>:You are going to the Himalayas. The probability of you falling down a mountain and breaking you leg is 0.1 and the cost of sending a helicopter for you and then treating your leg in a local hospital is $5000. Plus, the chance of you freezing is 0.5 and the cost of unfreezing you is $1500. Therefore, travel insurance for your trip could cost you:</p><pre><code>0.1*5000 + 0.5*1500 + x</code></pre><p>where x is what the insurance company charges you on top of how much you will most likely cost them. For the reasons above, it seems to me that </p><pre><code>x > 0</code></pre><p><strong>Question</strong>: Doesn't it make sense to, instead of buying travel insurance, just save the money you would otherwise pay for it and when something happens to you, pay it from this saved money? </p><p>Please note that I greatly simplified things for the sake of conciseness. </p>",
        "Tags": "['money', 'health', 'insurance']"
    },
    {
        "Id": "163944",
        "Title": "Why do countries check if arriving persons are vaccinated and not if they have antibodies?",
        "Body": "<p>I have been following the COVID-related travel restrictions and there is something that I do not understand: in some countries travellers can skip quarantine if they are vaccinated.</p><p>However, why instead of saying if you they are vaccinated or not, are not they checking if the person has antibodies against coronavirus?</p><p>People can get the antibodies by getting infected with the virus. The antibodies will probably decrease in time (no matter if they were produced because of the infection or due to the vaccine).</p>",
        "Tags": "['international-travel', 'covid-19', 'health']"
    },
    {
        "Id": "68201",
        "Title": "Too many countries to apply for Indian E-Visa?",
        "Body": "<p>So I'm applying for an E-Visa for India.  At one point in the form it asks for the countries you've visited in the past 10 years.  I started listing them, got up to the 'C's, and received this error:</p><p><a href=\"https://i.stack.imgur.com/2VQyA.png\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/2VQyA.png\" alt=\"Countries Visited in Last 10 years: Max length of Visited Country is reached\"></a></p><p>Now what? Do I just say \"too many for your form\" or just list a few recent ones? Or just the ones I spent the most time in?</p>",
        "Tags": "['visas', 'india', 'paperwork']"
    },
    {
        "Id": "124010",
        "Title": "Is it possible to take a photo of Elizabeth Tower (Big Ben) from an airplane window?",
        "Body": "<p>I see sometimes photos of the Elizabeth Tower allegedly taken from an airplane window. Here are just two of them taken from Instagram account <em>loves_bigben</em>.</p><p><a href=\"https://i.stack.imgur.com/yf0Jy.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/yf0Jy.jpg\" alt=\"Big Ben from an airplane\"></a></p><p>Do passenger airplanes really fly such low heights above the center of London that it is possible to take such photos? </p>",
        "Tags": "['london', 'photography']"
    },
    {
        "Id": "161384",
        "Title": "Are Starlink antennas portable for use across the globe during travel?",
        "Body": "<p>Starlink is slowly starting to spread their wings globally, with <a href=\"https://www.pcmag.com/news/spacexs-starlink-can-start-serving-users-in-canada-regulator-says\" rel=\"noreferrer\">a recent beta launched in Canada</a> after their initial launch in the US.</p><p>Let's assume I buy the antenna/dish and their service in Canada. If I decide to travel to the US for a holiday, can I take the equipment with me and use the same service there? More generally, once Starlink spreads globally, would it be possible to take my local product wherever I go and hook into their internet service wherever I land? Or is there something in their contract/setup that prohibits that kind of global travel use?</p><p><sub>This question was originally asked on <a href=\"//space.stackexchange.com\">Space.SE</a> (<a href=\"https://space.stackexchange.com/q/48810/38415\">Portable Starlink antennas</a>), but may be a better fit here as it relates more to travel than space exploration.</sub></p>",
        "Tags": "['international-travel', 'internet']"
    },
    {
        "Id": "55409",
        "Title": "What is the hotel room card slot inside the room for?",
        "Body": "<p>Several hotels I've stayed in lately (in the Middle East if that matters) have a card slot just inside the door of the room, and it appears that the lights/AC in the room only work if you have one of your room cards placed in the slot, and will turn off about 15 minutes after you take it out. The hotel staff has referred to it as the \"security card\" but assumed I knew what that meant. What is the purpose of this slot? Is it just an energy-saving feature to make sure the electric shuts off when no one is in the room?</p><p>Stranger still is that the housekeeping staff insists I take the card with me when I leave (though I've got the standard 2 cards for my room so I have another one anyways). Also in one of the hotels the room lights (not the bathroom) would <em>only</em> work for about 15 minutes after inserting the card, so I'd have to continually re-seat it to see anything. Thank god I was only there for one night.</p><p>What is this key card slot and what is its purpose?</p><p><strong>Conclusion:</strong> For the record, in the hotel I mentioned first it seems to only have controlled the lights. The new hotel that I'm in, it controls lights and plugs (unfortunately) and they specifically only gave me one keycard, though they had no problem giving me a second card to keep the plugs running while I'm gone. I always turn out the lights anyways, so it's not wasting power that I don't want to use to begin with.</p>",
        "Tags": "['hotels', 'tips-and-tricks', 'power']"
    },
    {
        "Id": "40051",
        "Title": "Is Amsterdam a dog friendly city?",
        "Body": "<p>Are there many places in Amsterdam that would be happy for us to bring a dog in (cafes, restaurants, public buildings)?</p><p>What is the general attitude to dogs in public places in the Netherlands?</p>",
        "Tags": "['netherlands', 'amsterdam', 'pets']"
    },
    {
        "Id": "116",
        "Title": "How much Russian do I need to know for travelling within Russia?",
        "Body": "<p>Or alternatively - how well-spoken (and widely-spoken) is English? </p><p>I intend to visit St. Petersburg, Moscow, Irkutsk and Vladivostok.</p><p>I feel like I might have the most troubles in the latter two cities. </p><p>Should I be able to read the Cyrillic alphabet?</p>",
        "Tags": "['russia', 'language-barrier', 'languages', 'russian-language']"
    },
    {
        "Id": "30325",
        "Title": "Airport security: what if I carry an item with traces of explosive?",
        "Body": "<p>One day I was travelling from UK to Switzerland, the security officer at Gatwick airport check (with a kind of swab) all my electronic devices (mainly phone and camera chargers + cables) to see if it was in contact with any explosive materials.</p><p>Now I just remember that today I use a ring from a hand grenade to keep my home keys. </p><p>The ring is just the outside part which hold the pin and come from an exercise hand grenade but with the real explosive inside.</p><p>Just to mention this is not dangerous at all, it is just a metal part, which was one day on an exercise hand grenade. I just have it from my compulsory military service and it is not forbidden material.</p><p>My question is: is there any probability to detect some explosive (even it should not have been in contact) at the airport if they try to check my keys and what could be the consequences? Do you advise me not to travel with such a thing?</p>",
        "Tags": "['air-travel', 'airport-security', 'security']"
    },
    {
        "Id": "90229",
        "Title": "Do hotels in Europe permit two adults and two kids to all stay in just one room?",
        "Body": "<p>My kids, 12 years old and 5 years old, will not sleep in a separate room if it is not our own home or their grandparents'. They insist on staying in the same room as my wife and me.</p><p>I would like to know the typical policy of hotels (budget and mid-range) in Europe about such arrangements. </p><ul><li>Is there any provision for adding an extra bed in the room, such as on payment of extra charges?</li><li>Is there any specific name for such rooms in countries like France, Spain, Italy, the Czech Republic, or Romania?</li><li>Is this something that is looked down upon?</li></ul>",
        "Tags": "['europe', 'accommodation', 'children', 'family']"
    },
    {
        "Id": "178807",
        "Title": "Is it feasible to travel to Stuttgart via Zurich?",
        "Body": "<p>I'm preparing to travel to Stuttgart, Germany.</p><p>The following map shows cost from my nearest airport to various locations near Stuttgart.</p><p>The most economical option seems to be to go to Zurich and get a train to Stuttgart. I do not intend to stay in Zurich, but only in Stuttgart for a few days.</p><p>Is this indeed economical? Do travelers frequently do this? If yes, should I get my visa from German or Swiss embassy?</p><p>There's also the question of CHF/EUR. If I only ever have to spend on rail(which I can do online as such), does it make sense to keep CHF with me?</p><p><a href=\"https://i.stack.imgur.com/RIT2x.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/RIT2x.jpg\" alt=\"enter image description here\" /></a></p><p>Edited to add: I had used google flights. Those were round trip costs from New Delhi, India(DEL) to Europe for a one week trip in May. Later I did realize the prices are extremely variable and keep changing a lot.</p>",
        "Tags": "['transit', 'trains', 'international-travel', 'schengen-visas', 'europe']"
    },
    {
        "Id": "98932",
        "Title": "Is it safe to travel by bike between cities in Spain?",
        "Body": "<p>I've been dreaming about taking a long bicycle trip in Spain, from Malaga to Barcelona. It is about 1000 km. Is it safe? In other words, does Spain have enough bike lanes, or would I have to bike along common roads with cars? Google Maps doesn't show any bike lanes.</p>",
        "Tags": "['safety', 'spain', 'bicycles']"
    },
    {
        "Id": "44664",
        "Title": "What can I do in Hong Kong with a three hour layover?",
        "Body": "<p>I was wondering if there was anything I can do in Hong Kong for a small amount of time, aside from just hanging around in the airport. </p><p>Are there nearby places reachable within 30~ minutes of transport or less? Street food, parks, or anything at all?</p>",
        "Tags": "['layovers', 'hong-kong', 'hkg']"
    },
    {
        "Id": "114818",
        "Title": "How can I find restaurants in the USA where tipping is not expected?",
        "Body": "<p>I am uncomfortable with tipping and would much rather eat at sit-down restaurants in the United States that pay their employees fairly without expecting customers to supplement with tips (as occurs in many other countries in the world). In other words, I want to eat at restaurants that explicitly do not allow tips.</p><p>Some restaurants have been in the news for <a href=\"https://www.cbsnews.com/news/more-restaurants-adopting-no-tipping-policy/\" rel=\"noreferrer\">switching to a no-tip system</a>. Aside from scouring headlines, how can I find out which sit-down (not fast food) restaurants in a city I travel to will not accept tips?</p>",
        "Tags": "['usa', 'restaurants', 'tipping']"
    },
    {
        "Id": "49282",
        "Title": "How do I avoid conversation with strangers while traveling?",
        "Body": "<p>Personally I hate traveling not just because I hate going to a new city but because of seeing strangers who are watching and trying to start conversation with me. Well talking with someone is not a bad thing as it's a good habit but personally I hate talking to them because I am attached to those persons only to whom I know. But still how can I avoid someone talking to me ?</p><p>Well at first they say hey 'hello' and as being a nice human I also say 'Hi' and then just little bit formal chats. But then when it comes to talking like more than 5 minutes it's really hard for me to take that thing. Well I can't simply tell them to leave me alone as it would be quite bad for me and they are also good people so what to do ?</p><p>How can I avoid these things ? </p>",
        "Tags": "['trains', 'india', 'solo-travel', 'etiquette']"
    },
    {
        "Id": "107652",
        "Title": "How to obtain the return flight boarding pass?",
        "Body": "<p>Believe it or not, I've never flown before... I am flying United Airlines for a vacation for about a week and then I'm flying back via United Airlines. I read online that starting 24 hours before my flight I can check in online and United Airlines will give me a boarding pass to print.</p><p>However, I'm not sure what to do on my return flight since I won't be anywhere near a printer and I don't want to find a print shop and pay to have the passes printed. I really couldn't find any answers on Google... And I feel stupid even asking this... But how do I get a boarding pass for my return flight?</p>",
        "Tags": "['air-travel', 'tickets', 'united-airlines']"
    },
    {
        "Id": "168582",
        "Title": "Is MyTrip.com safe to use?",
        "Body": "<p>I've found an itinerary on MyTrip.com that's well priced and can't seem to replicate the same fare on Google Flights. Is it safe to use?</p>",
        "Tags": "['air-travel', 'bookings']"
    },
    {
        "Id": "2695",
        "Title": "How to calculate the air-line distance between two places?",
        "Body": "<p>A lot of the time, I'm looking for a way to calculate the air-line distance between two places, most often city centers.</p><p>For example when I flew from Zurich to Helsinki I wanted to know how far it was. With Google Maps I can do it but not for the air-line distance.</p><p>So does anyone know a tool for doing this or can give me advice on how to do it manually using the geo coordinates? Then I could write my own little tool.</p>",
        "Tags": "['air-travel', 'planning']"
    },
    {
        "Id": "119431",
        "Title": "In practice, what is the distinction between ESTA and visas?",
        "Body": "<p>It is <a href=\"https://www.google.com/search?biw=1858&bih=1014&ei=0MNcW_bFMuLQ9APLj7-wDg&q=esta+is+not+a+visa+site%3Atravel.stackexchange.com&oq=esta+is+not+a+visa+site%3Atravel.stackexchange.com\" rel=\"noreferrer\">often claimed</a> that ESTA is not a visa - both by the US government and the travelers themselves. However in practice, I find it difficult to see the distinction between ESTA and e-visas:</p><ul><li>It costs money, while a true visa-free system is, well, free</li><li>You have to fill out personal details about yourself to receive it</li><li>Not everyone who's eligible is approved for it</li><li>Even if you enter overland, you still have to answer the same questions on form I-94W and pay a fee to enter the country</li><li>The vast majority of VWP passport holders enter the US by air, so they do need the ESTA</li></ul><p>What is the exact distinction then (in practice) that separates ESTA from a regular e-visa? </p>",
        "Tags": "['esta', 'terminology']"
    },
    {
        "Id": "23689",
        "Title": "Where in Istanbul airport can I rent a portable 3G/LTE Wifi hotspot?",
        "Body": "<p>Since Turkey's mobile phone legislation is a pain in the ass, I'm considering renting a 3G/LTE Wifi hotspot on the two stopovers I will have there in February.</p><p>Is there a company which could rent me one at Istanbul airport? If not, maybe I can find such a service in the center of the city?</p><p>Technically I could just buy a sim-card and discard it later, but my 24-hour stopovers are over 3 weeks apart so it would be impossible for me to get Internet on the way back, since my IMEI would have been blocked by then.</p>",
        "Tags": "['turkey', 'internet', 'rental', 'istanbul', 'isl']"
    },
    {
        "Id": "62087",
        "Title": "How efficient is the immigration service at Oakland?",
        "Body": "<p>OAK doesn't handle too many international flights.  How efficient are CBP at processing arrivals for those it does handle?  I'm arriving as a U.S. citizen from Stockholm on a Monday evening (scheduled arrival 5 p.m.) and wondering how long I should expect to wait.</p>",
        "Tags": "['customs-and-immigration', 'oak']"
    },
    {
        "Id": "42124",
        "Title": "How to remove airlines/security tag stickers from suitcases?",
        "Body": "<p>I travel a lot, for both business and pleasure reasons. One of the annoying things I face (beside full passport pages) is the many tags stuck to my suitcase which I like to take in almost all my trips. I recently had to give up my favorite 12 years old Samsonite hard-shell suitcase because it was too ugly and I could not remove the tags easily. </p><p>This is a photo of one of my other suitcases which is not really old and does not have many stickers:</p><p><img src=\"https://i.stack.imgur.com/sfqHtl.jpg\" alt=\"suitcase with numerous old tags\"></p><p>I know that the best way to get rid of those is to remove them while they are fresh (eg. right after arrival) when the glue still not really dry, but I just keep forgetting and by the time I notice that tags are really stuck and won't be removed.</p><p><strong>How do I remove old tag stickers from hard-shell suitcases completely?</strong></p>",
        "Tags": "['luggage', 'tips-and-tricks']"
    },
    {
        "Id": "117900",
        "Title": "German credit card in the US",
        "Body": "<p>I will be travelling to the US soon and for that I obviously need a proper credit card, because Americans love their plastic money. I already own a credit card but I am a little bit confused, because the magnetic stripe seems to be just plain black paint with blocking number of the bank written in the middle without any actual function (I could be wrong). This fits to my research where I learned that in the EU the chip-and-pin verification is almost the only acceptable system.</p><p>In the US however. I learned that they still widely use the older and far less secure swipe-and-sign system.</p><p>I also learned that there is a difference between credit cards and cards coupled with your bank account called VISA debit cards (not to confuse with the normal bank card used to withdraw money and such). When I asked my bank support the reply was (translated from German): technically your Visa card is set up as a \"deferred debit\", this fulfils the requirements to be a credit card.</p><p>Are European credit cards still capable of the swipe/sign system used in the US? And can I use the \"deferred debit\" card just like any other credit card used by Americans? e.g. Rent a car, hotel rooms etc.</p>",
        "Tags": "['usa', 'money', 'payment-cards', 'central-europe']"
    },
    {
        "Id": "47758",
        "Title": "Tipping for takeout food in the USA",
        "Body": "<p>When I go to a restaurant in the USA and order food for takeout, am I supposed to tip?</p>",
        "Tags": "['usa', 'restaurants', 'tipping']"
    },
    {
        "Id": "145",
        "Title": "When and where do I have the highest chance of seeing auroras?",
        "Body": "<p>I'm wondering what time of year is best, and what locations might be best, for catching the aurora.</p><p>I'm currently thinking of February up at Sweden's ice hotel, but since the whole point of the trip is so that my wife can see the Aurora, I want to pick a location that affords the best chances to see one.</p><p>Edit:Just adding a link so you can see realtime aurora activity in the northern hemisphere</p><p><a href=\"http://www.gi.alaska.edu/AuroraForecast/3\">http://www.gi.alaska.edu/AuroraForecast/3</a></p><p>I know this is anecdotal, but I ended up going to Iceland in late february during the new moon and saw the aurora 3 out of 6 nights I was there.  There was activity every single night but the biggest problem was weather.  It was cloudy almost every single night. </p>",
        "Tags": "['sightseeing', 'nature-and-wildlife', 'destinations', 'auroras']"
    },
    {
        "Id": "27287",
        "Title": "Do I need to pass customs if I enter by swimming over a body of water?",
        "Body": "<p>Suppose I'm a long distance swimmer and swim across a large body of water to another country, like from France to England, or from England to the USA. Do I need to pass customs? Do I need the same documents as I would need when entering via an airport or a harbor?</p><p>Suppose I don't start on a shore, but on a boat in international waters. Do the same rules apply?</p>",
        "Tags": "['customs-and-immigration', 'swimming']"
    },
    {
        "Id": "5783",
        "Title": "Finding drinkable water while travelling",
        "Body": "<p>I tend to get dehydrated rather easily, a problem that is compounded when I travel to locations where the water is unsafe/unfamiliar for me.  I often seem to find myself having to choose between getting sick from dehydration and (potentially) getting sick from drinking local water.</p><p>I'm not accustomed to bringing a filtration/purifying device with me (though if this is a practical solution to my problem, I am definitely open to suggestions), and bottled water gets very expensive very quickly (not to mention it always seems to run out so fast...).  I am at a loss for how else I might approach this problem.</p><p>How can I ensure that I have access to drinkable water when I travel?</p>",
        "Tags": "['health', 'food-and-drink', 'tap-water']"
    },
    {
        "Id": "94877",
        "Title": "Finding public shower in Europe",
        "Body": "<p>While there are <a href=\"https://travel.stackexchange.com/search?q=shower%20is%3Aquestion\">plenty</a> of questions on SE Travel like <em>Where to shower in X or Y</em> I wasn't able to find a <strong>common approach</strong> to finding cheap or free public showers. For example, how do long-haul truckers usually make shower in Europe?</p><p>I do know about <a href=\"https://www.warmshowers.org/faq#t23n3798\" rel=\"noreferrer\">WarmShowers</a> community, but it seems that they accept only cyclists which is not the case for me. Let's take the common case any traveler faced in his life:</p><ol><li>You are a single traveler</li><li>You are making a layover or short stop in some city, airport or bus station</li><li>You have a fair amount of time (3-4 hours)</li><li>You do <strong>not</strong> intend to book any hotel in that city.</li><li>You are just looking for a shower.</li></ol><p>Is there any decent strategy I can use in any European country to find a public shower? If someone can share some strategy concerning worldwide, you are welcome, while I doubt there will be any common features in such diverse communities like Czech and Japan, for example. </p><p>P.S. By word <em>cheap</em> I mean €5-10 max.</p><p><strong>UPDATE:</strong> as there were plenty of swimming pools suggestions, I can accept such option, however, it's preferable to give a detailed answer. Not just <em>go to swimming pool</em>, but a map of swimming pools which can be filtered by price, for example.</p>",
        "Tags": "['budget', 'europe', 'hygiene', 'worldwide']"
    },
    {
        "Id": "9885",
        "Title": "For fear of flying is drinking alcohol a healthier option than pills?",
        "Body": "<p>I have a series of flights ahead of me and I have a fear of flying. I usually drink in excess prior to boarding.I drink around 0.5 litres of beer and around 3 shots of whiskey prior to boarding and drink 2 shots of whiskey an hour during the flight to stay calm. When there is turbulence I drink and extra shot or two. During a long flight I go through 10-14 shots in total and an occasional beer.</p><p>People tell me that pills are better than this. I have also heard a mix of opinions on which option is more healthy. Which option is considered to be least harmful to the health?</p>",
        "Tags": "['air-travel', 'health', 'alcohol']"
    },
    {
        "Id": "66719",
        "Title": "Traveling to US with ESTA but have an Iranian father. Do I need a visa instead?",
        "Body": "<p>I am a British citizen and have dual nationality with Hong Kong but my father is Iranian. Does this mean I also have Iranian nationality? I've never held an Iranian passport or traveled to Iran and he has never informed the Iranian government of my existence.</p><p>I already had an ESTA to travel to US in December 2015 and it hasn't been revoked though I didn't put on the application that I was an Iranian national because I legitimately didn't think I was but this new law has made me double check. I'm going to the US again in May and was wondering if the US would consider me an Iranian national and therefore need a visa. </p><p><strong>Edit 08/06/2016:</strong> Just wanted to update this since I hate it when I find a closed thread with no answer.I ended up going to the US without a visa and was allowed through with no problems. An uncle I was traveling with who is a British citizen but was born in Iran got a visa, and when he was going through customs and immigration was asked why he got a visa when he didn't need one! The officer said he would have been fine with just an approved ESTA... </p>",
        "Tags": "['visas', 'esta']"
    },
    {
        "Id": "13985",
        "Title": "London to Dublin: bus, train, plane, or car rental?",
        "Body": "<p>London to Dublin: bus, train, plane, or car rental? I would like to travel from London to Dublin (with family). But the web-sites for the ferries seem to be vague about the cost for automobiles. (And they seem to be focused on the last-minute travelers). </p><p>The date is May, 2013. I would prefer the train/ferry, but what are the other options?</p>",
        "Tags": "['trains', 'transportation', 'london', 'ferries', 'dublin']"
    },
    {
        "Id": "126626",
        "Title": "Can I buy only the wine glass in the Munich Christmas market?",
        "Body": "<p>In Munich, GER, I plan to visit the Christmas market for some <em>Glühwein</em> (hot wine).</p><p>From what I read, you can return your glass and get a portion of the price back. The glass is somewhat a souvenir.</p><p>I'd like to gift one to mama and one in my bf. Can I drink one and ask for an extra glass (which I will pay it's atomic price)? That would mean that I would walk away with two glasses, while drinking only one glass of wine.</p><p>I am afraid that this won't be allowed, and since my German are way too rusty, I thought I should ask, since I couldn't find my answer in the Internet.</p><p>Edit: There is a debate to whether it's allowed to keep the cup/glass in the first place.</p>",
        "Tags": "['germany', 'munich', 'souvenirs', 'bavaria', 'christmas']"
    },
    {
        "Id": "6306",
        "Title": "Is it possible to rent a car in one US state and drop it off in another?",
        "Body": "<p>I'm from the UK and I'm looking at planning a road trip around the US with some friends. I wondered if it was possible to rent a car in one state but drop it off in another.</p><p>If it's possible do they charge more for hiring this way? Are there some states that don't allow this to happen?</p>",
        "Tags": "['usa', 'car-rentals']"
    },
    {
        "Id": "45219",
        "Title": "Walking the Caminito Del Rey, or part of it, with children",
        "Body": "<p>I have noted with great anticipation that the refurbished <a href=\"http://www.caminitodelrey.info/en/#2\" rel=\"nofollow noreferrer\">Caminito Del Rey</a> will open this week.  The opening was originally scheduled for today, <a href=\"http://www.theolivepress.es/spain-news/2015/03/25/caminito-del-rey-inauguration-postponed-as-spain-mourns-those-onboard-crashed-germanwings-flight/\" rel=\"nofollow noreferrer\">but has been delayed</a> because Spain is in mourning for the recent air tragedy.</p><p>I would like to go there with my son and his friend, both 10, possibly a group of a dozen during Easter break in two weeks.  I do NOT want to walk the full 4 km of the path, instead just along on the board-walk for maybe 200 meters, have a view, have a snack, take some pictures, and then return to the control point.  Strike it off the bucket list and provide a thrilling memory for the children.</p><p><img src=\"https://i.stack.imgur.com/VxVa5.jpg\" alt=\"enter image description here\"></p><p>The board-walk part is acceptably safe.  The part beyond the board-walk requires sportsman-level fitness and a passion for adrenaline.  </p><p>The question:  Is there a minimum age threshold?  Common sense says there must be and it would be a shame to go all that way and get turned back.  The <a href=\"https://reservas.caminitodelrey.info/\" rel=\"nofollow noreferrer\">booking part of the site</a> is in Spanish and perhaps there is info there, but it doesn't seem to work with Google Chrome.</p><p>Adding 26 March 2015</p><p>We have previously been on the Grand Canyon Skywalk, which I am assuming is comparable...</p><p><img src=\"https://i.stack.imgur.com/iDYpj.jpg\" alt=\"enter image description here\"></p>",
        "Tags": "['children', 'spain', 'hiking', 'malaga']"
    },
    {
        "Id": "164003",
        "Title": "Where can people allergic to dairy eat when travelling in France?",
        "Body": "<p>Typically foreigners think of the food of France as classic French cuisine. To say that this styles likes cream and butter is a bit of an understatement. Is there many other types of restaurants that don't have this dairy focus. Where could a lactose intolerant person eat in France?</p><p>It is definitely an allergy. I'm violently ill and can feel my chest closing up when I consume it.</p>",
        "Tags": "['france', 'food-and-drink']"
    },
    {
        "Id": "3748",
        "Title": "Flying with a desktop computer (as checked luggage)",
        "Body": "<p>On an upcoming trip, I will be taking a desktop computer and monitor as checked luggage (on a United/Continental flight). What should I be aware of when doing this? What needs to be done to properly protect all the components? Are there any airline policies I should be aware of?</p>",
        "Tags": "['air-travel', 'airlines', 'luggage', 'united-airlines']"
    },
    {
        "Id": "1703",
        "Title": "Is there any online resource that can tell me what visa rules are for passport holders of a specific country?",
        "Body": "<p>When thinking about travelling, I often have to think about a place to visit, and then look up visa rules for that particular country. This can be a fairly painful process because official government sites can often be hard to find, and advice on (say) guidebooks or Wikitravel tends to be generic.</p><p>Is there any resource where I can enter my nationality/residency, and then look up a list of visa rules for various countries?</p>",
        "Tags": "['visas', 'online-resources', 'international-travel']"
    },
    {
        "Id": "74913",
        "Title": "Are there large US-style supermarkets in France?",
        "Body": "<p>I'm in Paris, and I've stopped into a Monoprix and a Carrefour, and in both cases compared to what I'm used to in the US the selection was quite small. It was just a fraction of what American stores offer in variety of goods and brands.</p><p>Is this normal throughout Paris/France, or am I just shopping at the wrong place?</p>",
        "Tags": "['france', 'food-and-drink', 'shopping']"
    },
    {
        "Id": "40113",
        "Title": "Do any States in the US give traffic tickets for 5 mph above the speed limit?",
        "Body": "<p>In Louisiana, USA it's widely understood (unofficially) that one can travel 5mph above the speed limit without receiving a speeding ticket. </p><p>Does this rule apply when traveling the rest of the States? </p>",
        "Tags": "['usa', 'legal', 'driving']"
    },
    {
        "Id": "14002",
        "Title": "Car damage caused by potholes in the EU, what to do?",
        "Body": "<p>I'm driving often with my own car abroad (EU) and even on highways there are potholes. What can I do if my car gets damaged?</p><p>Is there an EU-regulation or is it different in every country? What should I do to prove what really happened? Are photos enough? </p>",
        "Tags": "['driving', 'regulations', 'automobiles', 'eu']"
    },
    {
        "Id": "72371",
        "Title": "Is a cardboard box allowed as carry-on luggage?",
        "Body": "<p>I know that I can use a cardboard box as check-in luggage if it is under the size and weight limits.</p><p>But I want know if I can <strong>carry-on a cardboard box</strong> on a domestic flight within the USA, as this will allow me to carry few extra Kilos. </p><p>All the information I got from searching the internet is about the check-in luggage. I'm wondering if anyone has tried it as carry on luggage too <em>(considering it will be under the carry-on bag limits)?</em></p>",
        "Tags": "['air-travel', 'legal', 'hand-luggage']"
    },
    {
        "Id": "26803",
        "Title": "Why do some tourist attractions forbid tourists to take photographs?",
        "Body": "<p>In my travelling career, I have seen lots of <em>no photography zones</em>, but the reasoning behind it mostly made sense. It is related to national security (infrastructure, proximity of military bases) and museums (copyright issues and/or light-sensitive works).</p><p>However, I have seen also places where I could not justify it. For instance, recently I was in Jeita Grotto in Lebanon. They have a <em>no photography</em> policy that it is so strict that they require people to leave cameras and even mobile phones in a locker prior to entering. The cave is amazing, and it is a pity that I could not take any photos. And I still do not understand why, there is nothing sensitive inside. And it's not like I wouldn't go there if I had seen the photos. On the contrary, it would encourage me even more to go there after seeing the photos that other tourists took.</p><p>Why do some places have a strict <em>no photo</em> policy?</p>",
        "Tags": "['regulations', 'photography']"
    },
    {
        "Id": "43701",
        "Title": "Is there a Waze-like app to keep track of each other among travel companions?",
        "Body": "<p>I am an avid user of <a href=\"https://www.waze.com\">Waze</a>. One of its feature is the ability to share your location with followers or through text messaging. This is quite handy when you are on route to appointment while being stuck in traffic. You simply sent a message and the recipient can follow where you are and when you'll arrive. </p><p>Unfortunately, only works when driving. It does not cater walking, cycling or public transportation. Does an equivalent of waze exists, which would allow you to share where you are. I would very much like to use this while traveling with a group. </p><p>A google search on the matter reveals some apps, but these are mainly aimed at couples who don't trust each other, where you would need to be sneaky when installing the app the phone of the person you would like to follow. </p><p>I would like to be able to simple send a text message to have someone be able to follow me, similar like the approach waze is taking. Does such an app exist? </p>",
        "Tags": "['cellphones', 'gear', 'gps-navigation']"
    },
    {
        "Id": "35002",
        "Title": "Can e-cigarettes / vaping set off smoke detectors?",
        "Body": "<p>I work in a backpacker hostel in Australia. Of course smoking is not allowed inside the building and there are smoke detectors in every room and corridor.</p><p>By law in Australia the smoke detectors in backpacker hostels set off a fire alarm which we are not permitted to turn off and the fire department is automatically notified. The entire hostel must be evacuated until they arrive and only they are permitted to turn off the alarm. Even in the middle of the night and bad weather. The charge for a false alarm is nearing $1,000.</p><p>(These regulations are specific to backpacker accommodation due to a couple of fires in which many travellers died.)</p><p>A couple of weeks ago I saw for the first time a guest \"vaping\" an e-cigarette. It emits a vapour that looks similar to cigarette smoke. He told me that it's fine to use these things indoors.</p><p>But I wonder, do smoke detectors specifically and only detect smoke particles? Is there zero possibility that e-cigarette vapour could ever set off a smoke detector?</p>",
        "Tags": "['safety', 'hostels', 'smoking', 'e-cigarettes']"
    },
    {
        "Id": "37054",
        "Title": "How do I get an engagement ring past security/customs in an airport without alerting my significant other?",
        "Body": "<p>A related <a href=\"https://travel.stackexchange.com/questions/37045/item-held-by-customs-until-i-pay-tax-what-are-my-options\">post</a>, made me wonder how you can hide a ring from a \"special one\" traveling with you to a place where you will propose and yet get it legally through security or customs?You don't want the surprise to be killed by a bureaucrat. </p>",
        "Tags": "['customs-and-immigration', 'airport-security']"
    },
    {
        "Id": "2752",
        "Title": "What's the absolute cheapest accommodation in Ioannina Greece?",
        "Body": "<p>So hitchhiking is an unpredictable way to travel which is fun but tonight I find myself in downtown Ioannina, Greece.</p><p>Usually I'm pretty good at finding cheap lodgings but it turns out I'm not very good at Greece and my usual tricks don't work here. HostelBookers and HostelWorld show no hostels though one does show hotels which are way higher than hostel prices, plus a couple of places that are quite a distance away from the city.</p><p>I've also looked on TripAdvisor and I've searched Google and Google maps for all kinds of things like \"cheap hotel\", \"hostel\", \"backpackers\", \"guest house\", \"cheap accommodation\", \"camping\", etc. There are lots of annoying links to booking sites which then require further searches with no better results if you do bother going through them. I decided they were too spammy to waste much more time on.</p><p>The cheapest place I could find was about 50 euro! I would expect a hostel to be in the range of 10-15 euro.</p><p><strong>What is the cheapest accommodation in Ioannina, Greece?</strong></p>",
        "Tags": "['budget', 'accommodation', 'camping', 'greece']"
    },
    {
        "Id": "9921",
        "Title": "Are there any flight price search engines with baggage allowance included?",
        "Body": "<p>I am looking for a flight search engine that includes a luggage calculator in the price. I recently booked a trip and had the choice between two carriers at the time, and not feeling very stupid I chose the cheaper one.</p><p>The crux is that after I had paid I found out that the more expensive airline had vastly different rules for baggage. In fact it allowed twice the amount of baggage without extra charge.</p><p>After having found the price for extra luggage very extreme I had already decided I will send the extra baggage as separate freight, because the speed is not important. But of course had I known this from the start I could have saved myself a lot of work and money.</p><p>I am aware that this information can be found on respective carrier website, but even within a single company it can differ from route to route. Would be handy if I didn't have to try and calculate it all myself.</p><p>So my question is simply, is there any flight search engine/price comparison site where I can also enter my total baggage needs to have it included in the price comparison between carriers?</p>",
        "Tags": "['air-travel', 'online-resources', 'luggage', 'flight-search-engines']"
    },
    {
        "Id": "74434",
        "Title": "What are some tips for a child flying alone for the first time?",
        "Body": "<p>I am 14 years old and will be flying on a WestJet plane from Calgary to Vancouver, Canada. How early should I arrive at the airport? What do I do once I arrive at the airport? What should I do first, second, etc? Please be specific. </p>",
        "Tags": "['air-travel', 'canada', 'airports', 'minors']"
    },
    {
        "Id": "106179",
        "Title": "Can I take my electric skateboard to Russia?",
        "Body": "<p>I am going to the football/soccer world cup in Russia.</p><p>I usually use my electric skateboard to travel around in the city so I can avoid public transport. I would like to take it with me to Russia for the next World Cup.I worry that the police or the airport security could confiscate my skateboard when I leave Russia.  </p><p>I wouldn't like to lose my 600 euros.</p>",
        "Tags": "['air-travel', 'transit', 'airports', 'russia']"
    },
    {
        "Id": "132292",
        "Title": "How to seat family of seven together on long-haul flight?",
        "Body": "<p>My family and I are flying to New Zealand (AKL) from the USA (LAX) in just over a week.  We booked 7 seats (in a single booking), but when I check the American Airlines website it says we don't have seats assigned, and recommends I select seats.  The 7 of us are Mum and Dad (my wife and I), 4 kids (16, 14, 13, 5 years old), and our friend.</p><p>When I go to select seats there is only two areas that have a block of enough open seats for 7 people to at least sit close together, however more than half of these seats cost (approx $86-$120 USD each).</p><p>Now we don't care where on the plane we sit, we just want to sit together as a family, but can't afford to pay another ~$500 USD to select specific seats.</p><p>Are we likely to be seated together anyway if we check-in together?  Or are we just going to get random open seats?</p><p>Our flight back is on United and we were able to select seats together on the United website without incurring any extra charge.</p><p>Here is a screenshot of some of the available seats, to show what we've got to work with currently.</p><p><a href=\"https://i.stack.imgur.com/eYW6w.png\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/eYW6w.png\" alt=\"enter image description here\"></a></p>",
        "Tags": "['air-travel', 'seating', 'american-airlines']"
    },
    {
        "Id": "5317",
        "Title": "Day trips from London?",
        "Body": "<p>Very soon, I'll spend some time in London. The weather forecast isn't that great and I think I have to expect some rainy days. Sightseeing in wet clothes is okay for some days, but not everyday. So I'm looking for some day-trips to interesting places which are suitable for bad weather. Any recommendations?</p><p>I'm interested in a lot of different things, but I'd particularly like to see things that I can't see anywhere else. Additionally, I like natural sights, landmarks and architectural sights as well as places that have a historical meaning.</p>",
        "Tags": "['london', 'day-trips']"
    },
    {
        "Id": "58566",
        "Title": "Being a tourist, can I film police in the US?",
        "Body": "<p>I have seen some YouTube videos where police in the US doesn't behave in the best of ways, but citizens are allowed to film them \"for their own protection\" and it helps having evidence if something escalates.</p><p>I will be travelling with my family soon to the US and I won't be recording cops for no reason, but in the case they stop me or something weird starts to happen with a cop, can I film them?</p>",
        "Tags": "['usa', 'legal', 'safety', 'photography']"
    },
    {
        "Id": "711",
        "Title": "What regulations should a European driver know when driving in the US?",
        "Body": "<p>There are the obvious ones. The US has the keep-your-lane system, where as in Europe you are expected to keep to the right (left for UK) as long as possible. On my latest travel to the US, I was confronted with the possibility to go through a red light if you turn right, unless it is explicitly not allowed.</p><p><strong>What should a european driver know when driving in the US?</strong> What are the do's and don'ts compared to driving in Europe. </p>",
        "Tags": "['usa', 'europe', 'driving', 'legal', 'regulations']"
    },
    {
        "Id": "6344",
        "Title": "US to Asia via Europe with infants",
        "Body": "<p>We are planning to go on a trans-atlantic flight (> 10 hrs) with an infant. To help defray costs, we're considering just getting a \"lap\" ticket for our (would-be) 1 year old. </p><p>Are there airlines which are particularly good at accommodating infants? I would think these are the criteria:</p><ol><li>Shortest layovers.</li><li>Most legroom in Economy.</li><li>Accommodating, in terms of infant engagement (toys, puzzles, etc.) during the flight, seat assignments with bassinets capabilities, etc.</li></ol><p>Our Route Sector will be to fly east from the US east coast (NY or DC), via Europe, to China/India. The final destination will be contingent based on scheduling, pricing and the answer to this question ;)</p>",
        "Tags": "['airlines', 'children', 'child-safety-seats']"
    },
    {
        "Id": "69321",
        "Title": "Will my passport number change when I renew it?",
        "Body": "<p>I'm travelling soon but need to renew my passport.</p><p>Given that I have to provide my passport number to the airline to book a flight, I was wondering if my passport number would change if I renew it.</p><p>Or would the number stay the same and the expiry date just change?</p><p><em>I'm asking specifically as an Australian citizen, although I suspect a 'common' answer (if there is a general way this works) might be useful too.</em></p>",
        "Tags": "['passports', 'legal', 'australian-citizens', 'passport-renewals']"
    },
    {
        "Id": "73928",
        "Title": "When flying on a very tight schedule, are you obligated to run to make it to the next gate on a connection?",
        "Body": "<p>In reference to <a href=\"https://travel.stackexchange.com/questions/73893/why-do-airlines-offer-flight-itineraries-with-unrealistically-short-layovers\">this question</a>, let's say you've bought a single ticket with a 45-minute layover. Your plane arrives on time but the next gate is so far away you have to <em>run</em> to make it. Assuming you instead choose to go on a leisurely walk (4-5 km/h) and miss the plane, would the airline still put you on the next one for free?</p><p>I've been in a similar situation a couple of times and always wondered what happens to people who are unable to run.</p>",
        "Tags": "['legal', 'short-connections']"
    },
    {
        "Id": "52936",
        "Title": "Are there still any advantages to using an Oyster card for travel in London?",
        "Body": "<p>The advice to visitors to London <a href=\"https://travel.stackexchange.com/a/2043/2555\">always used to be</a> to procure an Oyster card. Given that Transport for London now accept (in fact, have accepted for a while) Contactless credit/debit cards (and Apple Pay) on buses, tubes, the DLR, etc, is there any advantage to a regular/commuter user - or a visitor - of still using/owning an Oyster card? The only advantages I can identify are:</p><ul><li>You need to buy monthly or longer travel cards, which aren't supported using contactless payment.</li><li>You come from a country or use a bank that doesn't support contactless payment.</li><li>An Oyster card can be topped up with cash, if you prefer to/need to pay that way.</li><li>Only Oyster cards support emailing PDF statements of travel to the user on a monthly basis.</li></ul><p>Are there any other reasons to keep using Oyster?</p>",
        "Tags": "['public-transport', 'london', 'tfl', 'oyster-card']"
    },
    {
        "Id": "148684",
        "Title": "Use 230V 50Hz electronics in U.S.A",
        "Body": "<p>I want to visit friends in U.S.A. and may stay there for maybe a month. I would like to bring my electronics with me and need to know how I could use them in America. They use 230 V, 50 Hz (I am from Germany).</p><p>I think America uses 120 V, 60 Hz (a friend told me).</p><p>I have seen travel adaptors however I fear putting 120V, 60Hz into my electronics (most don't do 120 V/60 Hz) and then breaking them.</p>",
        "Tags": "['usa', 'europe', 'power']"
    },
    {
        "Id": "716",
        "Title": "What kind of plug adapter should I pack for India?",
        "Body": "<p>I'm travelling around a few cities in India, from Delhi to Bangalore. What type of plug adapter should I pack?</p>",
        "Tags": "['india', 'gear', 'electronic-items', 'power']"
    },
    {
        "Id": "112332",
        "Title": "How to pass a Green Card through immigration to someone arriving to the US from abroad?",
        "Body": "<p>My wife is travelling back to the US, but forgot to bring the green card with her during travel. So, it is still sitting at home in the US. Would there be a way for someone to bring her the green card behind immigration at the port of entry so she can use it to pass immigration? </p><p>Perhaps by mail, or perhaps someone could buy a cheap international flight and meet her there.</p><p>BTW, her port of entry is the Seattle airport. They have already allowed her to board.</p><p>Other relevant details that surfaced are - she has CR1 visa stamp in passport, but it is from September 2016. I posted a related question <a href=\"https://travel.stackexchange.com/questions/112335/cr1-visa-stamp-expiration-with-2-year-date\">here</a>. I originally thought it better to keep the two lines of thinking separate for future readers.</p>",
        "Tags": "['visas', 'usa', 'customs-and-immigration', 'paperwork', 'us-residents']"
    },
    {
        "Id": "2759",
        "Title": "What are the bus (coach) connections from Thessaloniki, Greece to Tbilisi, Georgia?",
        "Body": "<p>Well I'm worried the bad weather has set in and I have to switch from hitchhiking to public transport. I know there are buses from Istanbul to Tbilisi but I wonder if there might even be a direct bus connection from somewhere in Greece to Tbilisi since it seems to have a Georgian expat community.</p><p>So far I can't find anything with my Internet searches but maybe there are some secrets to be discovered by searching in Greek or Russian?</p><p>I've found <a href=\"http://www.lonelyplanet.com/georgia/tbilisi/transport/getting-there-away\" rel=\"nofollow\">mention on Lonely Planet's website that there are indeed buses from Thessaloniki to  Tbilisi</a> - but no details.</p><blockquote>  <p>For the truly hardy, several companies run buses to Thessaloniki and Athens (€100) from Ortachala.</p></blockquote><p><a href=\"http://www.lonelyplanet.com/thorntree/thread.jspa?threadID=1943307\" rel=\"nofollow\">Elsewhere on the Lonely Planet Thorn Tree</a> there are some comments with more tidbits but no details:</p><blockquote>  <p>djpeanut: A friend of mine took it at the end of last year. Not that amazing really.</p>    <p>fluffy_bunny: I had thought there were buses from Didube (Neo-turs). But the price of $100 0r so is about right. The trip takes about 2 days.</p></blockquote><p>Can anybody find times, prices, companies, departure points, any juicy details I might need?</p>",
        "Tags": "['georgia-country', 'buses', 'greece', 'athens', 'thessaloniki']"
    },
    {
        "Id": "22736",
        "Title": "Are there tips and tricks to overcome a fear of flying?",
        "Body": "<p>Are there tips and tricks for people with fear of flying that can makes them have a more pleasant experience when flying? I know drugs can do magic, and <a href=\"https://travel.stackexchange.com/questions/9885/for-fear-of-flying-is-drinking-alcohol-a-healthier-option-than-pills/9961#9961\">we've previously had debate on pills vs alcohol</a>. I'm ideally after official advice and recommendations, but other tips and tricks would be nice as well.</p>",
        "Tags": "['air-travel', 'health', 'tips-and-tricks']"
    },
    {
        "Id": "73425",
        "Title": "Cheapest ATM strategy in Brazil",
        "Body": "<p>I need to withdraw lots of Brazil Real in Rio de Janeiro from my USA bank account.  What bank has the cheapest ATM (or I could even go to a teller) for me?  Suppose I need 10,000 Real and my bank charges $2 per withdrawal.</p><p>I can not find ATM fees for the Brazil banks.  It does seem like the highest ATM withdrawal limit is 1,000 Real, but this information might be old.  I'm hoping some foreigners living in Brazil have researched this recently.</p>",
        "Tags": "['brazil', 'fees-and-charges', 'atms', 'olympics']"
    },
    {
        "Id": "182994",
        "Title": "What to do if the plane/train/bus ticket is stored on the phone and the phone is lost or damaged or stops working?",
        "Body": "<p>Allowing passengers to display their flight ticket on their smartphone instead of having to carry a printout, was a good move. It's necessary to show it to get into the airport and to get the boarding pass. For trains and bus, it's necessary to show it to a ticket checker.</p><p>If the phone is lost or stops working, what valid options do we have to be allowed to travel? Can we:</p><ol><li>Show a piece of paper with the ticket number or reservation number written on it with a pen, and show our photo id card as proof?</li><li>Store the PDF of the ticket on Google Drive, write the hyperlink on a piece of paper before the trip and in the emergency situation, request a co-passenger to type and open that hyperlink, to show the ticket checker?</li></ol><p>I'm sure the authorities would have thought of some backup plan for such situations (and also thought of a way to ensure that it doesn't get misused, for example by someone who happens to know the ticket number).<br />Do you know anyone who has been through this situation? Is there any other valid option that is considered acceptable, or should we carry a printout just to be safe? I'm asking both for travel in India and when vacationing internationally.</p>",
        "Tags": "['trains', 'tickets', 'airports', 'bookings', 'buses']"
    },
    {
        "Id": "185042",
        "Title": "Is it true that \"in Singapore, you should assume all rules are implemented at all times\"?",
        "Body": "<p>One user makes the above claim in a comment <a href=\"https://travel.stackexchange.com/a/184990/140497\">here</a>. That user also <a href=\"https://chat.stackexchange.com/rooms/150219/discussion-on-answer-by-lambshaanxy-does-any-beach-in-sentosa-island-in-singapor\">claims</a>:</p><blockquote><p>in Singapore, rules which are elsewhere seen as a formality or unimportant <em>are</em> enforced in Singapore. eg, not eating or drinking anything (even water!) on the MRT.</p></blockquote><p>Are such claims true?</p><p>Should one \"assume all rules are implemented at all times\" especially in Singapore and more so than in most other countries that one might visit?</p>",
        "Tags": "['singapore', 'culture', 'cultural-awareness']"
    },
    {
        "Id": "166100",
        "Title": "What happens if I bring 100+ of the same item in my luggage with the intention of selling?",
        "Body": "<p>Let's suppose I am going on a trip, and <a href=\"https://en.wikipedia.org/wiki/Victoria%27s_Secret\" rel=\"nofollow noreferrer\">Victoria's Secret</a> is on sale, so I buy tons of perfumes and take them to a country where they will be twice or three times the price I paid for them. If the security at the airport sees all that merchandise, would they allow me to go through to the airplane? And if I have all these perfumes, in what bag should I transport them?</p>",
        "Tags": "['luggage', 'hand-luggage', 'regulations']"
    },
    {
        "Id": "130260",
        "Title": "How does the Central London transport system work?",
        "Body": "<p>I am wondering how the transport system in Central London works.</p><p>What ticket do I need to travel in the centre all day? Is there a top-up card I can use?</p>",
        "Tags": "['public-transport', 'london']"
    },
    {
        "Id": "722",
        "Title": "Which credit cards have global coverage?",
        "Body": "<p>While traveling I ran into two situations where my credit card was not accepted. I mainly use MasterCard. In China (although 10 years ago) Visa was accepted in most stores, but MasterCard was not. In the US, my MasterCard was rejected multiple times because it was a non-US CC number. This can be a real annoyance. </p><p>So could anyone recommend me a CC company which would give me global coverage? Or is this just not possible?</p>",
        "Tags": "['money', 'payment-cards']"
    },
    {
        "Id": "730",
        "Title": "How can I do a \"broad\" search for flights?",
        "Body": "<p>Several airline and trip planning sites will allow you to check \"I am flexible with my dates\" or a similar option.  Is there any way to also search more broadly for location?</p><p>For example, if you wanted to leave from YYZ or YKF and arrive at any airport in California, can a search for such flights be done somehow?</p><p>I ask because when I plan plane trips, I want the lowest price.  I'm OK with leaving a day or two later if I save $200 (same with the return trip).  There are 3 airports within 80 km of me, I'll leave from the one with the cheapest flight. And I'm also OK with changing the trip to spend time exploring San Francisco instead of lying on the beach near San Diego, and that sort of thing.</p><p>Normally this would take dozens of searches, but I'd like to see it all at once.</p>",
        "Tags": "['air-travel', 'online-resources', 'planning', 'flight-search-engines']"
    },
    {
        "Id": "2779",
        "Title": "Does it makes sense to travel to Iceland during winter?",
        "Body": "<p>I just saw an amazing offer to fly to Iceland in November. Although Iceland is still on my wish list, November would not be the first choice of time to visit. Is this an offer to just fill empty seats on the flights to Reykjavik, or is Iceland also worth visiting in November?</p>",
        "Tags": "['winter', 'iceland', 'auroras']"
    },
    {
        "Id": "36572",
        "Title": "What does it mean to be in the fast lane in California?",
        "Body": "<p>I don't think I've ever understood this. </p><p>I travel frequently across the State of California by car.  And I often take the highway to get to many places.</p><p>One thing I don't understand is how fast lanes and slow lanes work.  I was recently travelling on a fast lane near San Francisco driving at the speed limit, when I noticed a cop who was travelling behind me honk at me, presumably because I was going slowly? I noticed there was a long line of cars behind me.  </p><p>So I moved into the slow lane.  But even weirder is that cars in the slow lane drive at the speed limit, and cars that drive in the fast lane drive way past the speed limit, even cops.  And I have never seen anybody get arrested for going faster than the speed limit, except for really fast drivers.</p><p>So I don't understand, even with 6 years of driving throughout California under my belt.  I understand the fast lane is for fast cars, but doesn't driving at the speed limit constitute fast? I really don't understand.  I talked to a local officer and they said that if there are cars tailgating you or lining up behind you, you should change lanes to a slower one, but if I'm already driving at the speed limit, how can I go any faster?</p>",
        "Tags": "['driving', 'terminology', 'california']"
    },
    {
        "Id": "4826",
        "Title": "Where to buy Thai Baht when traveling from New Zealand to Thailand?",
        "Body": "<p>When traveling from New Zealand to Thailand, where can I buy Thai Baht and get a good exchange rate and low commission?</p><p>It's only for the first 10K THB (Thai Baht) for the first days. The rest I will withdraw from ATMs.</p><p>The options I considered:</p><ol><li>Withdraw from an ATM at Bangkok airport.</li><li>Buy THB from New Zealand's post office or some other foreign currency agency.</li></ol>",
        "Tags": "['money', 'thailand', 'exchange', 'new-zealand']"
    },
    {
        "Id": "82654",
        "Title": "I was allowed to enter the airport terminal by showing a boarding pass for a future flight. Should I be concerned about \"security\"?",
        "Body": "<p>I take the same flight with the same company between two European neighboring countries once a month.  </p><p>My boarding passes are on my smartphone, but as I book my flights months in advance, I often have 3 or 4 boarding passes on my phone.  </p><p>During my previous flights, I noticed the security agents at the airport seem not to be really careful, so I decided to test them, trying to enter in my flight with the boarding pass for next month (legally bought, but valid only next month)</p><p>There are 3 security checkpoints in this airport:  </p><ul><li>First, before cabine luggage X-ray, someone from the company ask for people to show their boarding pass. So I showed the \"wrong\" pass on my smartphone, she looked at it a quarter of a second and wish me a pleasant flight... <em>First \"security\" checkpoint DONE</em></li><li>Then, where your cabine luggage is X-rayed, they ask for the boarding pass, and the QR code printed on it is read by a machine. I expected to be caught at this moment but the light turns green!<br>So I was allowed to enter in international area with a wrong boarding pass!What is checked at this moment ? Only if the QR code is valid ? If so, the date is not checked, which IMO is not normal. I'm not into IT security, but I guess it's not that hard to generate false QR codes to enter in any international area all around the world, which is a little bit freaky…<br><em>Second \"security\" checkpoint DONE</em></li><li>Finally, at the boarding gate, the light turns red when I presented the wrong card ; so I apologized, showed the right one and finally entered the flight.  </li></ul><p>This happens one month ago. Last week, I took the same flight again and showed the same boarding pass to enter in international area (which was the \"good\" one that time). And I was allowed again to enter, which means one can enter multiple times with the same boarding pass.  </p><p>I don't know how to deal with this situation.<br>Should I report my experience to the airport? Should I be worried about \"security\"?  </p><p>Or is it just normal?</p>",
        "Tags": "['customs-and-immigration', 'tickets', 'airports', 'safety', 'airport-security']"
    },
    {
        "Id": "44770",
        "Title": "How can I remove highway vignettes and other miscellaneous stickers from the windshield of my car?",
        "Body": "<p>Taking <a href=\"https://travel.stackexchange.com/questions/42124/how-to-remove-airlines-security-tag-stickers-from-suitcases\">this marvellous question</a> as inspiration, I travel a lot by car, often in countries that require me to buy a <a href=\"https://en.wikipedia.org/wiki/Vignette_(road_tax)\" rel=\"nofollow noreferrer\">vignette</a> to use the motorways. Moreover it is usually mandatory to stick the vignette inside the windshield of the car, to prevent re-use. However, these vignettes are designed to tear off in mosaic-sized pieces as soon as one attempts to remove them, this too probably to prevent re-use.</p><p>Since I am fed up of collecting vignettes from various countries and solar years, I would like to start removing all the unnecessary ones. <strong>Is there a smart and effective way to remove these tough stickers from the inside of my car wind-shield without damaging neither it nor the car?</strong></p>",
        "Tags": "['automobiles', 'tips-and-tricks', 'vignettes']"
    },
    {
        "Id": "100584",
        "Title": "Are credit cards widely accepted in Warsaw?",
        "Body": "<p>Are credit cards accepted in the museums and restaurants in Warsaw?</p><p>When used in a restaurant, is there a minimum amount you have to spend in order to pay by credit card?</p><p>I'm particularly interested in whether the POLIN Museum of the History of Polish Jews accepts payment with a card.</p>",
        "Tags": "['payment-cards', 'poland', 'warsaw']"
    },
    {
        "Id": "101100",
        "Title": "Where should I leave my passport and electronics if there is no safe in my apartment?",
        "Body": "<p>I will be travelling to Barcelona soon. We are renting an apartment for a week through Booking. The apartment has no safe to keep personal belongings in. No cleaning service will enter the house during our stay.</p><p>I will have a backpack that I will carry around the city but I don't want to put my iPad, handheld console etc. in my backpack constantly. I think it will be more likely to get stolen in the backpack than in the apartment. Is this correct? Or would you advise to take it with us anyway?</p><p>And how about passports and such? I don't feel comfortable carrying it around constantly and I do have a European driver's license to use as means of identification. Would you recommend leaving it in the apartment, or taking it with me in the backpack?</p>",
        "Tags": "['luggage', 'europe', 'safety', 'spain']"
    },
    {
        "Id": "26350",
        "Title": "Can you get sucked tight on a plane's toilet?",
        "Body": "<p>The sounds of flushing an airplane's toilet can be quite intimidating. When going to the toilet on a plane, I am always a bit cautious of accidental flushing. If so, do you risk being sucked stuck to the toilet due to the suction?</p>",
        "Tags": "['air-travel', 'safety', 'hygiene']"
    },
    {
        "Id": "109294",
        "Title": "Schengen visa: why bank statements if the company is sponsoring my visa?",
        "Body": "<p>I have a work permit for Belgium. I understand that my visa application will be sponsored by the Belgian company recruiting me. In this case, why am I stil required to submit my bank statements?</p><p>I am travelling on company sponsor and I am planning to sponsor my wife's travel. But the amount in my bank is sufficient for sustenance, but only for one individual(as per the Belgian per day euro calculation). Effectively both of us are financially covered, as I will get paid while staying in Belgium and my bank funds become useful for my wife's stay. But since both of us are submitting my bank statement with our visa applications, we are not sure how well it goes down with the authorities</p>",
        "Tags": "['schengen', 'work', 'belgium']"
    },
    {
        "Id": "71408",
        "Title": "Where can I change my clothes at the airport?",
        "Body": "<p>I will have a rather formal event which I will attend in rather formal (and less comfortable) clothing. After that I will head directly to the airport, without having an opportunity to change. </p><p>If I want to change into something more comfy before my flight, <strong>where at the airport can I change my clothes?</strong></p><p>My criteria are least hassle, avoiding public outcry or suspicions of security staff and avoiding charges. </p><p>I am aware that there are bathroom stalls but changing pants in there involves some acrobatics I'd rather avoid, and I'd also rather avoid sneaking into a dark corner at the end of the terminal or changing in front of other travelers.</p><p>Further I'm aware that lounges might have a solution to that but I have neither status nor a business class ticket and I'd rather avoid paying north of 20 EUR or USD for getting changed. </p><p>Ideally an answer would be valid/useful for airports all over the world but if you do need to narrow it down, I will be travelling from Frankfurt international airport (FRA).</p>",
        "Tags": "['airports', 'tips-and-tricks', 'clothing', 'fra']"
    },
    {
        "Id": "7408",
        "Title": "What is the best money exchange place to exchange dollars to PLN in Poland",
        "Body": "<p>I am looking for a place to change dollars to Polish zloty and I wonder where the best place to do such exchange is.</p><p>I am looking for exchange places in following cities (or nearby):</p><ul><li>Wroclaw</li><li>Krakow</li><li>Walbrzych</li></ul><p>Additionally can I ever count for an exchange rate that is better then what google shows?(06/01/12  1 U.S. dollar = 3.55219597 Polish zloty) </p><p>Does anyone knows a good <code>kantor</code> in wroclaw and what the exchange rate there is ??What is the exchange rate at galeria dominikanska??</p>",
        "Tags": "['exchange', 'poland', 'wroclaw', 'krakow']"
    },
    {
        "Id": "118514",
        "Title": "Where to stay in York, UK (general guidelines, NOT specific hotels!)?",
        "Body": "<p>I realize the guidelines of travel.stackexchange.com forbid specific recommendations of places to stay. Luckily that's not what I'm asking for!</p><p>One can stay within York, UK itself, but I'm told another option is to stay just outside of York in certain villages and take the bus in. This has several advantages (1) the rates for hotels and B&Bs are way lower, (2) you don't have to deal with driving/parking in York, (3) many prefer the small-town atmosphere as opposed to being in a noisy city at night.</p><p>I'm a little shaky on what these villages are, and how one takes the bus into York (where does one park the car, which buses and what are the schedules etc.). Can someone with experience tell me how to get started on researching this? We are a family of 5 and looking to either get a B&B OR just rent a house. We are certainly not opposed to taking a bus each day in and out of the city and in fact, might prefer to stay in a small village.</p><p>Please let me know if I can provide more relevant details or need to edit the question.</p>",
        "Tags": "['accommodation', 'yorkshire', 'york']"
    },
    {
        "Id": "79091",
        "Title": "Are there any issues with speaking Spanish as a tourist in Portugal?",
        "Body": "<p>I'm about to go on a trip to Portugal, not knowing any Portuguese. I was planning to learn all the basics (yes, no, hello, goodbye, thank you, etc) but in a slightly more complicated situation it's useful to fall back to a different language.</p><p>I have a decent level of Spanish and I heard that most people in Portugal understand it.</p><p>However, a friend of mine (Brazilian who visited Portugal several times) claims that falling back to Spanish will be considered extremely rude, even if I try to be polite about it. </p><p>On the other hand, the Wikitravel page on Porto <a href=\"http://wikitravel.org/en/Porto\">says</a>: </p><blockquote>  <p>If you speak in Spanish to a local, you will be largely understood and as a rule they will freely converse with you, but from time to time, more so with the older generation, you may be politely reminded that you are in Portugal and the native language is Portuguese.</p></blockquote><p>Which one is right? </p><p>If it helps, I'll be travelling mainly via Porto and Lisbon, possibly stopping at one or two smaller towns on the way.</p>",
        "Tags": "['language-barrier', 'portugal', 'spanish-language']"
    },
    {
        "Id": "162036",
        "Title": "Are there countries that bar nationals from traveling to certain countries? (Outbound travel ban)",
        "Body": "<p>I know that a(n inbound) <strong>travel ban</strong> based on nationality is normally enforced at the destination. It is most notable that Israelis <em>suffer</em> this kind of ban from <a href=\"https://en.wikipedia.org/wiki/Israeli_passport#Countries_that_do_not_accept_Israeli_passports\" rel=\"nofollow noreferrer\">most of the Arabic world</a>.</p><p>Another notable examples are North and South Korea, which are reciprocal enemies and do not accept nationals of either nationality. It's also extremely difficult to actually get a passport for North Koreans.</p><p>And of course US travel bans issued by Mr. Trump against nationals of certain Muslim countries.</p><p>But I wanted to ask about the opposite, mostly for sake of curiosity. Are there countries that forbid and punish <strong>their own nationals</strong> to visit certain <em>enemy states</em> despite that destination state accepting them?</p><p>Example. National of country <code>A</code> can legally enter state <code>B</code> (from B's laws point of view, and most likely using a connecting flight), but when that person returns to the home country <code>A</code> they get prosecuted by law, e.g. if they have passport stamps, pocket money from <code>B</code> or just any other evidence to have visited that state. I am asking for bans that can be enforced with sanctions (from fines, hefty fines, to jail, revocation of passport, etc.)</p><p>From the first example: an Israeli dual national is likely to be able to visit Libya with a second passport, but I never heard about any Israeli law prohibiting individuals to visit Libya (should the government ever find out) and convicting such travelers.</p>",
        "Tags": "['travel-ban']"
    },
    {
        "Id": "151283",
        "Title": "Which non-stop passenger flight connects two cities with the largest temperature difference?",
        "Body": "<p>For the purpose of this question,</p><ul><li><p>temperature refers to daily mean temperature in a month (shown as \"daily mean\" on Wikipedia) of the city/town that an airport primarily serves</p></li><li><p>passenger flight refers to scheduled flights and public charters with a published schedule</p></li><li><p>it can be any month of the year</p></li></ul><p>Example:</p><p>Singapore (SIN) - Moscow (DME) SQ 362 in February, daily mean for Singapore 27.1°C, daily mean for Moscow -6.7°C, difference <strong>33.8°C</strong>.</p>",
        "Tags": "['air-travel', 'weather-and-climate', 'factoids', 'routes']"
    },
    {
        "Id": "68852",
        "Title": "Baggage storage in downtown Toronto",
        "Body": "<p>I am traveling to Toronto, ON, Canada in July with my family. We will arrive at around 1 am and we plan to take some rest until around 9 am in the airport and then travel downtown.</p><p>However, the place we are going to stay at during the vacation has a kind of late check-in time, at 5 pm. We'd like to ditch the luggage during the day and pick it up before we check in the accommodation.</p><p>Is there any luggage storage service or baggage locker in downtown Toronto, which is in a fair price range for one-day storage?</p>",
        "Tags": "['luggage-storage', 'toronto']"
    },
    {
        "Id": "13562",
        "Title": "How do you choose a restaurant when travelling?",
        "Body": "<p>When travelling almost everyone wants to enjoy a local meal. It's part of the travelling experience. If you're not careful, you may end up in an expensive, \"extremely\" tourist-oriented place, which may not even represent the local gastronomy.</p><p>How do you pick a restaurant? Where do you search for information before travelling? Are there any good online guides? </p><p>On the spot what are the dos and don'ts? Do you ask locals? Are they a good source?</p><p>Note: The problem with locals is that sometimes they try to be extra nice with you and will send you exactly to places you want to avoid. They don't eat in those places, but it's common that they think it's a nice place for you, since it's always full of tourists :)</p><p>One of the problems with most review websites is that restaurants go into a positive spiral. They get attention for some reason. From there, they will attract more visitors due to their position, and of course, those visitors will review them again, reinforcing the spiral. That means one may be losing other, maybe even more interesting possibilities, if only looking at \"tops\".</p>",
        "Tags": "['food-and-drink', 'restaurants', 'tourist-traps', 'local-knowledge']"
    },
    {
        "Id": "14082",
        "Title": "Is it possible to make a decent income from travelling the world?",
        "Body": "<p>My dream is to be able to travel the world and have a new adventure every day. With the internet, every day I'm able to see this beautiful and unique world, but those are only photos. I want to experience those places and cultures.</p><p>There are some things, of course, I have to think about, and the one most important is <strong>income</strong>. How do I support myself while travelling the world? The first thing I think is <em>What are my talents?</em></p><p>I'm a software engineer and love everything about software and the open source world. I'm a hard gamer and love to play a variety of games. I have very little experience with video and photo editing (Photoshop and After Effects), but the little I had with that, I enjoyed it. <strong>How can I make a decent salary writing software while travelling the world?</strong></p><p>I've also thought about writing a blog about my day-to-day adventures, and maybe even making a Youtube channel with vlogs about my day-to-day adventures. If I were to do that, how successful do you think it would be? If it was, how well could that support me (or how much money do you think I can make)? I also thought about photography, and to take photos and to sell them online, if that's possible.</p><p>Of course, there are things that, as a normal citizen, I wouldn't have to pay like house payment (though I would be paying rent or for a hotel which may or may not be less), car payment (though I would rent cars when I needed to), home internet (I could use Wi-Fi at local shops if applicable), entertainment (most likely if I'm travelling the world, I will have less concern about what new movies or games are coming out), etc.</p><p>I make a pretty good salary and have GREAT benefits including health care, retirement, etc. For me, it would be hard to let go of those kind of things. Is it possible while travelling the world to get some sort of health care? I hate to sound negative, but what happens if I need surgery but can't afford it, could I not get health care? And how would I take care of my retirement? What happens when I'm old and decrepit and don't move around as well as now?</p><p>It's that time in my life where sitting behind a desk, 40 hours a week, 5 days a week just isn't cutting it. Has anybody here or anybody you know of attempted this? How successful were they?</p>",
        "Tags": "['international-travel', 'work', 'around-the-world']"
    },
    {
        "Id": "9987",
        "Title": "How does one recover from a (personal) disaster while abroad, travel-wise?",
        "Body": "<p>I was watching the Bond flick <a href=\"http://www.imdb.com/title/tt0246460/combined\">Die Another Day</a> last night. In it, Bond ends up in terrible shape, but manages to escape to the shores of Hong Kong, where he strolls into the lobby of a swanky hotel, is instantly recognized, and equipped, and away you go...</p><p>My question is this: supposing I'm NOT going to be recognized, but I've lost my wallet, all ID, everything. How do I get reconnected with my financials? Let me make it clear, I'm not asking how I get a free room and masseuse with no ID, I'm asking how does a real person get a place to stay for the night, some fresh clothes and food.</p><p>Let's also assume that I AM actually paying for it, somehow, though I don't have cash or a credit card.</p><p>Thoughts?</p>",
        "Tags": "['planning', 'health', 'safety']"
    },
    {
        "Id": "4872",
        "Title": "What to do if drugs / a bomb are planted in your travel bag?",
        "Body": "<p>So the scene: You're flying from Bogota, Colombia to New York, USA.  You arrive, pick up your bag from the carousel, and figure you'll stuff your netbook you used on the flight into your bag now rather than lugging it through the airport under one arm.</p><p>However, when you open your bag, you see something that you certainly did not pack. Drugs/a bomb/live snake, take your pick.</p><p>Now you didn't pack these, but you're pretty sure the guys ahead who will x-ray / sniffer dog your bag won't take kindly to seeing them there.  What are you supposed to do in this situation??</p><p>(Note, while this has not happened to me, it's certainly claimed to have happened to several people travelling from Bali, Thailand and other places - see the <a href=\"http://en.wikipedia.org/wiki/Schapelle_Corby\">Schapelle Corby</a> case for an example)</p>",
        "Tags": "['air-travel', 'legal', 'luggage', 'airport-security', 'drugs']"
    },
    {
        "Id": "8456",
        "Title": "How expensive is Belgium?",
        "Body": "<p>Let me clarify a bit: how much should I expect to spend on food per day in Belgium if I am eating out nearly every meal?  Does it vary by city?  If so, how does Brussels compare? How about the French speaking part of the country?</p><p>I have done some research on my own, and found that the cost of living is quite high, but this refers to renting an apartment, taxes, etc.  There was no mention of the price of restaurants or local food as it compares to, say, a large US city (not NYC), which is my reference point.</p>",
        "Tags": "['budget', 'food-and-drink', 'belgium', 'brussels']"
    },
    {
        "Id": "78088",
        "Title": "How to avoid re-stinking my freshly washed laundry when I only have one laundry bag?",
        "Body": "<p>So you were smart enough to remember to take a nice big tough bin liner on your travels to carry your dirty clothes in to keep them separate from your clean clothes.</p><p>Now it's laundry day. So just take that big bag of stinky clothes to the laundromat etc.</p><p>Now the wash is finished so it's time to get your clothes. Umm isn't that handy bin liner still pretty stinky? Do I really want to put my fresh washing back in there?</p><p><strong>What would our smart travellers do?</strong></p><p>It might make a difference if you've washed <em>and</em> dried your clothes vs. if they're still wet and you're going to go hang them out.</p><p>Even if you can go back in time and pack two bin liners you'll hit the same problem on your second laundry day.</p><p><strong>EDIT</strong></p><p>Some variables have become apparent, which probably means there are two to four right answers with a different strategy being optimal depending on your travel mode.</p><ul><li>Whether you're travelling with a suitcase vs backpacking</li><li>Whether you're travelling light or heavy (or ultra light or ultra heavy I suppose)</li></ul><p>In my case I'm backpacking and travelling very heavy. My strategy is to use my trips as a workout. Carrying lots of gear gets me much more in shape than when I'm a lazy geek at home. Last trip I lost 15kg. Most of my gear is socks, shirts, and undies. When I see I'm about to run out of any item I do a big load of laundry. Roughly once per month. This helps stretch the funds when on a long trip with a small budget too.</p>",
        "Tags": "['tips-and-tricks', 'clothing', 'hygiene']"
    },
    {
        "Id": "88840",
        "Title": "Rebooking same hotel for cheaper price - ethical?",
        "Body": "<p>I've booked a standard room in a hotel with booking.com for early March a month in advance for the price of X. This booking is cancellation free until my arrival. Today I've noticed that the very same room is available for those dates 15% cheaper, and that for X I could book now a superior room for these dates. Of course, I can book it now, and then cancel my previous booking - but is that a fine behavior, and perhaps there's a \"cleaner\" way to handle this? For example, perhaps I should just contact them directly?</p>",
        "Tags": "['bookings', 'booking.com']"
    },
    {
        "Id": "58637",
        "Title": "Legality of Driving a Motorcyle in Vietnam as a Foreigner",
        "Body": "<p>Motor scooters and mopeds are the main form of transport in Vietnam. They can be seen everywhere from the smallest alley in a city to remote mountain villages. As such, many tourists choose to adopt a \"when in Rome\" policy and hire or buy a scooter and travel the country on it.</p><p>What isn't at all clear, is what the legality of this is. The internet is confused on the matter, with google prefering to link to deleted posts on TripAdvisor forums (although the follow up comments would indicate that no, it isn't legal unless you prepare for (and pass) a Vietnamese test. My Lonely Planet guidebook indicates similar. Other sources say it is possible to get a Vietnamese license after presenting a foreign license and appropriate credentials to the proper government body. Some blogs and tour companies claim \"of course it's legal, don't be silly\" but provide no explanation or evidence for this. About the only thing that seems widely agreed is that the IDP is not accepted in Vietnam (although Wikipedia disputes even this).</p><p>As for why this should concern a traveller, when the behaviour (tourists driving scooters) seems broadly tolerated: it is always possible that the government will choose to change policy on enforcement. Moreover, if the activity is illegal, and the traveller is either seriously injured or accrues some legal liability, it is likely that insurance will refuse to pay out.</p><p>Bonus points if the answer covers cars as well (although car rental doesn't appear to be widely available)</p><p>References or indications of the law(s) relevant would be appreciated, as would any update on the state of IDPs (apparently changing) in Vietnam.</p>",
        "Tags": "['legal', 'driving', 'driving-licenses', 'vietnam', 'motorcycles']"
    },
    {
        "Id": "71950",
        "Title": "Is it possible to enter Russia by train 1-1.5 hours before the visa validity period starts?",
        "Body": "<p>A friend of mine is taking the Train from Finland to Russia. She has now paid and sent the Tourist visa application, with the requested validity being from 3 to 16 August.</p><p>Now she's considering entering the evening before, so I would like to ask the following:</p><p>The Train she wants to take arrives at Vyborg (first Russian station) on 2 August at 22:22, then St Petersburg at 23:27. The Russian border guards board the train at Vyborg and do the checks while the Train is travelling between the stations, so sometime between 22:30-23:00</p><p>If the visa validity starts on 3 August, and she is checked at 22:30-23:00 the evening before, what would happen? Are they very strict about the starting date if it's within 1-1.5 hours, and how bad would the consequences be?</p><p>Although they do the check while travelling between Vyborg and St Petersburg, could they simply wait until arrival in St Petersburg, then hold her in custody for 30 minutes and then stamp her in?</p>",
        "Tags": "['visas', 'customs-and-immigration', 'trains', 'russia', 'borders']"
    },
    {
        "Id": "172814",
        "Title": "Transit through US without being a resident of any country",
        "Body": "<p>Since this year, 2022, I am not a resident of Germany anymore. I am officially unregistered, and I haven't visited my home country since then. That doesn't mean that I gave up citizenship, however. I still have my German passport.</p><p>On Monday, I've a flight with transit through the US. United Airlines asks me for travel documents, and that involves entering a country of residence:</p><p><a href=\"https://i.stack.imgur.com/z5Cf7.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/z5Cf7.png\" alt=\"Screenshot of United web form\" /></a></p><p>I don't have a country of residence. <em>What should I do? Can I even transit through the US?</em></p><p>A United agent suggested that I contact the German embassy. It is weekend, though, and both the German as well as the American embassy are not available.</p><h1>Update</h1><p>In the end, I arrived at my destination without a problem, and I did use my layover in the US to leave the airport for a night. What country I specified as country of residence, I forgot, because I couldn't edit or see it anymore after I advanced in the form. I was asked for the country of residence when I got my tickets for the connecting flight. In that case, I specified France, no problem.</p>",
        "Tags": "['visas', 'usa', 'customs-and-immigration', 'transit', 'residency']"
    },
    {
        "Id": "25872",
        "Title": "Are non-US citizens elegible to sign up for TSA-Pre?",
        "Body": "<p>My understanding is that it's a more complex process, but once you're processed, it's much faster to get through airport screenings in future.  Is it available to non US citizens as well, and if so, once approved, how long are you approved for?</p>",
        "Tags": "['usa', 'airports', 'regulations', 'airport-security', 'tsa']"
    },
    {
        "Id": "54033",
        "Title": "Can I take a big jar of Nutella in my cabin luggage on a European flight?",
        "Body": "<p>I will fly from Marseille through Amsterdam to Berlin TXL with Airfrance/KLM and I would like to take a large jar of Nutella. It's new and unopened. </p><p>Since it's not liquid there should not be a problem taking it, right? </p><p><img src=\"https://i.stack.imgur.com/Uhezr.jpg\" alt=\"Nutella glass\"></p>",
        "Tags": "['air-travel', 'food-and-drink', 'hand-luggage']"
    },
    {
        "Id": "72981",
        "Title": "Where to buy an Oyster card and where to get the refund after a short time of use",
        "Body": "<p>A group of 4 teenage girls will visit London for two days and want to use a travel card for both days. But a paper travel card is £12 per day and the cap on an Oyster card is about £6.50 for the day.Only one of the girls has a contactless bank card.</p><p>Now is the question, where can you buy such an Oyster card and how do you get your deposit and left over money back after the short visit?</p>",
        "Tags": "['public-transport', 'tfl', 'oyster-card']"
    },
    {
        "Id": "790",
        "Title": "Northern Cyprus - way to visit and what problems can I have with Republic of Cyprus after that?",
        "Body": "<p>I know that Northern Cyprus is recognized only by Turkey, and not other countries.<br>So how can I visit this republic - only from Turkey, or there are some other ways?<br>Will I have problems with getting Cyprus visa after such trip?</p>",
        "Tags": "['visas', 'customs-and-immigration', 'cyprus', 'disputed-territories', 'northern-cyprus']"
    },
    {
        "Id": "2841",
        "Title": "How do you prepare for long haul flights?",
        "Body": "<p>I'm always feeling a bit unwell during and after long haul flights. I lose my appetite, can't sleep in the plane, food has no taste no matter what. However, I'm pretty sure it's not the flying itself, since I did fly small planes for about 2 years and had fun doing that. I'm also pretty sure it's not the jetlag's fault.</p><p>Is there anything I can do to prepare my body for long-haul flights, say Australia-Europe (that's about 2x 12h long flights, and maybe 1-3h stopover in Asia)? </p>",
        "Tags": "['air-travel', 'planning', 'health', 'long-haul', 'jet-lag']"
    },
    {
        "Id": "7961",
        "Title": "How to go from Bangkok airport to Khao San?",
        "Body": "<p>What are my options to go from Bangkok airport to Khao San Road? And what are the expected prices for this?</p>",
        "Tags": "['airport-transfer', 'thailand', 'bangkok', 'bkk']"
    },
    {
        "Id": "130842",
        "Title": "GPS when flying over the ocean",
        "Body": "<p>How can I see my location when flying over an ocean? I know that many airlines show you that on your screen, but I'm wondering if there's a way to do that on a phone, and without an internet connection.</p><p>Any OS is fine, Android, iOS, or even Windows Mobile.</p><p>I assume this won't be dangerous in any way as the phone would be on flight mode, and GPS is passive. </p>",
        "Tags": "['air-travel', 'maps', 'gps-navigation']"
    },
    {
        "Id": "159004",
        "Title": "Can I swim to Litle Hjartøya from Nyholmen, Norway?",
        "Body": "<p>I would like to get to this island, marked by a red marker (on <a href=\"https://www.google.com/maps/place/Litle+Hjartoya/@67.2893565,14.3300791,14z/data=!3m1!4b1!4m5!3m4!1s0x45df106aa1d16965:0xb836705475212401!8m2!3d67.2874704!4d14.3425761\" rel=\"noreferrer\">Google Maps</a>):</p><p><a href=\"https://i.stack.imgur.com/vxqca.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/vxqca.jpg\" alt=\"map of Bodø city and surrounding islands\" /></a></p><p>The obvious route would be to swim across the strait marked by the green stripe. Distance is not that big, ~270m, I can swim that much.</p><p><a href=\"https://i.stack.imgur.com/fhb42.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/fhb42.jpg\" alt=\"close up map of strait\" /></a></p><p>(I know there is a shorter distance between Langskjæret and the island, though I cannot go to Langskjæret, as it is a construction site, so entry is forbidden.)</p><h1>Issues</h1><ul><li>Would it be legal or the coast guard or something similar would intervene?</li><li>Big ships often use that corridor, I have observed them. Will they notice me?</li></ul><h1>Question</h1><p><strong>Can I swim there without taking unreasonable risk or breaking Norwegian law (or other rules I am supposed to follow)?</strong></p><hr /><p><em><strong>Update</strong>: thanks for everyone who has contributed. Based on the answers & my love for my life, I <strong>will not swim</strong> there.</em></p>",
        "Tags": "['legal', 'norway', 'islands', 'swimming', 'ships']"
    },
    {
        "Id": "85277",
        "Title": "How to politely ask people from East Asia to give way?",
        "Body": "<p>I've arrived in Australia 9 months ago and I've noticed that often when asking people from East Asia to \"give way\" they will simply ignore me or even answer a \"yes\" but not move at all.</p><p>This is a situation that at least my wife, friends and work mates also faced a lot of times.</p><p>Some examples: </p><ul><li><p>I went to an electronics shop some days ago and there was this Asian girl standing in front of a product section that I wanted to check. She was texting on her phone. I politely asked \"can I take a look at these?\" and all she did was nod her head and still block the view.</p></li><li><p>Leaving the train. Several times I was trying to hop off the train and a group of Asians would block the way and ignore my desperate \"excuse me, guys\".</p></li><li><p>Groups of 5+ East Asian people blocking the pathway while chatting and/or texting. \"Excuse me\" also didn't work.</p></li><li><p>Same as above, but getting hit in the shoulder by one of them and not even getting a \"Sorry\"</p></li></ul><p>So obviously I don't know if it's a cultural thing or not. It just seems that our standard \"excuse me\" has another meaning to them.</p><p>What is the possible reason for this behavior and how can I politelyask to give way which is culturally understood by East Asians? Or how can I ask to give way in a way which is universally understood?</p>",
        "Tags": "['australia', 'culture', 'asia']"
    },
    {
        "Id": "1314",
        "Title": "What are good security tactics for sleeping in airports?",
        "Body": "<p>Sleeping in airports is something I've found myself doing more often than I ever expected, and while I have no issue with sleeping on the floor or chairs or whatever, sometimes I have valuable stuff, and if travelling alone or in a small group, or if in a dodgy small airport with no security (or worse, corrupt security), what tactics can you use to keep you and your valuables safe?</p>",
        "Tags": "['safety', 'tips-and-tricks', 'airports', 'security', 'sleeping']"
    },
    {
        "Id": "1827",
        "Title": "How to avoid getting motion sickness?",
        "Body": "<p>My travel mate has a big problem when we are traveling together. He gets travel sick very fast. Obviously there is medicine you can take to avoid it, but aren't there any other ways to avoid getting travel sickness?</p><p>On a boat, I know that it is good to focus on a thing that is not moving, but on the ocean, where you can only see water, it is kind of difficult. On the train you can try to sit in the direction of motion, but this does not always help. In the car it helps to sit in the front, or drive by yourself, but it is also not always possible. In a plane I don't know any useful tip.</p><p>So my question is, what are useful tricks and tips to avoid getting travel sick in various vehicles, such as planes, trains, ships, cars, coaches or even elephants or camels?</p>",
        "Tags": "['health', 'tips-and-tricks']"
    },
    {
        "Id": "8484",
        "Title": "How to get to Ljubljana (Slovenia) from Trieste (Italy) by Train?",
        "Body": "<p>My Italian part of my trip is almost over; currently enjoying Trieste.</p><p>I have been using the train around Italy but when I checked the Trenitalia website to see if a train left from Trieste to Ljubljana it says it does not know of any trains?</p><p>This does not make sense, surely there must be a train service from Italy to Slovenia?</p><p><a href=\"http://www.trenitalia.com/cms/v/index.jsp?vgnextoid=ad1ce14114bc9110VgnVCM10000080a3e90aRCRD\">http://www.trenitalia.com/cms/v/index.jsp?vgnextoid=ad1ce14114bc9110VgnVCM10000080a3e90aRCRD</a></p><p>If not does anyone know the best way to get from Trieste to Ljubljana?</p>",
        "Tags": "['trains', 'italy', 'slovenia']"
    },
    {
        "Id": "152355",
        "Title": "What's the smallest non-capital city with a foreign consulate?",
        "Body": "<p>As an example, the city of Haifa (population 280k) has a <a href=\"https://haifa.mid.ru/viza\" rel=\"noreferrer\">Russian consulate</a> in addition to the main embassy in Tel Aviv. The Haifa consulate is full fledged and can issue visas, not just an honorary outpost. Is there a smaller non-capital city that has a foreign consulate or embassy?</p><p>The exact conditions are: </p><ul><li>The diplomatic outpost must be an embassy or a consulate, not an \"honorary consulate\"</li><li>It must interact with the general public in some way, e.g. issue visas or provide consular assistance to citizens</li><li>It must be staffed permanently, not just a few times per year</li><li>City here is defined as the largest settlement within a 50km radius from where the consulate is located. E.g. an embassy across the river from Manhattan would count as a New York City consulate, not as a New Jersey consulate. </li><li>The city must not be the official capital of that country </li><li>\"Smallest\" is defined by the total population of the city in question</li></ul>",
        "Tags": "['where-on-earth', 'factoids', 'consulates', 'embassies']"
    },
    {
        "Id": "44838",
        "Title": "How are validated underground tickets checked in Berlin?",
        "Body": "<p>I have been travelling around Berlin the last few days. I have bought a ticket for the underground zones A and B every day but my ticket has not been checked once and there are no barriers (I'm from London where both are the norm).</p><p>Can someone explain the underground system? Is there a ticket man that I've just happened to not come across or does Berlin use another system? Also what are the small machines that you put your ticket into and it punches some indents into the ticket? What are the penalties of not buying a ticket (and how would someone who doesn't buy a ticket get caught?)</p>",
        "Tags": "['public-transport', 'tickets', 'legal', 'germany', 'berlin']"
    },
    {
        "Id": "18726",
        "Title": "What should you do with your house keys while traveling a short time?",
        "Body": "<p>House keys are a strange item for me to deal with when traveling.  You need to take so you can lock up, and you need them when you return, but for the whole trip they are unneeded.  So unlike credit cards or ID, there's no good reason to carry them on your person while away from your hotel.</p><p>So, what's the best thing to do with keys? I have no set place I store them. Sometimes it's in my suitcase mesh, sometimes in a backpack pocket.  In both cases they are loose and tend to shift around a lot.  What's a better way to store them to keep them safe and out of the way for the trip?</p>",
        "Tags": "['luggage']"
    },
    {
        "Id": "145190",
        "Title": "Why are some hotels asking you to book through Booking.com instead of matching the price at the front desk?",
        "Body": "<p>It's happened to me a few times when I've wanted to book a room the same day. I've researched the prices on various hotels before visiting a hotel. At the front desk  I present how many days I want to stay and get a quote - and the quote is higher than the ones on Booking.com and Hotels.com - even though the hotels set the prices there themselves.</p><p>I think this is normal but then I ask for the lower rate at Booking.com - for the same room and days - but the front desk then refuse and ask me to book through the websites instead.</p><p>When doing this it has happened that the staff were surprised that I actually did it (and I do it in the matter of seconds with pre-saved credit cards).</p><p><strong>Why are some hotels doing this?</strong></p><p>I can come up with a few valid reasons:</p><ul><li>The front desk staff isn't allowed to give discounts.</li><li>The hotel wants more sales and reviews on the websites.</li><li>The websites might take some legal responsibility and handle customer service.</li><li>The staff might expect one to accept the higher rate to not have to struggle with the websites (if one is new to them).</li></ul>",
        "Tags": "['bookings', 'hotels', 'booking.com']"
    },
    {
        "Id": "19753",
        "Title": "What kind of ID does the US accept when visiting bars or drinking age events?",
        "Body": "<p>For tourists visiting the states, what kind of ID do you need to carry with you to visit bars or drinking age events?  I understand the passport is the main piece of ID but do they accept any other forms of ID from other countries such as a driver's license with a photo?</p>",
        "Tags": "['usa', 'legal', 'paperwork', 'alcohol', 'nightlife']"
    },
    {
        "Id": "80170",
        "Title": "Is it possible to join someone to help them with the border security process at the airport?",
        "Body": "<p>As a Turkish citizen, I have lived in Ireland for over a year now. My wife is planning to visit me before the end of the year. She will board a plane from Turkey, and I will pick her up from the airport.</p><p>After she sets foot in to Ireland, she will have to pass border security without me, but her English skills are lacking.</p><p>Is there any way for me to join her for this process with my passport? Can I ask the police to let me inside the zone, collect her bags, or/and accompany her during the border security process?</p>",
        "Tags": "['customs-and-immigration', 'ireland', 'turkish-citizens', 'dub']"
    },
    {
        "Id": "95015",
        "Title": "Is there a map of all the Umweltzones (environmental zones) in Germany?",
        "Body": "<p>I occasionally need to drive into Germany for work and since I'm usually taking a rental car it can be <a href=\"https://travel.stackexchange.com/questions/5946/where-can-i-buy-the-german-environmental-badge-while-driving-to-my-destination-i\">troublesome to obtain an Umweltzone sticker</a> while on the road. Therefore it is useful to know where exactly do all the Umweltzones begin and end.</p><p>Is there a comprehensive official map of all the German environmental zones? <a href=\"https://www.environmentalbadge.com/validity-of-environmental-badges/\" rel=\"noreferrer\">There are websites</a> which list the cities where the Umweltzone sticker is mandatory, but their maps are not detailed enough to see the exact border of each zone.</p>",
        "Tags": "['germany', 'automobiles', 'maps']"
    },
    {
        "Id": "134957",
        "Title": "How seriously should I take size and weight limits of hand luggage?",
        "Body": "<p>I'll soon do my first intercontinental flight. Due to price, I decided to travel with hand luggage only. There are specified weight and size limits, of course – in my case it's 7kg and 53x38x20cm on a WestJet flight from London (LGW) to Calgary (YYC).</p><p>As these limits are quite restricting for me, I want to at least fully utilize them. So from this angle, how seriously should I take these values?</p><ol><li><p><strong>Weight:</strong> Weighing is easy and quick so I suppose they will do it every time? How much \"overweight\" would be tolerable as a rule of thumb, if any?</p></li><li><p><strong>Size:</strong> This seems a bit more complicated to me. If I give them a perfectly cuboid-shaped cardboard box, the surely can measure it without trouble, but what about a object with the irregular shape and elasticity of an overstuffed backbag? How do they determine if it's small enough? Do they have something like a 53x38x20cm sized box, and if the bag can be squeezed in it's fine?</p></li></ol>",
        "Tags": "['air-travel', 'hand-luggage', 'novice-travellers', 'westjet']"
    },
    {
        "Id": "62254",
        "Title": "How to effectively organize documents when traveling?",
        "Body": "<p>Each time when I travel, there is a chunk of printed papers and other documents which I have to take with me. </p><p>Some of them are documents which I have to access often: ticket, passport, visa etc. Those I keep in easy-to-access bag or pocket. And there are other documents, like payment receipts, which are not needed that often. But still there is a lot of documents which confuses me.</p><p>I wonder how some of more seasoned travelers here effectively organize the documents when you travel? Is there a specific tool (bag, folder, briefcase) that you use?</p><p>The documents have to be kept well organized and light.</p>",
        "Tags": "['air-travel', 'paperwork', 'tips-and-tricks']"
    },
    {
        "Id": "124722",
        "Title": "How can you dispute a Chinese restaurant's charge practically, in Canada?",
        "Body": "<p>Not living in Canada, my siblings visited <a href=\"http://www.crown-princess.ca/\" rel=\"noreferrer\">Casa Victoria</a> restaurant (紫爵金宴) in Toronto for lunch. Everything went swimmingly until they saw this on their bill:</p><blockquote><p>SAUCE 芥 6.00</p></blockquote><p>They were never notified of this  charge, not written anywhere on the menus or  dim sum sheet. They never requested any sauces. So they requested a manager, and a man in  a business suit came.  They don't speak a word of Chinese, and this dialogue followed:</p><blockquote><p>Manager: This is for table covers, sauces,  preparation.<br />Siblings: Why would we be charged for these? They're standard in any restaurant.<br />Manager: This is standard policy. It's in many restaurants.  Have you never been to Chinese restaurants?<br />Siblings: Can we have your name please?<br />Manager: Sorry. I'm not allowed to give names.<br />Siblings: It's not fair to charge us for something that was never agreed. Will you please waive and remove this charge?<br />Manager: Sorry. I cannot. This is policy.<br />Siblings: Sorry. We don't like hidden charges. They're very unfair. Is there anything you can do to help?<br />Manager: Sorry. No. This is owner's policy.<br />Siblings: Is there someone else who can help with this?<br />Manager: I'm the only manager. Anyway, you have to pay it. If you don't, I report you.</p></blockquote><p>Weary and frightened by this threat, my siblings paid the bill, but without the standard tip of 15%.</p><p>I base the titled question on ethics, not money, as suing  for $6 CAD is obviously senseless.</p><hr /><h3>Further research</h3><p>Googling <code>\"chinese restaurant\" invoice \"cover charge\"</code> yields other restaurants that charge this. <a href=\"https://www.yelp.ca/biz_photos/legend-chinese-restaurant-thornhill?select=moS6FcCy2OuWUs2ljeb4bw\" rel=\"noreferrer\">Legend Chinese Restaurant in Thornhill, ON</a>:</p><p><a href=\"https://i.stack.imgur.com/EfI76.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/EfI76.jpg\" alt=\"enter image description here\" /></a></p><p><a href=\"https://www.tripadvisor.com.sg/LocationPhotoDirectLink-g186338-d9584878-i197066254-Park_Chinois-London_England.html\" rel=\"noreferrer\">Park Chinois Restaurant at 17 Berkeley St, London:</a></p><p><a href=\"https://i.stack.imgur.com/H2g6E.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/H2g6E.jpg\" alt=\"enter image description here\" /></a></p><p><a href=\"https://youdecidelor.wordpress.com/tag/chin-lee-bedok/\" rel=\"noreferrer\">Miss Ene</a> explains how these charges stunned her:</p><blockquote><p>Anyhoo, the point of this entry is not to rave about the food at Chin Lee. Instead, I would like to draw your attention to a little unknown cost. Well, it was pretty unknown to me until today.</p><p>Now, we all know that restaurants charge for the wet napkins and peanuts/pickles that the place on your table at the start of each meal. I don’t have a problem paying for it because I am sure it all adds to their operating costs. However, I was pretty appalled that we (4 pax) paid $10 (excluding 7% GST) for “cover charge” and 2 plates of “pickles”. They were steamed peanuts, by the way.</p></blockquote>",
        "Tags": "['restaurants']"
    },
    {
        "Id": "10041",
        "Title": "Environmental impact of ferries",
        "Body": "<p>When I travel, I try to limit my environmental impact. I don't want to refrain from travelling completely, but when I do travel, I tend to favour ground-level transportation over air-transportation, if distances are not too large (e.g., if traveling over-land would take more than three days, I might fly anyway.</p><p>A well-filled train usually has a much lower ecological footprint per traveller-kilometer than an æroplane, particularly if the train is hydro-electrical, such as in Sweden. High speed trains and diesel trains are already worse, but still considerably better than flying. But what about ferries? Fuel used by (fast) ferries can be quite dirty. On the other hand, ferries may carry over a thousand travellers, sometimes several thousands.</p><p>How does the ecological footprint per traveller of a typical, well-filled ferry compare to the ecological footprint per traveller of an æroplane?  For the sake of this question, I'm interested in ferries going out on the open ocean on routes that potentially compete with airplanes, not in local ferries crossing a river, a lake, a fjord, or a small sound (there's probably no mode of transportation spanning as many orders of magnitude in size as a boat).</p><p>For example, travelling from Stockholm to Warsaw, one might identify four alternatives with a somewhat similar travel class, where all day trains are 2nd class and all overnight accommodation (train or ferry) is with a bed/berth in a shared cabin.</p><ul><li>flying in an ordinary economy seat</li><li>by train+ferry via Nynäshamn–Gdańsk</li><li>by train (almost) all the way via Copenhagen, Hamburg, Berlin (a considerable detour)</li><li>(only part of the year) by train-on-ferry via Malmö and Berlin (<a href=\"http://www.berlin-night-express.com/\" rel=\"nofollow noreferrer\">Berlin Night Express</a>)</li></ul><p>Which one is the most ecological?</p>",
        "Tags": "['trains', 'ferries', 'aircraft', 'ethical-travel', 'environment']"
    },
    {
        "Id": "38718",
        "Title": "From Italy to Austria during winter, by car",
        "Body": "<p>In the first week of January, my family are going to travel from Milan (Italy) to Innsbruck (Austria), then to Munich (Germany) and finally back to Milan (maybe via Switzerland). All the hotels are already booked. My original plan was to rent a car to travel between these cities, but just now I found out that: in order to drive in Austria during the winter, the car should use winter tires. Italy rental car companies, doesn't offer this option, so, I can't rent a car that has winter tires and consequently I can't travel to Austria by car.</p><p>I know I have the option to travel by train, but sincerely, my first option is by car. So, does anyone know how can I handle this situation?</p><p>Also, I'm aware that, in order to drive in Switzerland, the car must have the \"vignette\". Does have any option to drive via Switzerland with a rental car and not to pay the full price for the \"vignette\"?</p>",
        "Tags": "['driving', 'italy', 'switzerland', 'austria', 'winter']"
    },
    {
        "Id": "23871",
        "Title": "How to find out which way airliners bank on takeoff and landing",
        "Body": "<p>How can a layperson airline passenger find out (including in advance from wind forecasts etc) whether an airline will bank left or right, after takeoff and before landing for a given airline, time and airports? </p><p>If given a choice, I would like to choose a seat on the inside of a turn so I can have a better view of the ground and nearby towns/cities.</p>",
        "Tags": "['air-travel', 'airports', 'aircraft']"
    },
    {
        "Id": "7488",
        "Title": "What type of tea is used in Central Asia, especially Uzbekistan?",
        "Body": "<p>When travelling throughout Uzbekistan, Tajikistan, Kyrgyzstan and to a lesser extent, Kazakhstan last year as a guest I was always offered tea, or <em>chai</em>.  It was typically black, sometimes green, in a bowl.</p><p><a href=\"http://www.advantour.com/uzbekistan/uzbek-food/tea.htm\">Some information on this site here</a></p><p>What I want to know is - what tea was it? That is, now that I'm in a western country (Canada) - if I wanted to buy it to drink, what would I even start to search for?  It's clearly not Earl Grey, or Oolong, or Rooibos - but \"chai\" is a little too generic, just meaning tea.</p><p>At the time I told myself I'd happily start drinking it instead of coffee, so I'd love to see if it's still as tasty when I'm sitting in a cubicle...</p>",
        "Tags": "['food-and-drink', 'culture', 'uzbekistan', 'central-asia']"
    },
    {
        "Id": "122689",
        "Title": "Solo-Driving from Florida to New York During the Winter",
        "Body": "<p>In the past, I have asked a question on this exchange regarding driving a well-maintained car across the East Coast of the U.S. In that particular question, I wanted to know if it were safe for a car to drive those distances in such a short period (turns out it is actually optimal).</p><p>Now, I wonder whether or not it will be safe for <em>me</em>, not only my vehicle.</p><p>I have virtually no experience driving in wintry conditions. I've lived in snow when I was younger. I know how to prepare myself for it, but I do not know how to prepare or maintain a car in it, nor how to travel potentially long distances through it. The trip from FL to NY (Buffalo) is about ~1.3k miles (~2k km), where, by mid-December, I think it would be reasonable to expect icy conditions on more or less half the length of the route.</p><p>I have twice the experience driving the distance, not any for the conditions. As a virgin to driving long distances in such conditions, as a vehicle owner and operator, <strong>what are the more important notes one should regard when doing this thing?</strong></p><p>There are potentially endless notes one could make on such a topic, so for \"more important,\" I mean things which most who have experience with these matters would agree upon, things of common knowledge/conventional wisdom/norms.</p><p>For an answer:</p><ul><li>perhaps some qualities of the conditions not inherently obvious to a newbie;</li><li>perhaps some of the potential actions of other drivers on the road which may not inherently make sense to a newbie;</li><li>perhaps some recount of a quote or of personal experience driving through such conditions;</li><li>and/or perhaps a list of items which may be desirable to have or prepare to have for the trip,</li></ul><p>would be sufficient.</p>",
        "Tags": "['usa', 'driving', 'solo-travel']"
    },
    {
        "Id": "183618",
        "Title": "How to tell Google Maps to avoid bad neighborhoods in San Francisco?",
        "Body": "<p>A couple I know will travel from Greece to San Francisco for their honeymoon, and then visit other places too; it's their first trip abroad.</p><p>I remember when I first came to SF, I used Google Maps to navigate. Once I was on foot, and it guided me directly into a \"bad\"/dangerous neighborhood. I was afraid that if I turned the other way I came from, they might be offended and react. I made it through safely, but the images I saw were shocking and hard to forget.</p><p>How can I advise the young couple to use Google Maps to boost the chances of avoiding this experience? Maybe use Apple Maps? Or it won't make any difference?</p><p>PS: I'm not in US now to check myself.</p>",
        "Tags": "['usa', 'safety', 'maps', 'san-francisco', 'google-maps']"
    },
    {
        "Id": "147267",
        "Title": "Is a Middle Name a Given Name?",
        "Body": "<p>My full name is four names long - First name, Middle name, Middle name, Last name.  Whenever asked for my <em>Given Name</em> I have always supplied my First name (not either of my middle names).</p><p>This week I have applied for a Canadian eTA, and put (as per usual) my First name only into the <em>Given Name(s)</em> field.</p><p>But now I'm wondering, should I have included my middle names also into that form?  In my passport I have all four names printed.</p>",
        "Tags": "['canada', 'paperwork', 'terminology', 'eta']"
    },
    {
        "Id": "110404",
        "Title": "Orlando International airport - can you get from terminal A to B while inside security?",
        "Body": "<p>My friends and I are flying out of MCO (Orlando International Airport in FL in the USA). One friend and I are on JetBlue and will likely have a gate in section 1 in Terminal A, where the other friend is on Delta and will likely be in section 4 in Terminal B. </p><p>The other friend has a later flight than ours. Can she join us at our gate until our flight leaves, then go to her gate while only going through security once?</p><p>It's unclear from the <a href=\"https://www.orlandoairports.net/getting-around-mco/\" rel=\"noreferrer\">map</a> if you need to \"choose\" a gate to go through security through, or if the gates are connected beyond security. </p>",
        "Tags": "['usa', 'airports', 'mco']"
    },
    {
        "Id": "92994",
        "Title": "How to get to Niagara Falls (Canada side) from Toronto airport during a layover?",
        "Body": "<p>I'm a French citizen traveling from Vancouver to Paris, but happen to have quite a lengthy layover in Toronto (5:50am to 7pm), and I thought this would be an excellent opportunity to see Niagara Falls.</p><p>Is this enough time to get to and from Niagara Falls, Ontario, Canada and back to Toronto airport to catch my flight (if I want to be back by 4:30pm)? I see that it takes about a 2 hour drive, more or less. Is this true? </p><p>And... how to get there from the airport? Is there an airport shuttle? Or tour service? I saw the <a href=\"https://www.niagaraairbus.com/\" rel=\"noreferrer\">Niagara Air Bus</a> offers this service - do they have a monopoly on this service?</p>",
        "Tags": "['airport-transfer', 'layovers', 'transportation', 'toronto', 'niagara-falls']"
    },
    {
        "Id": "162113",
        "Title": "What is the highest road in the world that is accessible by conventional vehicles?",
        "Body": "<p>I'm looking to drive up the highest road in the world but I don't have access to any special vehicles. Where can I do so? The exact conditions are:</p><ul><li>The road must be accessible to civilians, so military roads by the Chinese-Indian border are excluded for example.</li><li>The road must be accessible to international tourists.</li><li>You can drive up the road on your own without needing to hire a guide as your driver</li><li>You can use a regular car, the likes of which one can rent at airport car rentals. In the US this usually means something like a stock 4WD Jeep at most, but nothing more fancy like cars with reinforced undercarriages.</li></ul><p>I've found <a href=\"https://www.dangerousroads.org/around-the-world/our-lists/166-the-highest-motorable-road-passes.html\" rel=\"noreferrer\">this list</a> on DangerousRoads.org, but it includes many enthusiast-only roads.</p>",
        "Tags": "['where-on-earth', 'road-trips', 'factoids', 'overland']"
    },
    {
        "Id": "64839",
        "Title": "Whaling tours or vacation packages in the West?",
        "Body": "<p>Are there any \"Western\" adventure packages for those who want to try hunting whales? </p><p>I'm aware of a number of Japanese and <a href=\"http://megakomodotours.com/lembata-island-tours-of-indonesia/whale-hunting-tours-lembata-tours-6d5n/\" rel=\"nofollow\">Indonesian whaling tours</a>, but we've taken our last several vacations in Asia and would prefer to explore other regions. So by \"Western\" I mainly just mean non-Asian and at least someone on staff probably speaks some English. </p><p>I'm thinking Norway or Iceland, probably. I understand that Iceland and Norway are leading whale hunters, especially for Minke whales.</p>",
        "Tags": "['legal', 'vacations', 'fishing', 'hunting']"
    },
    {
        "Id": "99656",
        "Title": "US Port of Entry: what to answer for \"Are you traveling with anyone\"",
        "Body": "<p>I am a student on F1 visa. My husband is working on an H1B. We are both Indian Nationals. At the port of entry, since our visas are separate (i.e. one is not a dependent of the other), we approach the immigration official one after the other i.e. not as a group. </p><p>(1) Has anyone with separate visas approached the official together as a family / group? </p><p>(2) When approaching separately, what to answer for the question, \"Are you traveling with anyone?\". Since I am not dependent on anyone and no one is dependent on me, it looks like I should say no. But, I am traveling with my spouse in the same flight, even though he is on his own separate visa. So, should I be saying yes? What does the immigration officer mean by this question?</p>",
        "Tags": "['visas', 'customs-and-immigration']"
    },
    {
        "Id": "5446",
        "Title": "What truly cross-continental train trips still exist?",
        "Body": "<p>I've done much of the trans-Siberian, and it's a great experience.</p><p>I'm wondering what other trans-continental train trips still exist.  This would have to span the width (or length) of a continent.  I'm assuming it's possible to cross the US by switching lines and zig-zigging, but is it possible to head along the same line continuously from coast to coast?</p><p>I believe there's an Australian one as well.  Not sure that any exist for South America or Africa though?</p>",
        "Tags": "['trains', 'adventure', 'long-haul']"
    },
    {
        "Id": "149323",
        "Title": "My name causes an issue with any booking! (names end with MR and MRS)",
        "Body": "<p>My name is Amr Eladawy. Whenever I get a ticket through an agent and they put my first name as <code>Amr</code>, it lands as <code>A</code> only in the Airlines system. That happened with many airlines and different agents. That is pretty much annoying, specially during the online check-in.</p><p>When I make a direct booking from the airlines website, the ticket is issued as <code>ELADAWY/AMRMR</code>. </p><p>It seems that there is a smart rule that considers the suffix <code>MR</code> as Mister and drops it. </p><p>Is this the correct behavior? What should I do to have my name printed correctly on my bookings.</p><ol><li>In one of my bookings, the first and last name were swapped by mistake. However, <code>AMR</code> in the last name was not a problem at all.It seems that this rule is applied only on the first name.</li><li>The airlines will swear that they received the name as <code>A</code> and the agent will swear that the name was sent as <code>Amr</code>.</li><li>The problem maybe in the GDS used to integrate the agent's system with the airlines's.  </li><li>I sent an email to the GDS about this issue and they simply ignored me.</li></ol><p><strong>Now</strong>, moving forward. <code>Amr</code> is a very popular Arabic name. It's also a very old one and has been used for thousands of years. How to properly report this to the GDS providers and get this issue fixed?</p><p>I have tried contacting one GDS responsible for the latest booking I had, but they ignored me.</p>",
        "Tags": "['bookings', 'airlines']"
    },
    {
        "Id": "9035",
        "Title": "What to do when you can't print your boarding pass?",
        "Body": "<p>I just use web checkin for my flight tomorrow. After that I should have printed my boarding pass. However, I realised that this is not possible. So what can I do now? I have already checked in, but no boarding pass. Is there any way to print that again at the airport? Or is it enough if I have my confirmation number? Or the boarding pass as a PDF?</p>",
        "Tags": "['tickets', 'regulations', 'paperwork', 'yvr', 'air-canada']"
    },
    {
        "Id": "182608",
        "Title": "Does one need cash in the UK?",
        "Body": "<p>Are there any places in the UK where one still can't pay with a card / contactless? Restaurants, campsites, etc.? Is it a good idea to bring / withdraw a few GBP just to be on the safe side, or is it completely unnecessary? I've got an EUR bank account with a Mastercard debit card. My bank doesn't charge extra fees for non-EUR card transactions (other than cash withdrawals, which cost €5 flat).</p>",
        "Tags": "['uk', 'money']"
    },
    {
        "Id": "52565",
        "Title": "Is there a map/list of all regional trains departing from Paris?",
        "Body": "<p>I am interested in visiting around Paris and since French regional trains are quite convenient (no reservation, no last minute high price) to travel and explore an area I would like to know if there is a centralised map or list of all or most regional train lines departing from Paris (to reach destinations within 2 hours of any Paris station).</p><p>I know it is quite complex because Paris has multiple stations and trains are organised by the regions and therefore each region has its own map/list. </p><p>So far I found the map for the <a href=\"http://www.transilien.com/contents/fr/Docs---PDF/Plans/Carte%20fusion_03_2014.pdf\">Ile-de-France region</a> but I wish there was a single map including regional trains managed by all neighboring regions. </p>",
        "Tags": "['trains', 'online-resources', 'france', 'paris', 'maps']"
    },
    {
        "Id": "20310",
        "Title": "Is it legal for officials to hold my foreign driver's license as a guarantee for a traffic fine?",
        "Body": "<p>I was pulled over again today in Mexico, for an illegal left turn.  The officer wanted to hold my driver's license until I paid the fine--as is common practice in Mexico for foreigners.</p><p>However, I've been told by friends that it is illegal for local officials to hold a foreign driver's license, as it is an \"International document\" (whatever that really means).</p><p>I said this to the officer, and he showed me some official-looking \"rule book\" stating that the officer could demand a license or other form of guarantee for a traffic fine.  Of course his document did not say whether it applied to foreigners--and I don't know if such a rule would have jurisdiction anyway.</p><p>I asked to photograph his rule book, and he told me that was not allowed because it was an official document (ha! whatever).</p><p>(Good news is he didn't fine me this time anyway).</p><p>So the question:  As traveler in foreign countries, can a local authority hold my U.S. driver's license when issuing a traffic violation, or is there any sort of international law that prohibits this?</p>",
        "Tags": "['legal', 'officials', 'traffic', 'corruption']"
    },
    {
        "Id": "21335",
        "Title": "Is there a way to work on a MacBook Pro on >10 hour flights?",
        "Body": "<p>Whenever I am on a long flight, I try to be as efficient as possible in laptop usage. Everything that I don't need is switched off, from WiFi and Bluetooth to any other unneeded app.</p><p>I mainly need to write, so this way I can manage up to 5 hours. On my previous Mac, I simply had an additional battery packed, which would allow me twice the amount of working time. Unfortunately, Apple decided to make the battery an integral part of the laptop.</p><p>On my 11 hour flight last week, there was however this guy who was working all the time on his laptop and I saw him coding and compiling all the time. I intended to ask him how he managed to do that without external power available while deplaning, but I simply forgot :(.</p><p>My question is how can I work on a MacBook Pro longer than 5-6 hours when on a long flight with no external power available?</p>",
        "Tags": "['air-travel', 'electronic-items', 'power']"
    },
    {
        "Id": "44887",
        "Title": "Can I live on an unoccupied island?",
        "Body": "<p>Suppose that I am going to unoccupied island in Oceania, the Carribean, or somewhere else.</p><p>Suppose I find an island where nobody is there, and nobody knows about it. If I invade it like a pirate (maybe alone or with friends)— and of course I am a rich guy, and have money to build a house, or buy some big ship, and have money to buy food and other goods from other inhabited islands to survive there— and suppose that I have a passport of another country, would that be considered unlawful? What punishment would I get?</p>",
        "Tags": "['legal', 'islands']"
    },
    {
        "Id": "72026",
        "Title": "The UK has voted to leave the EU. How does Brexit affect people traveling to the UK and vice-versa?",
        "Body": "<p>On 23rd of June, 2016, the UK <a href=\"https://en.wikipedia.org/wiki/United_Kingdom_European_Union_membership_referendum,_2016\">voted in a referendum to leave the EU</a>. This leads to the following questions:</p><ul><li>Are UK citizens traveling to the EU affected?</li><li>Are EU citizens traveling to the UK affected?</li><li>Are UK/EU family members traveling both way affected?</li><li>Are Commonwealth citizens traveling to the UK affected?</li><li>Are other visa-free nationals (such as US/Canada citizens) affected?</li><li>What other consequences might 'Brexit' have on travelers?</li></ul><p>Also, see the <a href=\"https://expatriates.stackexchange.com/questions/8593/the-uk-has-voted-to-leave-the-eu-how-does-this-affect-eu-nationals-living-worki\">related post</a> on Expats.SE.</p>",
        "Tags": "['visas', 'uk', 'eu', 'event-based-effects', 'visa-free-entry']"
    },
    {
        "Id": "77659",
        "Title": "Can two persons with same flight ticket apply for visa from different countries?",
        "Body": "<p>My friend and I are going to visit Malaysia. I live in Germany and my friend lives in India. We have booked a common flight  ticket from Delhi, India to Malaysia. </p><p><strong>QUESTION:</strong> Is it possible that I apply for Malaysian visa from Germany and my friend apply from India? </p><p><strong>UPDATE:</strong> Thanks for funny, sarcastic and meaningful replies. I just meant that we (my friend and I) have a single booking (a ticket on which my friend's name and my name are written). So, I was wondering could it be a problem if I submit this ticket for the visa. I was just curious if the embassy could ask me the details of the second person. Apparently, it should not be any problem.</p>",
        "Tags": "['visas', 'malaysia']"
    },
    {
        "Id": "162140",
        "Title": "Can I make a leisure trip to California (vacation) in the current covid-19 situation as of 2021, will my quarantine be monitored?",
        "Body": "<p>I am planning a vacation trip out of state from Boston, Massachusetts to California by air. I found a deal that will work around Presidents' Day but then there was this warning to check the <a href=\"https://www.cdph.ca.gov/Programs/CID/DCDC/Pages/COVID-19/Travel-Advisory.aspx\" rel=\"nofollow noreferrer\">California travel rules</a> updated as of Jan 6, 2021. That link says</p><blockquote><ol start=\"2\"><li>Non-essential travelers from other states or countries are strongly discouraged from entering California, and should adhere tothe quarantine procedures set forth in Paragraph 3.</li></ol></blockquote><p>And then para 3 basically says that you should quarantine yourself for 10 days when you arrive in or return to California.</p><p>My question is, can I take a leisure travel to California by Air out of state? Will my quarantine be mandated? Since I will be travelling for few days, my trip would be useless if I had to quarantine myself. What is sane advice that I should take? How much of risk I am putting myself and others in the current covid-19 situation?</p><h2>Additional Information</h2><p>Adding some details as pointed out in comments. I am a bit sick of cold weather up north, want to take a vacation to warm and sunny place. I out-ruled abroad (Caribbean etc) because of current pandemic and strict rules as well as cost, thought within US should be OK.</p><p>My trip would be to San Deigo, CA for 3 days.</p><p>A friend of mine travelled from abroad, he was not mandated at all for quarantine so I am wonder how can this be enforced?</p><p>Yes It is not a concern for me if attractions are closed, main goal is to explore San Deigo, experience the weather and vibes, go hiking. We probably wont have time to go any attractions anyways in 3 days.</p><p>Last we like traveling, it is not super fun in Pandemic but again sick of cold and want to take a break. Major concern is if I go anyways, will my quarantine by enforced?</p>",
        "Tags": "['usa', 'covid-19', 'california', 'quarantine', 'massachusetts']"
    },
    {
        "Id": "26970",
        "Title": "How can you buy train tickets at Oslo Airport?",
        "Body": "<p>In June I will have to travel from Oslo Gardermoen airport to Oslo Central Station to catch the train to Finse. I already booked a ticket from Oslo central station to Finse (with NSB), but didn't want to be tied to a certain time for the ticket from Oslo airport to Oslo Central Station. </p><p>As soon as I pick up my luggage I want to go to the train so that I have some time to spare in Oslo.</p><p>I was wondering how easy it is to buy a ticket at the airport, are there any vending machines around where you just can buy a ticket?</p>",
        "Tags": "['trains', 'tickets', 'norway', 'oslo']"
    },
    {
        "Id": "77151",
        "Title": "Is there a possibility to preserve an unused Indian mobile number for a period of time?",
        "Body": "<p>I travel to India a couple of times per year. I purchased an Indian SIM card and I find that there is no network for this Indian service provider in Southern Germany (Friedrichshafen/Konstanz). And as per Indian telecom rules, the service provider deactivates a number that is not in use for more than 90 days.</p><p>I would like to know if there are any method to preserve my Indian number when I am in Germany and not using the Indian number. For further information, the Indian service provider is Vodafone. And the plan is called a prepaid connection (for people who are familiar with the Indian telecom system).</p><p>What is the cheapest way to preserve my number? Or what is the cheapest alternative? German telecom companies charge heavily for roaming and I have no interest in using them in India.</p>",
        "Tags": "['india', 'cellphones']"
    },
    {
        "Id": "65894",
        "Title": "Transportation from St Pancras to Isle of Wight",
        "Body": "<p>I'm looking for the most convenient way to travel from St Pancras to the Isle of Wight, by public transport. By convenient I mean the least number of changes. Subways and trains are preferred over buses, helicopters and planes don't count ;-).</p><p>Google Maps shows a few options, but they all seem to include at least two changes in London. So far, I think my best bet is to take the Victoria line to Vauxhall, then a train and a ferry. Although it includes a walk to King's Cross.</p><p>I'll be arriving by Eurostar, so a connection from either Ebbsfleet or Ashford would probably be fine too. But from what I can see now, everything is going through London anyway.</p><p>If it matters, I'll be traveling on a Sunday.</p>",
        "Tags": "['public-transport', 'england', 'eurostar']"
    },
    {
        "Id": "5479",
        "Title": "Is it safe to stay outside the Boulevard Périphérique in Paris?",
        "Body": "<p>I'm planning on staying in Paris with my wife for a few days in April. I've found a number of hotels for a reasonable price and with overall good reviews on TripAdvisor. But all of them are located in the area outside the Boulevard Périphérique. I have been told that the crime rate is higher in that part of the city (mostly petty theft, robbery and burglary). So, I'm considering staying at a more central hotel (and paying considerably more, of course).</p><p>More specifically, most hotels are on the North and East suburbs. Three of them near the Gallieni‎ station, one near the Garibaldi station, one near the Porte de la Chapelle station and one near Vanves-Malakoff train station.</p><p>Am I being too paranoid? Is it safe, for example, to come back walking to the hotel at night?</p>",
        "Tags": "['safety', 'hotels', 'security', 'paris']"
    },
    {
        "Id": "2919",
        "Title": "What is an easy way to see what routes are available from a given airport?",
        "Body": "<p>I would like to see, at a glance, all the flights to/from a given airport.  </p><p>Example query: \"What cities can I reach on a single flight from Hannover (HAJ) airport?\"</p><p>Is there any website which does this?</p>",
        "Tags": "['air-travel', 'airports', 'routes']"
    },
    {
        "Id": "79208",
        "Title": "Measuring my options to reach the SF airport",
        "Body": "<p>One of the hardest things for me, when in a new country, is to understand how public transportation works and if the taxis are worth it (i.e. whether the higher price you pay is not that much, given the effort you will \"pay\" to get to your destination with the bus for example).</p><p>My flight is Saturday 16:00, from San Francisco to Paris. I remember that I arrived from SF airport to Market St. by the BART, but I have no memory of the station I disembarked at. I am staying some blocks below Market and 3rd St.</p><p>I was lucky enough to not use any means of transportation after that BART ride from the airport, so I have no clue. </p><p>What are my options to reach the SF airport from there, and a rough approximation about the price?</p><hr><p>Remarks:</p><ol><li>In some countries, you have to switch lines when you use the subway,to get to the correct one that will get you at the airport. I wouldrather avoid that, since I will have one luggage, one hand-luggageand the laptop bag. I am not sure if BART that goes to the airportis accessible from every underground station I see in Market St. .</li><li>My Greek phone will <em>not</em> work here, and is also very old (imagine it like an old classic Nokia if you want), so if something needselectronic interaction, I can only use my laptop, before leaving thehouse.</li></ol><hr><p>Edit: </p><p>By asking, you go to the city, as the Romans(?) said, but there is <a href=\"https://travel.stackexchange.com/questions/78842/electricity-stopped-working-at-my-airbnb-housing-how-can-i-get-compensated-for\">some heat where I stay now with Airbnb</a>, that's why I am asking for help here... :/</p>",
        "Tags": "['public-transport', 'airport-transfer', 'california', 'san-francisco', 'sfo']"
    },
    {
        "Id": "151914",
        "Title": "Bringing hiking shoes with dirt/soil to the US?",
        "Body": "<p>I'm soon travelling from Europe to the USA and I'm bringing hiking and running shoes with dirt on them (originating only from the EU and not from any farms). I have already thoroughly cleaned them, but it's hard to get them completely clean. </p><p>Will this be a problem when entering the USA? Should I do anything in particular? I'm travelling via the preclearance in Dublin, if that makes a difference.</p>",
        "Tags": "['usa', 'customs-and-immigration', 'pre-clearance']"
    },
    {
        "Id": "59240",
        "Title": "Is street photography ok/accepted in UK, Portugal, Belgium and Germany?",
        "Body": "<p><strong>Context</strong></p><p>I was recently informed that in Germany I cannot take pictures of houses (as the subject), however this is not <strong>true</strong>. It can be possible to take pictures but owners of buildings may chose to opt out, in systems such as Google Street Maps but in general it <em>is</em> possible for people to take pictures of houses or related, generally. Publication it seems may always be allowed and as always owners may complain as you <strong>are</strong> taking the image.</p><p><strong>Question</strong></p><p>In the UK, Portugal, Belgium and Germany is street photography allowed, and/or is it discouraged by the local/police/related?</p><p>For those that have links or books that may cover all of Europe, please link as well.</p><p>(Perhaps I'm not seeing it as I live in America. American law dictates that if you're on a public street/location, you can shoot anything/anyone, assuming you can reach them with your lens and you're not blatantly trespassing for the shot. Exceptions exist if it causes a problem with the government (security) or at a place where privacy is expected such as the bathroom.)</p>",
        "Tags": "['europe', 'legal', 'photography']"
    },
    {
        "Id": "100716",
        "Title": "What are these large, empty towers made of connected metal girders, bars or pipes in London?",
        "Body": "<p><a href=\"https://i.stack.imgur.com/IHtzd.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/IHtzd.jpg\" alt=\"enter image description here\"></a></p><p>I saw one on the Greenwich Peninsula next to the O2 and another one while leaving Paddington towards Slough.</p><p>Courtesy: <a href=\"http://www.urban75.org/london/images/north-greenwich-34.jpg\" rel=\"noreferrer\">urban75.org</a></p>",
        "Tags": "['london', 'identify-this']"
    },
    {
        "Id": "81261",
        "Title": "Would it be ok to eat rice using a spoon in front of Westerners?",
        "Body": "<p>It seems to me that Westerners are willing to learn to use chopsticks in Asian restaurants. However, when spoons are the way the dish is normally eaten within the country of origin, Westerners prefer to use a fork. </p><p>Since presumably both spoons and forks originated from the West, is it OK to eat rice using a spoon in front of Westerners in a Western country, or should I use a fork instead?</p><p>Would it be considered rude to use a spoon to eat rice, since spoons in the West are normally associated with soups?</p>",
        "Tags": "['food-and-drink', 'culture', 'etiquette', 'cultural-awareness']"
    },
    {
        "Id": "85357",
        "Title": "How to prepare a picky eater for Thai, Cambodian, and Vietnamese cuisine?",
        "Body": "<p>My in-laws are heading overseas on a guided tour of Thailand, Cambodia, and Vietnam.  While my mother-in-law is a little more on the adventurous side when it comes to new flavours and textures, my father-in-law is a \"meat-and-potatoes-with-salt\" kind of guy; it also doesn't help that he's not a fan of anything spicy, both in flavour and heat.</p><p>What are some typical dishes they may enjoy with their North-American-trained taste buds and can expect to come across while in these countries?  They are Canadian nationals with Irish heritage.  If these dishes can be found in their area, they can taste them to better prepare themselves for their culinary adventure.</p>",
        "Tags": "['food-and-drink', 'thailand', 'vietnam', 'cambodia', 'local-cuisine']"
    },
    {
        "Id": "109061",
        "Title": "UK citizens traveling to Ireland with a child having no passport, what's the alternative for the ID?",
        "Body": "<p>I understand from various answers here, and from .gov.uk that I don't need a passport to travel to Ireland: I can just show my UK driver's license.</p><p>But what if I'm travelling with a 10 year old child who does not have a passport, and obviously no driving license either.</p><p>Is there some other form of ID which would be accepted?</p>",
        "Tags": "['customs-and-immigration', 'paperwork', 'uk-citizens', 'ireland']"
    },
    {
        "Id": "17258",
        "Title": "How can I accurately estimate the weight of my luggage?",
        "Body": "<p>This is somewhat of a problem for me.  Sometimes, when I'm packed up and getting ready to move, I find that I have no reliable way to weigh my own luggage.</p><p>Of course, most of us know that airlines nowadays usually have heavy restrictions on luggage, including size, type, but mostly, weight.</p><p>How should I accurately estimate the weight of my lugagge then? It seems that the norm for most airlines is 50lbs per luggage, but how can I tell whether or not something is below, equal, or above that imposed limit?  </p>",
        "Tags": "['air-travel', 'luggage', 'tips-and-tricks']"
    },
    {
        "Id": "108905",
        "Title": "A visa to visit the island that switches countries every six months?",
        "Body": "<p>So <a href=\"http://www.bbc.com/news/stories-42817859\" rel=\"nofollow noreferrer\">the island of Faisans</a> is in France/Spain. Yes, both.</p><p>For six months of the year, from February 1st to 31st July, it's under Spanish rule - and for the following six months - it's under French control.</p><p>So my question - do you need a Spanish visa during the 'Spanish time' and a French visa during the 'French time', in order to visit it, or given they sorta share the island, would either work?</p><p>(Yes I realise they're both Schengen countries, but it is also possible for one to <a href=\"https://www.immihelp.com/visas/schengenvisa/limited-territorial-validity-visa.html\" rel=\"nofollow noreferrer\">get a visa for a particular country</a>. Yes I realise it's probably not guarded and nobody cares, but I'm interested in trivial laws like this and the long-term effects they might have.)</p>",
        "Tags": "['visas', 'france', 'spain', 'faisans']"
    },
    {
        "Id": "4978",
        "Title": "Can I side-step discrimination against foreigners in Japan?",
        "Body": "<p>I've heard that there can be discrimination against foreigners, and even <a href=\"http://en.wikipedia.org/wiki/Debito_Arudou\">naturalized citizens</a> born in other countries, in Japan, and that it happens in onsen, bars, and adult entertainment establishments.</p><p>Is this a more common problem in more rural areas, such as Tohoku, than in metropolitan places such as Tokyo?</p><p>Are most places that discriminate against foreigners strict about their policies, or are they willing to ignore the rules if you're obviously not a trouble-maker? What if you explain that you aren't one of (Nationality X) that's caused trouble lately?</p><p>In places where a significant proportion of establishments discriminate against foreigners, are the places that don't discriminate fairly inferior to those that do discriminate?</p>",
        "Tags": "['japan', 'discrimination']"
    },
    {
        "Id": "62322",
        "Title": "Would a non-business traveler ever benefit from collecting air miles, as compared to simply buying the cheapest ticket available?",
        "Body": "<p>Looking at various air miles programs around the world, it seems to me that they're only useful for business travelers, who basically get free flights out of their employer's pocket. However for a regular Joe, who pays out of pocket, all of the programs seem useless when comparing to the option of simply flying the cheapest flight at any given time. Even benefits such as business lounges are either useless (why would I use a lounge on a non-transfer flight?) or can be bought for a reasonable fee when needed.</p><p>There are also credit cards which give out cashback in the form of air miles, however their pay-out is usually lower than simply getting a fixed cashback in dollars.</p><p>So, is it ever useful for a person to care about air miles if they're paying for everything out of their own pocket?</p>",
        "Tags": "['air-travel', 'loyalty-programs']"
    },
    {
        "Id": "882",
        "Title": "Shipping my car from Europe to Canada or the U.S",
        "Body": "<p>The plan is to drive my car (<a href=\"http://0.tqn.com/d/4wheeldrive/1/0/O/L/1/Alek_Ser_04LadaNiva_2RR.jpg\" rel=\"nofollow noreferrer\">a small 4x4</a>) from <a href=\"https://en.wikipedia.org/wiki/Prudhoe_Bay\" rel=\"nofollow noreferrer\">Prudhoe Bay</a><sup>1</sup> (<a href=\"https://en.wikipedia.org/wiki/Deadhorse,_Alaska\" rel=\"nofollow noreferrer\">Deadhorse</a>), Alaska to <a href=\"http://en.wikipedia.org/wiki/Cape_Horn\" rel=\"nofollow noreferrer\">Cape Horn</a>, <a href=\"http://en.wikipedia.org/wiki/Tierra_del_Fuego\" rel=\"nofollow noreferrer\">Tierra del Fuego</a> in Chile. I will be travelling for an undetermined duration, with a minimum of two years. (I know it can be done a lot faster, but it's about the journey, the destination is just an excuse).</p><p>We will leave in the first week of January, 2013. For various reasons, I've decided to bring my own car. So, I'll need to ship it from Europe to Canada.</p><p><br/><strong>My questions are:</strong>  </p><ul><li>Has anybody shipped a car between Europe and Canada or the U.S.?  </li><li>What kind of cost am I looking at?  </li><li>Any gotchas I need to know about?</li></ul><p><br/><strong>Quick Update</strong><br>I'll be shipping from wherever is the cheapest option in Europe (mainland) and shipping to the cheapest option in Canada or the U.S.</p><p><br/><strong>Extra Information</strong><br>Many people suggested buying a car in either Canada or Alaska. But that does not answer the question I was asking : ) The car has some very nice base characteristics (very small, very good off-road ability, cheap) and in addition has special modifications for long range independent travel (such as, but not limited to, extended fuel- and water tanks) and in addition, I know this car's history so I can make an informed estimate about it's reliability. <em>So, I've decided to bring this car</em>. The question is now, what's the best/cheapest option to ship it.</p><p>I will likely <em>not</em> re-register the car in the U.S. nor Canada. I've heard from several travellers that it increases hassle if your car is registered in a different country than you live in, so, for now, the plan is to keep the car registered in my home country.</p><p><sub><sup>1)</sup> I Actually wanted to go to <a href=\"https://en.wikipedia.org/wiki/Barrow,_Alaska\" rel=\"nofollow noreferrer\">Barrow</a>, but it turn out the 200 miles between there and Deadhorse are <a href=\"https://travel.stackexchange.com/questions/7798/getting-to-barrow-alaska-overland\">an expedition in itself</a></sub>.</p>",
        "Tags": "['canada', 'europe', 'automobiles', 'shipping']"
    },
    {
        "Id": "10614",
        "Title": "Is Vatican City considered a country?",
        "Body": "<p>I have a life-long goal of seeing at least 50 countries before I die.  I'm behind but I figure I would see most of them over the next 20 years as I get closer to retirement and make my fortune.  :-)</p><p>Anyway, we will be in Italy <strong>this week</strong>!!  Part of that trip will be four days in Rome and of course, Vatican City. </p><p>So before my trip to Italy, I have been to 12 countries.  We will only be in Italy and of course, Vatican City.  So my question is, will the number of countries I've been to now be 13 or 14?</p><p>Or am I just quibbling over a technicality?</p>",
        "Tags": "['factoids', 'terminology', 'countries', 'cities', 'vatican-city']"
    },
    {
        "Id": "1911",
        "Title": "Should I change most of my money in my home country or in the destination country? baht to canadian dollars....change in thailand or canada",
        "Body": "<p>Where can I get more favourable exchange rate, in general?changing baht to Canadian dollars in Thailand or Canada or make a bank transfer to my Canadian account</p>",
        "Tags": "['exchange']"
    },
    {
        "Id": "34166",
        "Title": "Tipping in Vietnam",
        "Body": "<p>I will be going to Vietnam next year for tourism. </p><p>I would like to not offend locals so I was wondering if someone could tell me what the policy for tipping is over there ?</p>",
        "Tags": "['local-customs', 'vietnam', 'tipping']"
    },
    {
        "Id": "37752",
        "Title": "Is the price per person affected by searching a flight for more than one person?",
        "Body": "<p>When I search for a flight for more than one person I usually search the flight for one so that I can easily have the total amount per person.<br>I wonder if there are cases in which searching for more than one person would result in a cheaper fare per person.  </p>",
        "Tags": "['tickets', 'fares', 'flight-search-engines']"
    },
    {
        "Id": "378",
        "Title": "Can anyone recommend a good trekking tour for Machu Picchu?",
        "Body": "<p>I'm planning on heading to Peru to visit <a href=\"http://wikitravel.org/en/Machu_Picchu\" rel=\"nofollow\">Machu Picchu</a> next year.  I heard there are some amazing and beautiful \"long way around\" treks that take you up and around to Machu Picchu the long way through the Andes as an alternative to going the direct and crowded tourist route.  It's a multi-day trek where you have to sleep in tents along the way.</p><p>Has anyone taken a trek like this, and if so, how long was it, how much did it cost (approx), and if you know the tour company/website that would also aid in my research and trip planning!</p>",
        "Tags": "['tours', 'guides', 'peru', 'trekking', 'machu-picchu']"
    },
    {
        "Id": "166268",
        "Title": "Is there a faster route between Milton Keynes and Cambridge, England than taking a train via London?",
        "Body": "<p>It's ridiculous to find that Google recommends taking a train to London then to Milton Keynes. This really looks like a roundabout route. But I can't find any bus services that are faster than this route. Does anyone have a better idea?</p><p><a href=\"https://i.stack.imgur.com/c6Gcp.png\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/c6Gcp.png\" alt=\"enter image description here\" /></a></p>",
        "Tags": "['public-transport', 'england', 'cambridge']"
    },
    {
        "Id": "74109",
        "Title": "What do you do if your driver's license was stolen a week before a domestic US flight?",
        "Body": "<p>Normally to get past the security checkpoint you need to show the TSA agent your boarding pass and a valid picture ID. But what happens if your wallet was stolen a week before your scheduled flight? You might be able to get a temporary ID (eg. a black and white printout) but would that be an acceptable picture ID?</p><p>Maybe you could file a police report about the stolen wallet but would that even make a difference in this scenario?</p><p>edit: let's assume the US state is Texas since I guess not all US states issue temporary ID's.</p>",
        "Tags": "['usa', 'airports', 'us-citizens', 'airport-security', 'tsa']"
    },
    {
        "Id": "154493",
        "Title": "Travelling to Greece without knowing the language",
        "Body": "<p>I am considering travelling to Greece to compete in the Athens Classic Marathon, but I do not speak any Greek. </p><p>I will be fine once I get to the hotel as the travel provider will be onsite and transfers to the start are included, and the hotel is within walking distance of the finish line. But I am concerned about getting through customs and getting to and from the airport to the hotel.</p><p>Will I have issues in customs, or are there English speaking staff available?</p>",
        "Tags": "['greece', 'language-barrier']"
    },
    {
        "Id": "40320",
        "Title": "\"Small camera\" carry-on luggage allowance",
        "Body": "<p>Many airlines allow to bring several items on top of allowed carry-on luggage. For example:</p><blockquote>  <p>\"In addition to your hand baggage allowance, you can also carry personal items such as one ladies handbag or one small briefcase, one coat, cape or blanket, one umbrella, one pair of crutches or walking stick, one small camera or binoculars, limited reading material, an infant’s carrying basket, and duty-free items purchased on the day of your flight.\"</p></blockquote><p>How \"small camera\" is defined? Does single DSLR with short lens fit this definition?</p>",
        "Tags": "['air-travel', 'airlines', 'hand-luggage', 'photography']"
    },
    {
        "Id": "99713",
        "Title": "In Germany, what are you supposed to do if your train station doesn't have any working ticket machines?",
        "Body": "<p>I recently took a train to Munich from a tiny suburban station that only had a couple of ticket machines. At the time I was there one of the machines was broken, but I was able to get a ticket from the second one. </p><p>But what is one supposed to do if <em>all</em> the machines at the current station are broken down or if there isn't one altogether? There weren't any MVV personnel at the station and the train I was taking (S-Bahn) likewise doesn't have any conductors selling tickets. </p><p>To avoid an overly narrow question about S-Bahn trains in Munich, it would be nice to get a general answer about Germany as a whole.</p>",
        "Tags": "['trains', 'tickets', 'germany']"
    },
    {
        "Id": "179586",
        "Title": "\"rechargeable credit card\" in France",
        "Body": "<p>I am going to Paris/France for a trimester program (3 months). The organizers sent an email that said the following.</p><blockquote><p>Make sure that you have a credit card to withdraw cash in France. If you have any issue with this point ou can also create an online bank account before you arrive or get a rechargeable credit card (Nickel, Wise, N26,…).</p></blockquote><p>I have an SBI GLOBAL card (<a href=\"https://sbi.co.in/web/personal-banking/cards/debit-card/sbi-global-international-debit-car\" rel=\"nofollow noreferrer\">https://sbi.co.in/web/personal-banking/cards/debit-card/sbi-global-international-debit-car</a>). Is that convenient for transactions in France?</p><p>If not, how does one get \"rechargeable credit card\"?</p><p>Note : I do not have to pay rent. The accommodation is provided by the institute. They are going to give/deposit some honorarium per month to cover food and other expenses. To give that money, they asked for \"rechargeable credit card\".</p>",
        "Tags": "['france', 'payment-cards']"
    },
    {
        "Id": "117635",
        "Title": "Is London's Greenwich park free?",
        "Body": "<p>I'm planing a trip to see the Greenwich time line (Prime meridian). I did some research and found that Greenwich park in London is the place most visitors go to see this. Is this park free and is there any other place that I can see the Prime meridian?</p>",
        "Tags": "['budget', 'london']"
    },
    {
        "Id": "143748",
        "Title": "How do I call a 6-digit Australian phone number with a US-based mobile phone?",
        "Body": "<p>This may not exactly fit the context of this site, but I think it's worth a shot, and the answer may be useful within the context of the site. </p><p>I am attempting to call the Australian phone number listed as <code>131542</code> on the <a href=\"https://www.kia.com/au/util/contact-us.html\" rel=\"noreferrer\">Kia of Australia Contact Us</a> page from my US-based mobile phone. Though, even after reading the Wikipedia page on <a href=\"https://en.wikipedia.org/wiki/Telephone_numbers_in_Australia\" rel=\"noreferrer\">Telephone Numbers in Australia</a> I can not seem to get it correct. My best guess is to use the \"International Access\" code of <code>1100</code> along with the country code <code>61</code> prepended (totaling <code>61-1100-1315421</code>). Though I've had no luck with that or any other seemingly esoteric collection of codes and the listed number.</p><p><strong>How can I dial a 6-digit Australian phone number from a US based mobile phone?</strong> I have Verizon Wireless for my mobile carrier.</p><hr><p>This may be useful to other travelers trying to contact Australian companies, hotels, etc. And for those interested, Kia of Australia sells a cargo roof rack for my car that Kia of America does not recognize or sell. I am trying to get more information on it.</p>",
        "Tags": "['cellphones', 'phone-networks']"
    },
    {
        "Id": "36740",
        "Title": "Is there a legal limit to the amount of cash one can carry on domestic US flights?",
        "Body": "<p>Is there a legal limit to the amount of physical cash a US citizen can possess when flying from one US state to another? I've heard that the United States government can and is seizing any amount of cash over a certain dollar amount at airports. However, I have not been able to get a definitive answer as to if these reported seizures are due to other illegal activity or if carrying cash over a certain dollar amount is in itself illegal.</p><p>Before anyone marks this as a duplicate, I am not talking about customs reporting, foreign currency limits or bringing money into or out of the United States. I'm only asking specifically about carrying good o'll US dollars from one state in the United States to another (NY to TX) on a domestic flight.</p>",
        "Tags": "['usa', 'legal', 'money', 'domestic-travel']"
    },
    {
        "Id": "898",
        "Title": "Shoes for long flight",
        "Body": "<p>Does anyone have recommendations for great shoes for a long flight?  I usually wear running shoes, but my feet often get very uncomfortable after a few hours.</p>",
        "Tags": "['air-travel', 'long-haul', 'footwear']"
    },
    {
        "Id": "47490",
        "Title": "How common is open carry of firearms in the USA?",
        "Body": "<p>This winter, I am planning to go to the USA for the first time. One of my concerns is the presence of weapons in public. I just came back from Paris and the sight of armed soldiers patrolling public spaces made me very uncomfortable (I come from a country where you can live for 100 years without having seen a gun in real life). So I'm wondering, in open-carry states, can you see people carrying handguns in their belts?</p>",
        "Tags": "['usa', 'cultural-awareness', 'firearms']"
    },
    {
        "Id": "5509",
        "Title": "User Group meetings in India?",
        "Body": "<p>This may sound like an odd idea, but when I'm travelling I like to go to local user group meetings. I have two reasons for this:</p><p>It is a good way to meet local people I have something in common with and escape the backpacker crowd for an evening. Often people go out for drinks and food after the meeting for extra socializing.</p><p>I also may learn something new in IT and may use my brain for a change :-)</p><p>While at home I usually only visit user groups for my specific field/technology, on the road I like to branch out and go to any meetings that fits my schedule.</p><p>I know there are user groups in India and there are tons of software developers and IT people there too, but how common are meet-ups and can I just drop in? Are they all in English? Are there code camps or similar events? Is there a good online source for finding out about events?</p><p>I know this is a long-shot but there are many IT people here and some of them even from India.</p>",
        "Tags": "['online-resources', 'india', 'activities']"
    },
    {
        "Id": "27534",
        "Title": "Do they serve sushi on flights?",
        "Body": "<p>As someone who's been in Japan for 4 months I would <em>love</em> some sushi on flights occasionally. </p><p>I usually take a special meal anyway (Hindu meal because it's tasty!). But I was wondering of there was a meal in which I had a good chance of getting sushi.</p>",
        "Tags": "['air-travel', 'airlines', 'food-and-drink']"
    },
    {
        "Id": "29072",
        "Title": "Getting into a fully booked hotel?",
        "Body": "<p>Perchance where I'm travelling to has really crappy availability in terms of vacancies for when I'm going. All of the hotels near the area are fully booked for the weekend. I called the front desk for a Hilton Garden Inn and they said it's typical for them to be booked but they don't have a waiting list. </p><p>Does anyone have a clever way I could get a hotel to put me on a waiting list, or notify me when they open up?</p>",
        "Tags": "['online-resources', 'planning', 'accommodation', 'bookings', 'vacations']"
    },
    {
        "Id": "66451",
        "Title": "Kicked out of hotel in morning when booking through booking agency (asked to pay for extra day)",
        "Body": "<p>I am from UK, I went to travel agent website and booked holiday (flights + hotel), today is the last day and my flight is 22:30. In the morning we went to the city to have some lunch and when we came back we were asked to pay for one extra day because hotel policy is to check out at 11:00 and our travel agency didn't book one extra day. I tried to explain to them that I didn't make booking directly and all should have been done between travel agency hotel and not me, but in the end just to get to my stuff that I have left in my room I paid for extra one day. I then called agency I have booked with, they said however that I should have booked for one more day If I wanted to stay till the evening (although I used their system to make the booking and didn't get explanation that I have to wait one day on the street), and if I want I should contact their complaints department.</p><p><strong>Is this legal? What recourse could I take?</strong> </p>",
        "Tags": "['uk', 'legal', 'travel-agents', 'tenerife', 'disputes']"
    },
    {
        "Id": "163733",
        "Title": "Is this banknote still acceptable in Switzerland?",
        "Body": "<p>I went to bank today to put CHF in my account in a Polish bank and they said that this banknote is not acceptable to be deposited in our bank! However, it is acceptable inside Switzerland itself.Can anybody let me know whether this type is used in Switzerland?</p><p>Thanks<a href=\"https://i.stack.imgur.com/yaB4N.jpg\" rel=\"noreferrer\"><img src=\"https://i.stack.imgur.com/yaB4N.jpg\" alt=\"enter image description here\" /></a></p>",
        "Tags": "['money', 'switzerland', 'exchange']"
    },
    {
        "Id": "109975",
        "Title": "How to avoid accidental trespassing while exploring rural US?",
        "Body": "<p>I am planning a road trip through some rural locations in Tennessee and North Carolina, US. The intention is to visit some places of particular interest (e.g. filming locations of certain movies).</p><p>Some of the places are known to be private land/residencies which I am only planning to see/photograph from the public roads. Other places, such as nearby woods or unnamed roads like <a href=\"https://www.google.com/maps/dir//Unnamed+Road,+Wadesboro,+NC+28170,+USA/@34.9058731,-79.992327,1531m/data=!3m1!1e3!4m8!4m7!1m0!1m5!1m1!1s0x8854fbebf2494e5b:0x3a1d5ecfba0efcfc!2m2!1d-79.9907786!2d34.9062273\" rel=\"noreferrer\">this one</a>, are what I am less sure about whether they might be publicly accessible.</p><p>Unless there are fences, closed gates and/or other clear signs that a road is private, how do I tell if I can drive on a road like the one referred above? If I see woods without any fences or other indication of them being private property, is it generally acceptable to enter them?  </p>",
        "Tags": "['usa', 'road-trips', 'rural']"
    },
    {
        "Id": "152985",
        "Title": "What happens if you bring a pocket knife to Europa Park?",
        "Body": "<p>Everywhere I go (except on planes), I carry a Swiss Army Knife as a fob daily tool and a multitool in my backpack. Today I learned that apparently you're not allowed to bring pocket knives to Europa Park. This got me rather confused because not only would it be rather difficult to do harm anyone with a pocket knife (one that you're allowed to carry in Germany) but I also think that when I once was there as a child, you could actually buy Swiss Army Knifes in the park. Now this is a childhood memory and it's rather blurry, so I'm not sure.</p><p>I think my knives are completely standard and carried by many people but here are pictures so we're clear on what kind of pocket knives I'm talking about:</p><p><img src=\"https://i.stack.imgur.com/J7rKO.jpg\" alt=\"\"></p><p><img src=\"https://i.stack.imgur.com/P2IPw.jpg\" alt=\"\"></p><p>As I'll be arriving to Europa Park by public transport, I can't just go back to my car, put whatever they don't allow me to carry in there, and return to the entrance. Will they just tell me to come again without them? Will they take them? Will I be able to get them back?</p>",
        "Tags": "['germany', 'gear', 'amusement-parks']"
    },
    {
        "Id": "79775",
        "Title": "Liquids in carry on, why and how much?",
        "Body": "<p>I am soon travelling from Schiphol to IAH, and I have heard about the 'resealable' bag rule.</p><p>The TSA website says I can fill a 'quart' sealable bag with liquids less than 100grams. What is a 'quart' bag? Can I fill 1/4th of the bag? What if I just buy a bigger bag?</p><p>I am planning on taking 2 liquid items of less than 100 grams with me, do I need to put these in a resealable bag or is the fact that they would fit in a bag good enough? </p><p>I fail to see why I would need a resealable plastic bag. Resealable bags are not common here and I prefer to just keep them organised in my carry on, instead of in a plastic bag.</p>",
        "Tags": "['air-travel', 'international-travel', 'hand-luggage', 'tsa']"
    },
    {
        "Id": "25506",
        "Title": "Do Russians smile at each other?",
        "Body": "<p>I'm planning to go to Russia. In my culture, smiling is really common even to strangers. I've heard that Russians don't smile or laugh unless it's something funny or something that makes them happy. Will it be strange or will I insult anybody in Russia if I smile? </p>",
        "Tags": "['russia', 'local-customs', 'culture']"
    },
    {
        "Id": "78754",
        "Title": "Does the direction of travel matter for jet lag, when the time difference is 12 hours?",
        "Body": "<p>I was having a discussion with a friend about this. Usually, I understand that when traveling east, jet lag is worse than when traveling west. </p><p>However, when the time difference is (about) 12 hours, I posed that there would be no difference, as the directionality of the time shift makes no difference to the time of day at your destination (3 PM +/- 12 hrs is 3 AM, the only difference is the date). </p><p>My friend countered that it's not the time difference at the destination per sé that makes the difference, but the length of daylight during the flight. When traveling east, you'd fly into the sun, which would cause your perceived days to be compressed. When traveling west, your day would be extended. In their view, this made the difference.</p><p>I'd like scientifically sound proof of either one of these hypotheses, but personal experience is also much appreciated.</p>",
        "Tags": "['air-travel', 'timezones', 'jet-lag']"
    },
    {
        "Id": "1444",
        "Title": "How to find out your body weight while travelling?",
        "Body": "<p>While on the road you don't have your handy scales at home, and without making an appointment to see a doctor, where else could you find some scales to determine your on-the-road weight? This is useful if say, your travel medicine is weight-related...</p>",
        "Tags": "['health', 'tips-and-tricks']"
    },
    {
        "Id": "7586",
        "Title": "Accidentally travelling with a large amount of cash - can I quickly transfer it to a debit card?",
        "Body": "<p>With just under a week to go until I head for Europe I made an epic faux pas.</p><p>Instead of ordering a Visa debit card with 1500 Euro added to it, I have ended up with 1500 Euro in cash.</p><p>I cannot take it back to the currency exchange place as they will charge me a fee to put it onto a card etc.</p><p>I do not really want to be travelling around Europe with 1500 cash in my hand especially when I will be staying in hostels where it could be stolen.</p><p>Is there any Euro cards or banks where I could dump the cash and then access it when I need it ?</p><p>I will start my trip in France and will be there for 3 weeks.</p><p>Like a temporary bank account?</p>",
        "Tags": "['europe', 'money', 'exchange']"
    },
    {
        "Id": "8105",
        "Title": "Is it easy to get prepaid SIMs in the US/Canada?",
        "Body": "<p>I'll be travelling in a family party to the east coast of the US and Canada and, as most people know, travelling in a party means you often need to keep in contact when seeing different things and trying to meet up, etc.  We were wondering if it's easy to get prepaid SIMs for our (Australian) phones and use them while we were over there?  </p><p>Are there any catches to be aware of?  Can the same SIMs be used for Canada (Toronto) and the US, or should we just restrict ourselves to US-only ones?  What about data quotas for smart phones?</p>",
        "Tags": "['usa', 'canada', 'cellphones']"
    },
    {
        "Id": "36268",
        "Title": "Why can two different airlines have different travel durations for the same itinerary?",
        "Body": "<p>I am looking at flights from Boston to Paris and I see that there are two non-stop flights with different travel duration:</p><p><img src=\"https://i.stack.imgur.com/cWT4m.png\" alt=\"enter image description here\"></p><p>For this itinerary, Air France takes 6h40 while Delta takes 7h04.</p><p>Why don't they have the same travel duration? Is it typically due to the type of airplane, the route, or something else?</p><hr><p>Another example (2h10 difference):</p><p><a href=\"https://i.stack.imgur.com/Wg5HQ.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Wg5HQ.png\" alt=\"enter image description here\"></a></p>",
        "Tags": "['air-travel', 'airlines']"
    },
    {
        "Id": "17839",
        "Title": "How to get from Gatwick airport to Paddington?",
        "Body": "<p>What's the most straightforward way to get from Gatwick airport to Paddington station in London using public transport? </p><p>I'm mostly interested in travel time & general smoothness of the trip (e.g. buying just one ticket for the whole trip would be nice). Price is a secondary concern. </p>",
        "Tags": "['public-transport', 'airport-transfer', 'london', 'lgw']"
    },
    {
        "Id": "91057",
        "Title": "What is the purpose of hook turns?",
        "Body": "<p>Firstly, I'm sorry if this is the wrong place to ask. I just can't really seem to find an answer anywhere.</p><p>My question is, what is the rationale behind <a href=\"https://en.wikipedia.org/wiki/Hook_turn\" rel=\"noreferrer\">hook turns</a>? While I've never performed one, I think I understand how one is performed. I don't have a reason (yet...) to say that they're stupid, but I do want to understand why they're used. According to Wikipedia, it's got to do with trams' right of way, etc. On the Wikipedia page for hook turns, there was also a link to a <a href=\"http://trove.nla.gov.au/newspaper/article/27232360\" rel=\"noreferrer\">really interesting newspaper article</a> from 1954. It said that prior to the 1st of September 1954, all of Melbourne's right-hand turns were hook turns!</p><p>Anyway, what is the advantage of hook turns? I looked at some diagrams, but I can't really understand how turning right from the right lane would affect trams any more than turning right from the left lane. Are hook turns just used for safety, i.e. easier to see approaching trams?</p>",
        "Tags": "['driving', 'australia', 'melbourne']"
    },
    {
        "Id": "3507",
        "Title": "How to get a visa for Iran?",
        "Body": "<p>Most Westerners do not only need a visa to visit Iran, they first need a \"Letter of Invitation\" to be able to apply for the visa. Most people get this through travel or special visa agencies, some of them are online only.</p><p>What are any trustworthy agencies that do this? Experiences in quality and duration?</p>",
        "Tags": "['visas', 'iran']"
    },
    {
        "Id": "51636",
        "Title": "Is an OysterCard worth it for occasional 1-day visits from outside London?",
        "Body": "<p>I live outside London (well beyond the London travel zones) but a few times a year I visit London for a day. I typically take a national rail journey in and out to a terminus and make two or three underground journeys in zone 1.</p><p>I usually buy an off-peak one-day travelcard which is a convenient single ticket used for all parts of the journey.</p><p>However I do wonder whether I should obtain an Oyster card (perhaps a Visitor's Oyster card) and top it up when travelling into London. I'd have to buy an off-peak return for the national rail part of the journey - would I save any money?</p>",
        "Tags": "['budget', 'public-transport', 'london', 'tfl', 'oyster-card']"
    },
    {
        "Id": "129462",
        "Title": "Can I use a priority seat if it is vacant?",
        "Body": "<p>Since I don't have any priority, I avoid using priority seats* on busses, trains etc. However I see that other people who have no priority are occasionally using those seats. I wonder if there is a general code or etiquette for it.</p><p>Should I continue to avoid using priority seats even if they are vacant?</p><p><sup>* Some seats may be for disabled people.</sup></p>",
        "Tags": "['uk', 'public-transport', 'accessibility']"
    },
    {
        "Id": "58807",
        "Title": "Travelling in/out France after the attacks of November 2015",
        "Body": "<p>Can someone with a non-European nationality and a French 'carte de séjour' freely enter and travel (particularly by air) from France after the unfortunate events?</p><p>I have been checking the news, some of them said Schengen visas are banned but none say anything about carte de séjour holders. If I knew earlier I wouldn't have booked but it is too late now and I am worried I might be able to go out but not come in again. I am a student so it will be a real inconvenience if such thing happens.</p>",
        "Tags": "['schengen', 'paris', 'event-based-effects']"
    },
    {
        "Id": "63927",
        "Title": "Can Canadian money (change) be used in the United States?",
        "Body": "<p>As a visitor to the US from Canada, is it possible to use Canadian money, especially coins, at businesses in the US?</p><p>What about vending machines?</p>",
        "Tags": "['usa', 'canada', 'money', 'exchange']"
    },
    {
        "Id": "5561",
        "Title": "Where in Europe can I pay to fire guns or have military experience?",
        "Body": "<p>I have seen several sites for places in Ukraine and Poland where you can drive tanks and shoot various weapons from the Soviet Union.</p><p><a href=\"http://stayinkiev.com/en/shooting-tours\">http://stayinkiev.com/en/shooting-tours</a></p><p><a href=\"http://www.ukraineconnections.co.uk/military_adventures.htm\">http://www.ukraineconnections.co.uk/military_adventures.htm</a></p><p><a href=\"http://www.bastion-panzer.com.pl/\">http://www.bastion-panzer.com.pl/</a></p><p>I will be travelling around many Western European countries which I expect to not have these sorts of experiences.</p><p>I am interested in war and weapons so if there are any places you can think of were you can fire guns like AK47 or drive old Russian tanks.</p><p>I need suggestions for these places as they are the further east I am going in Europe :</p><ul><li>Slovenia</li><li>Croatia</li><li>Slovakia</li><li>Poland</li><li>Hungary</li></ul><p>I hope some of the Eastern European members on here could point me in the right direction?</p>",
        "Tags": "['activities', 'outdoor-activities', 'eastern-europe', 'firearms']"
    },
    {
        "Id": "441",
        "Title": "Are international driving licences really necessary for any country?",
        "Body": "<p>When I first started travelling internationally about 20 years ago I was young and naive and bought an international driver's license for my trip to the United States.</p><p>Then I discovered that it was not at all needed. All that was needed was a licence from my own country with a photo. At that time photo licences were relatively new in Australia.</p><p>So my question is, is this the case everywhere or are there some countries which really do not permit foreigners to drive without an international licence?</p><p>(I don't need a full list of countries as an answer, just a yes or no with a couple of examples is fine)</p>",
        "Tags": "['driving', 'driving-licenses']"
    },
    {
        "Id": "126908",
        "Title": "Why are airline meal portions so small?",
        "Body": "<p>Why are <a href=\"https://en.wikipedia.org/wiki/Airline_meal\" rel=\"nofollow noreferrer\">airline meal</a> portions so small, even on long-haul flights ?<br>Sometimes it's not even enough for children, let alone adults.</p><p>I have some assumptions, but I would like to submit this question to those who are in a position to know the genuine reason(s).</p><p><a href=\"https://i.stack.imgur.com/AwJ7n.jpg\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/AwJ7n.jpg\" alt=\"img\"></a><br><em>(generic photo for illustration purposes only)</em></p><p>Hungry passengers might choose another airline next time, so I don't think it's a winning marketing strategy.</p><p>Some answers say that larger meals are not necessary, because passengers don't burn a lot of calories while sitting. The point is entirely moot. People get hungry when their body gets less to eat than it is used to. The amount of burned calories on a single day is not what causes hunger. Much to the contrary – after doing lots of sport, I'm tired. Not hungry at all.</p>",
        "Tags": "['air-travel', 'airlines', 'food-and-drink', 'in-flight-services', 'cabin-crew']"
    },
    {
        "Id": "52669",
        "Title": "Can I get a discount on my flight for not being overweight?",
        "Body": "<p>If I weighed 120 kg I could check in 20 kg of luggage for free, getting 140 kg transported for my ticket price.</p><p>But if I weigh 70 kg, I'm 50 kg lighter and yet pay the same for the same luggage limit; and pay excess charges if my luggage is say, 25 kg and exceeds a 20 kg limit.</p><p>So what I pay for transporting 95 kg could cost more than the person transporting 140 kg.</p><p>Is there an airline that has a fairer policy and charges more appropriately based on actual mass transported?</p>",
        "Tags": "['air-travel', 'budget', 'luggage']"
    },
    {
        "Id": "106944",
        "Title": "Is it possible to be denied entry into USA after being granted a tourist visa by my local embassy?",
        "Body": "<p>I have a trip to the USA planned for 2018. I am a citizen of Montenegro - we are on good standing with the Americans, but we do need to apply for a visa in order to visit.</p><p>The possible issue is - I visited Iran earlier this year as a tourist. I am a bit worried I may be declined for this reason, but I will take my chances and schedule the interview at the embassy.</p><p>What I am more worried about is the following scenario:</p><ol><li><p>The consul approves my visa request, I am issued a visa</p></li><li><p>I book my flights and travel to NY</p></li><li><p>Some TSA/immigration officer decides not to let me into the country after all</p></li><li><p>I waste a lot of time and money and have to take the first flight back</p></li></ol><p>Is this possible? Can someone at the airport override the embassy's decision and deny me entry?</p><p>There is no legal reason for me not to visit, it's only the Iranian visa in my passport that has me concerned I may be turned back for \"security reasons\".</p>",
        "Tags": "['visas', 'usa', 'denial-of-entry', 'montenegrin-citizens']"
    },
    {
        "Id": "2497",
        "Title": "Cheapest way to get from Zürich (Switzerland) to Brussels (Belgium)",
        "Body": "<p>In the last week of October I plan to go to Brussels. I'm leaving from Zurich in Switzerland. I already did some research and tried to get a train ticket. The train is really fast (6.30 h) but a one-way ticket for 2 persons is more than 400 CHF :o So I also tried the budget airlines in Europe like easyJet or airberlin but nothing really cheap there.</p><p>Are there any other possibilities to get there?</p>",
        "Tags": "['budget', 'transportation', 'brussels', 'zurich', 'western-europe']"
    },
    {
        "Id": "166849",
        "Title": "Is boiling tap water sufficient?",
        "Body": "<p>In cases where tap water is not drinkable by default, does simply boiling it make it drinkable? And provided the water does <em>look</em> clear.</p><p>(For example I'm in an apartment in Pridnestrovi where the tap is connected to both a 'cold water supply' and a 'lukewarm hot water supply'. I asked the host who said to boil the water from the 'cold water supply' to drink. But would the water not be drinkable if I boil the water from the 'lukewarm hot water supply' instead?)</p>",
        "Tags": "['health', 'tap-water']"
    },
    {
        "Id": "25029",
        "Title": "How can I effectively haggle for a decently-priced auto ride?",
        "Body": "<p>Pretty much wherever you go in India, you'll come across 3 wheeled autos or <a href=\"https://en.wikipedia.org/wiki/Auto_rickshaw\" rel=\"noreferrer\">auto rickshaws</a>, which normally look like this:</p><p><img src=\"https://i.stack.imgur.com/XJ1Ag.jpg\" alt=\"From \"A tea but no e\" from www.flickr.com/photos/ateabutnoe/213708300\"></p><p>In some places where you want to get one, there's an office or cabin where you can go, pay a small fee, and get a fixed price for the trip. As long as you can successfully communicate where it is you want to go, this gives a known low price, and you're all set.</p><p>I'm told that almost all autos have a meter, and that's how most locals handle it for shorter journeys. However, since it's fairly obvious to anyone looking at me that I'm not a local, and I'm normally trying to get an auto outside of a hotel / bar / office, they never seem to want to use the meter for me....</p><p>That leaves two options. One that should be avoided - hop in, give a destination, negotiate a price on arrival. Seriously - never do this, you'll get massively ripped off! The other is to negotiate (haggle) for a fixed price before you set off. This can give a good deal, if you know what price to start at, and how to haggle. It can give a bad deal if you don't!</p><p>What strategies can you use to ensure you negotiate a decent price for your trip?</p><p>(As an example of variability, on my first trip I paid what I thought was a good price, but turned out to be about 10 times what it should've been. Yesterday I went from my hotel to meet some friends, mid evening, and paid twice what my friends negotiated for my return at the late-night rate!)</p>",
        "Tags": "['india', 'taxis', 'haggling']"
    },
    {
        "Id": "78790",
        "Title": "Power converter that worked in Barcelona doesn't work in Rome - how to recover?",
        "Body": "<p>I have an international power converter that looks like <a href=\"http://rads.stackoverflow.com/amzn/click/B00E0FZSQC\" rel=\"nofollow\">this one</a>. (I bought mine several years ago; it's not that exact one.) I used this converter to power a US phone-battery charger in Barcelona yesterday. Today in Rome, though, I'm not getting power through it. (Update: I'm told here that it's an adapter, not a converter.)</p><p>As far as I've been able to tell, Spain and Italy have the same power standards. The converter's indicator light comes on, but the indicator light on the charger doesn't. I tried plugging my tablet in and that didn't detect power either.</p><p>Both devices are rated for input of 120-240V (not 120/240), according to text stamped on their plugs. I also have a USB charger with European adapter and that charges my phone and tablet just fine. But I've been needing two batteries to get through a day of tourism, hence the desire to use the battery charger (which is not USB) too. The battery charger is the ony reason for the adapter, and the only thing I'd plugged into it until I started debugging.</p><p>I can find an electronics store here tomorrow, but what should I look for? Or is the problem not my converter but something else, possibly including hotel issues?  (The place isn't very new or well-appointed.) </p>",
        "Tags": "['italy', 'power']"
    },
    {
        "Id": "19911",
        "Title": "How much does a taxi from Lisbon airport to city center cost?",
        "Body": "<p>I'm arriving in Lisbon fairly late on a Sunday with a fair amount of baggage. I've usually used the Aerobus (which works fine) but I've got more baggage than usual and it'll have been a long day by the time I get to Lisbon. So I'm looking at what a taxi is going to cost.</p><p>The <a href=\"http://www.lisbon-airport.com/transportation.html\">Lisbon airport site says</a> that it should be about 10 euros. Which would be fine. But when I follow the link they provide to an online taxi booking site, it quotes 32 euros, which is less fine. Is the airport site simply way out of date or is the booking site overcharging?</p><p>What should I expect to pay, approximately, to get to a hotel in the city center (near Marquês Pombal in my case)?</p>",
        "Tags": "['airport-transfer', 'taxis', 'portugal', 'lisbon', 'lis']"
    },
    {
        "Id": "53190",
        "Title": "Can you carry drones (eg. DJI Phantom or Inspire) on a plane as a carry on?",
        "Body": "<p>I live in the US and contemplating travel to Europe next Spring and taking a drone with a couple of extra batteries as carry-on, to get some aerial shots. The batteries are 5200mAh (57.72Wh) each on Phantom 2 and 5700mAh (129.96Wh) on Inspire.</p>",
        "Tags": "['usa', 'europe', 'hand-luggage', 'prohibited-items', 'drones']"
    },
    {
        "Id": "158665",
        "Title": "Hiking in Scotland under 21 without a car",
        "Body": "<p>So I wanted to go with a friend to Scotland for 4 to 5 days. We would arrive at Edinburgh by plane. We wanted to rent a car so we could go where we wanted to to hike, but we would have to pay double the price because of the young driver fee. That would make the whole trip really expensive for five days, not even taking into account plane tickets, oil and food.</p><p>I was wondering if taking bus / train to get to an itinerary for a good hike that would last those days + hitchhiking would be doable, even for a short span.</p>",
        "Tags": "['public-transport', 'transportation', 'scotland']"
    },
    {
        "Id": "80329",
        "Title": "How to cope with too slow Wi-Fi at hotel?",
        "Body": "<p>So many hotels I stayed at (3~4 stars ratings) provided too slow Wi-Fi. The speed is somewhere around 2~3Mbps, and it frequently falls down to <200Kbps.</p><p>However, once you find that your hotel provides such a terrible Wi-Fi environment, is there anything still that you can take an action there? In hotel search websites, many hotels are tagged with <em>Free Wi-Fi</em> or even <em>Hi-Speed Wi-Fi</em> but it is not reliable in my experience. </p><p>Note that I'm not asking for whether it is possible to know the quality of Wi-Fi at hotel in advance, which has been posted <a href=\"https://travel.stackexchange.com/questions/1836/is-there-any-way-of-evaluating-the-quality-of-a-hotels-internet-connection-in-a\">in this question</a>. What I ask here is <strong>how you can deal with it when you find your hotel provides a terrible Wi-Fi</strong>.</p><p>Usually, I get through it by going into cafe with Wi-Fi. But still, the cafe might not provide you with a good connection. Also I want to use my Mac in midnight, when most cafes are not open in general.</p><p>I also make sure to contract a local SIM with 4G/LTE and tethering capability, but still, the tethering fails to connect too frequently in many cases.</p><p>This is what is happening on me right now in Shanghai, that the hotel's is terrible, all cafes I tried (including Starbucks) suck, and China Unicom 4G/LTE is too slow even without VPN. It's really stressful...</p><p>So is there still anything I can do to assure the good network environment? (except changing the hotel which I do once the current booking ends)</p><p>My point is that I want to use my Mac whenever I want (including midnight), since it is a part of my job (working while traveling). <strong>The minimum requirement is a stable access to GitHub and Stack Overflow and fast google search responses. I don't need much speed (around 7 ~ 10Mbps is sufficient) but cannot tolerate <2Mbps, since it takes me to wait for so long. For me, the stable, undisconnected network is far more important than the speed and latency, once it is above 3Mbps. I don't download/upload large files at once (e.g. videos or hi-res pictures or big softwares, those with >500MB).</strong></p><hr><p>If a list of countries is required, I ask for Hong Kong and China (Shanghai/Beijing). But this occurred in Singapore and Japan as well. South Korea never bothered me in this regard, though, as the major cities are full of terrific Wi-Fi cafes. </p>",
        "Tags": "['hotels', 'tips-and-tricks', 'internet', 'wifi']"
    },
    {
        "Id": "16331",
        "Title": "What is overbooking (of flights), and why do airlines all seem to do it?",
        "Body": "<p>I know that they want to \"fill every seat.\"</p><p>If you take this LITERALLY, then you'd want to overbook, because of the statistical percentage of \"no shows.\" That, of course, leads to \"bumping\" when more passengers actually show up than the statistical formulas predict.</p><p>But one could also define \"fill every seat\" as \"sell every ticket,\" then there's no point in overbooking. From an economic point of view, a seat would be \"filled\" as soon as the ticket was sold. Whether or not the passenger showed up wouldn't be of concern, as long as the ticket was paid for. And if a passenger wanted to change flights, s/he could be charged a penalty to cover the expected loss on the replacement; the closer to flight time, the higher the penalty.</p><p>A \"full\" plane is a crowded plane and thus an unpleasant plane. A plane in which every ticket was sold, but there were a few \"no shows\" is actually nicer to ride on. It would also be easier on the plane; there would be a smaller load.</p><p>Can airlines be persuaded to change their objectives in passengers' favour, so there is no \"bumping\" and less crowding? Would it make sense for passengers to push airlines to adopt other solutions (such as charging 10%-20% more for tickets, to compensate for the lost \"overbooking\" option). Would this (or some other idea) be better than forcing passengers to buy first class tickets if they want to avoid being \"bumped?\"</p>",
        "Tags": "['air-travel', 'airlines', 'terminology', 'overbooking']"
    },
    {
        "Id": "37324",
        "Title": "Left Luggage Facility in Chennai International Airport (MAA)",
        "Body": "<p>I will be travelling to Chennai International Airport later this month. I have a short trip for two days around Chennai before I go to Mumbai. I will need to store away my two standard international travel suitcases for those two days instead of lugging them around with me. Is there a facility (like a cloak room) in the International terminal where I can put my luggage? If so, do I need to have an onward journey to be able to put it there? If anyone has any contact information for the facility it would be great. </p><p>I have tried to find some information online but most of it is not very clear. Every post says there is something outside the terminal itself. Is it safe to put luggage there? And also the posts are a couple of years old, and I know that the Chennai airport has undergone some huge renovations during that period.</p>",
        "Tags": "['luggage-storage', 'maa']"
    },
    {
        "Id": "169932",
        "Title": "Can a US physician prescribe medications to non-US residents?",
        "Body": "<p>Suppose I travel to the US and stay there for a prolonged period of time. Can I meet with a registered physician and have him/her prescribe me meds?</p><p>Notes:</p><ul><li>I'm a EU resident.</li><li>I have neither a US passport nor a Green Card.</li><li>I wouldn't mind if the prescriptions were only available in US stores.</li></ul>",
        "Tags": "['usa', 'legal', 'health']"
    },
    {
        "Id": "972",
        "Title": "Are there any museums in Stockholm for children? (not Junibacken)",
        "Body": "<p>I heard about museum near the Stockholm in which children can make some experiments in chemistry, physics and so on, but I completely forgot its name.<br>Can you help me to find some information about it (in English, if available)?<br>Are there any analogs of such museum in other European countries?</p>",
        "Tags": "['europe', 'guides', 'activities', 'stockholm', 'museums']"
    },
    {
        "Id": "116687",
        "Title": "How to call a number from another country while I'm in another country myself?",
        "Body": "<p>Here's the situtation: there's a team meeting coming, situated in the US. I'm from Brazil and wish to call a coworker from Pakistan arriving there.</p><p>My number is +55... and his is +92... Is there any difference when calling his number on my cellphone if we're both in the US?<br>Or can I just dial +92... as usual?</p>",
        "Tags": "['usa', 'cellphones', 'communication', 'roaming']"
    },
    {
        "Id": "47568",
        "Title": "Want to meet arriving passenger inside airport before immigration (SIN airport)",
        "Body": "<p>Is this possible?</p><p>Buy a cheapest ticket or refundable ticket and enter T3 departure hall of Singapore airport, clear immigration and go to T3 arrival area and meet my wife even before she clears thru immigration desk.</p><p>Reason: to give her surprise and help her with document handling.</p><p>Thanks for your help.</p><p>P.s. this question may have been asked in different formats earlier, but i am keen on knowing for Singapore airport. There may be Meet&Greet services, that would be last resort.</p>",
        "Tags": "['customs-and-immigration', 'airport-security', 'singapore', 'sin']"
    },
    {
        "Id": "464",
        "Title": "Is there a resource for crime statistics in Spain - especially robbery",
        "Body": "<p>I'm going to visit Spain, and my wife is very worried about thieves in Spain. What cities should we be aware of? Are there any ways to protect myself from them?</p><p>eg Barcelona has a reputation for pickpocketing, but is it warranted?</p>",
        "Tags": "['safety', 'spain', 'security', 'cities', 'statistics']"
    },
    {
        "Id": "10710",
        "Title": "Should I tip in restaurants in Turkey?",
        "Body": "<p>I will be in Istanbul for a week. </p><p>Do I have to tip in restaurants or not?</p>",
        "Tags": "['turkey', 'restaurants', 'tipping']"
    },
    {
        "Id": "38363",
        "Title": "Mattresses are too soft: how can I get a better night's sleep in a hotel?",
        "Body": "<p>I've noticed that mattresses (and pillows) in hotels tend to be softer than I'm used to, and I don't get a good night's sleep like I do at home.  I don't have anything super-special going on (no weird medical stuff); I just have a firmer mattress and pillow at home and I notice the difference at hotels, sometimes waking up with a bit of a backache.  Is there anything I can do in a hotel room, or when making a reservation, to firm up the bed, <em>within the constraint</em> that when I fly I try not to check baggage?  (So if I bring something, it has to pack down.)  I don't want to sleep on the floor (that's <em>too</em> firm).</p>",
        "Tags": "['hotels', 'hand-luggage', 'sleeping']"
    },
    {
        "Id": "4573",
        "Title": "Can I spend Renminbi in Hong Kong?",
        "Body": "<p>While travelling in Hong Kong, I noticed signs at several vendors advertising prices with the 元 character, which from my visit to Shanghai I recognized as the symbol for Yuán.</p><p>Since Hong Kong has its own currency, this confused me.  Do vendors accept Renminbi in Hong Kong?  Does it vary depending on where you go, or is acceptance (or non-acceptance) universal?  Does an exchange rate apply, or are HKD and RMB considered interchangeable in Hong Kong?</p>",
        "Tags": "['money', 'hong-kong']"
    },
    {
        "Id": "20446",
        "Title": "What happens when an ATM in a country you're travelling through eats your card?",
        "Body": "<p>So you're travelling in some exotic land far from home.</p><p>You go to withdraw money from a local ATM so you can have some local currency.</p><p>But the ATM swallows your card! If you're lucky you might get a useful reason displayed on the screen, but it usually involved contacting your bank far, far away.</p><p>Now assume it's not an ATM installed at an actual bank.</p><p><strong>What normally happens under such circumstances?</strong> Can you get your card back from the ATM or must you get a new one issued from back home? If you can get it back, how long would that normally take?</p><p>Now there could be complications:</p><p>You can't stick around in this town and you can't contact your bank at home immediately due to time differences with home, being a weekend or public holiday, need to catch a flight, or as it was in my case, I had to cross the border or I would be breaking the terms of my visa.</p><p>Please don't submit answers on how to get money wired etc. For this question I want to focus on getting the same card or a new card.</p>",
        "Tags": "['money', 'international-travel', 'payment-cards', 'atms', 'emergencies']"
    },
    {
        "Id": "111071",
        "Title": "How to get driving (paper) maps in the county of Dorset?",
        "Body": "<p>I'm coming from Australia to visit my Dad in Bridport (UK) in Dorset. </p><p>We want to drive to Bristol to see the <a href=\"http://www.ssgreatbritain.org/about-us/being-brunel\" rel=\"nofollow noreferrer\">Brunel Museum</a> and we want to direct ourselves to see the <a href=\"https://en.wikipedia.org/wiki/Clifton_Suspension_Bridge\" rel=\"nofollow noreferrer\">Clifton Suspension Bridge</a> on the way. </p><p>To plan out our driving journey, we'd like to get a paper map. </p><p>My question is: <strong>How to get driving (paper) maps in Dorset?</strong></p>",
        "Tags": "['uk', 'driving', 'maps']"
    },
    {
        "Id": "81376",
        "Title": "What is way to eat rice with hands in front of westerners such that it doesn't appear to be yucky?",
        "Body": "<p>In India, we eat rice <a href=\"https://en.wikipedia.org/wiki/Etiquette_of_Indian_dining\" rel=\"nofollow noreferrer\">using our fingers</a>. Generally in the West, a fork or spoon is used. I have tried eating rice with spoon but I don't feel satisfied with it.</p><p>We eat dry rice but we mix curry and vegetables with it and then eat it with our hands.</p><p>Is there a way to eat rice with your hands in front of Westerners such that it doesn't appear to be disgusting to them? By disgusting I mean that they shouldn't feel like vomiting or looking away to avoid me. Even though in India we eat with our fingers, many people eat such that their whole palm is covered with food. That indeed looks disgusting. </p><p>I cannot avoid hurting them by following different etiquette, but I certainly want to maintain a degree of cleanliness.</p>",
        "Tags": "['food-and-drink', 'local-customs', 'culture', 'etiquette']"
    },
    {
        "Id": "3041",
        "Title": "How to use sinks with separate hot/cold taps?",
        "Body": "<p>I just traveled to Ireland. I was amazed to find that water sinks (at home, restaurants and public) have separate taps for hot and cold water.</p><p>If you use only the cold water, your hands freeze. If you use only hot water, your hands burn.</p><p>How do people use it?Is there tool at plumber shops to mix both of them (for my accommodation)?</p><p><img src=\"https://i.stack.imgur.com/Vw3A9.jpg\" alt=\"Sink with separate hot/cold taps\"></p>",
        "Tags": "['uk', 'tips-and-tricks', 'local-customs', 'ireland', 'hygiene']"
    },
    {
        "Id": "176097",
        "Title": "Suggested attire to wear for European trip in September",
        "Body": "<p>I plan to visit Europe from September 16 to October 2 (This year). I am visiting Germany (Berlin), Czech Republic (Prague), France (Paris) and UK (London).</p><p>What's the ideal dress to wear? I am used to moderate climates in India (Around 30 degree Celsius).</p>",
        "Tags": "['europe', 'weather-and-climate']"
    },
    {
        "Id": "5085",
        "Title": "To which country in Europe should I travel to if I want to see a lot of lighthouses?",
        "Body": "<p>My father is a big lighthouse fan (I know...). Now he wants to spend his next holidays in a country in Europe where he can see a lot of lighthouses. Obviously that shouldn't be a landlocked country, but is there any country in Europe that has significantly more lighthouses than any other?</p>",
        "Tags": "['europe', 'where-on-earth', 'countries', 'architecture']"
    },
    {
        "Id": "30178",
        "Title": "Where can I eat dishes that feature in western countries' Chinese restaurants?",
        "Body": "<p>... apart from western countries like the Australia or the USA themselves.</p><p>During my visit to Taiwan, I wasn't able to find the dishes I'd typically encounter in a Chinese restaurant in Australia or the United States, such as sweet and sour pork, honey chicken, Mongolian lamb/beef, and fried ice cream.</p><p>I have two main theories on why this is. One is that Chinese restaurant food is totally made up, and has no similarity with food anywhere in the world. In which case, I'd better give up trying to find the right location. This seems to be the case with <a href=\"http://en.wikipedia.org/wiki/Fried_ice_cream\">fried ice cream</a>, which Wikipedia suggests is an artificial modern invention.</p><p>The other is that maybe I visited the wrong location. China is a big place, after all. Perhaps visiting another area, such as Inner Mongolia, would find me what I'm looking for, with dishes either the same as, or the un-modified version of what is served in western countries' Chinese restaurants.</p><p>The Wikipedia article on <a href=\"http://en.wikipedia.org/wiki/Chinese_restaurant\">Chinese restaurant</a> mentions:</p><blockquote>  <p>There has additionally been a consequential component of Chinese  emigration of illegal origin, most notably Fuzhou people from Fujian  Province and Wenzhounese from Zhejiang Province in Mainland China,  specifically destined to work in Chinese restaurants in New York City,  beginning in the 1980s.</p></blockquote><p>As Fujian province is right next to Taiwan, and has had a major influence on it, it seems plausible that if some of the \"Chinese restaurant\" dishes were coming from Fujian, I would have seen them in Taiwan, but I didn't.</p><p>Where, if anywhere, can I find the dishes that feature in western countries' Chinese restaurants? Also, how should I identify the right kind of eatery in those countries?</p>",
        "Tags": "['food-and-drink', 'where-on-earth', 'asia', 'local-cuisine']"
    },
    {
        "Id": "102371",
        "Title": "How to get rid of the men who ask for money in Milan?",
        "Body": "<p>The men are mostly located in Duomo Square (Piazza del Duomo). They try to tie something to tourists' wrists and ask for money. I have fallen out with them many times. Also my friends who visit Milan, encounter the same issue.</p><p>For the Milan case, what is the best solution to get rid of these men? Is it likely to see any police officer around and do police speak English?</p>",
        "Tags": "['italy', 'security', 'scams', 'milan']"
    },
    {
        "Id": "9194",
        "Title": "Is there a difference between green traffic lights and blinking green traffic lights?",
        "Body": "<p>At the moment, I'm driving around in Québec. I've noticed that the green traffic light can be blinking or constant. I assumed that I'm allowed to drive in both situations. However, is there any difference? My first guess was that the blinking light indicates that I have to be careful when left turning because of traffic from the opposite direction, but this does not always to be true.</p><p>So what exactly is the difference?</p>",
        "Tags": "['canada', 'driving', 'traffic']"
    },
    {
        "Id": "144362",
        "Title": "Can you turn Airplane Mode off after you land or finish taxiing?",
        "Body": "<p>Can you turn Airplane Mode off after you land or finish taxiing on a plane? I have seen some turn it off after landing and some after taxiing and I have never heard an official rule stating which one is correct.</p>",
        "Tags": "['air-travel']"
    },
    {
        "Id": "90093",
        "Title": "Bought a ticket with Finnair, didn't enter my middle name",
        "Body": "<p>I'm travelling from Amsterdam, to Bangkok, via Helsinki. Bought a ticket with Finnair. I filled in the web form, and as it said \"One first name is enough\" (as also laid out <a href=\"https://www.finnair.com/pl/AYPortal/wds/DisplayPage.action?COUNTRY_SITE=US&SITE=FINRFINR&LANGUAGE=GB&PAGE=ANCP\" rel=\"noreferrer\">here</a>), I foolishly didn't fill in my middle name.</p><p>My first name and last name are correctly filled in. My passport has both my first name and my middle name under \"Given names\", which may cause confusion.</p><p>Is it OK? Seeing as I have a layover in Helsinki, it'd be even more stupid of me to be able to depart from Amsterdam, but not from Helsinki.</p><p>Can a name change occur?</p>",
        "Tags": "['air-travel', 'tickets', 'bookings', 'finnair']"
    },
    {
        "Id": "7154",
        "Title": "US Citizen in Poland more than 90 days in a 180 day period",
        "Body": "<p>From what I understand, it is legal for a US citizen to spend up to 90 days in Poland, leave for one day, and re-enter for another 90 day period.</p><h1>Sources</h1><ul><li><p>I called the Polish embassy in New York and they said that I don't need a visa as long as I don't stay for more than 90 days at a time.</p></li><li><p>I've visited the office for foreigners in Warsaw to ask for a visa and they said that I don't need one. The person I talked to suggested a visit to the Ukraine for one day.</p></li><li><p>Finally, I called the US Embassy in Warsaw and they also said that I do not need a visa as long as I leave to a non-Schengen country once every 90 days.</p></li></ul><p>This seems like a contradiction of the Schengen rules (no more than 90 days in a 180 day period) but all of the sources that I have contacted are giving the same information. The person at the US Embassy in Warsaw referenced a bi-lateral agreement between the US and Poland.</p><h1>More details:</h1><p>I contacted the Consul at the <a href=\"http://poland.usembassy.gov/contact.html\">US Embassay in Warsaw</a> by phone at +48-22/504-2000.</p><p>According to the Consul, \"the rule of 90 days within 180 days does not apply to US citizens in Poland.\" He personally verified that the Polish border guards are aware of this extra permission for US citizens.</p><p>He explained that there's no official documentation as law because it was created \"as a declaration by the Polish government in the form of a diplomatic note authored on 4 April 1991 from the Polish government to the US government.\"</p><p>Is there any official documentation of this diplomatic note from 4 April 1991 anywhere online?</p>",
        "Tags": "['customs-and-immigration', 'us-citizens', 'schengen', 'poland', 'eu']"
    },
    {
        "Id": "37875",
        "Title": "Accurate hiking maps of Austria",
        "Body": "<p>I'm going to Austria for hiking. In Switzerland, we have very accurate maps that are available <a href=\"http://map.geo.admin.ch/\" rel=\"noreferrer\">online for free</a>. Is there anything similar for Austria? I couldn't find a central place that covers whole Austria and includes all the information that the Swiss maps include: I would be especially interested in colored terrain that is more than 30° steep and populations of alpine ibex.</p>",
        "Tags": "['hiking', 'maps', 'austria']"
    },
    {
        "Id": "13300",
        "Title": "What's the deal with the \"string people\" in central Paris?",
        "Body": "<p>I've taken my fiancée to Paris twice - first for our 1st anniversary, and again for our 4th - and both times we had troubles with guys bothering us around the Sacré Coeur in Montmartre. They hang around the front entrance to the park and pester tourists with some sort of strange scheme involving tying string to people's fingers. From what  I can tell, anyone who's <em>ensnared</em> by the trick ends up being pestered into buying a bit of wool for a few euros.</p><p>Often we managed to get past them immediately by saying no, but in some cases they were persistent, and in a few cases they continually grabbed us and continued to shout at us after we escaped. In one case I had to physically pull one of them off my fiancée, as he was gripping her arm tightly and trying to tie string to her hand. Not exactly enjoyable when we're trying to have a relaxing holiday. In the end we resorted to walking up the long set of stairs to the left of the park and coming back down through the top entrance, which was exhausting and left us uncomfortable in the heat.</p><p>One thing I noticed is that the police periodically appear, and the sellers run off or hide down side roads. In once case we were treated to the sight of three armed officers chasing after one of them and tackling him to the ground, much the the enjoyment of everyone watching.</p><p>So, what's the deal with these guys? Are they breaking the law by being there? What's the best way to deal with them? We love everything about Paris, especially the Sacré Coeur, but these guys are an annoyance we'd prefer to avoid.</p>",
        "Tags": "['paris', 'security', 'beggars', 'scams']"
    },
    {
        "Id": "2042",
        "Title": "Is it possible to build up malaria and dengue resistance?",
        "Body": "<p>I have heard that in countries where malaria or dengue fever are endemic, local residents have built up resistance to the diseases so that contracting them is rare or impossible. Is this true, and is it possible for long-term travelers or expatriates to build up resistance?</p>",
        "Tags": "['health', 'tropical-destinations']"
    },
    {
        "Id": "89084",
        "Title": "What is the tipping process in restaurants in the US?",
        "Body": "<p>I'm supposed to write down something on the bill I get?<br>Do I hand the waiter my credit card after doing so?</p><p>Since I need a receipt, do I wait for the waiter to bring things back?<br>What's the process, from asking for the check till I can walk out with a receipt?</p>",
        "Tags": "['usa', 'local-customs', 'restaurants', 'tipping']"
    },
    {
        "Id": "3070",
        "Title": "Are there scheduled flight connections operated with a helicopter?",
        "Body": "<p>I know that you can charter a helicopter, it is expensive but possible. But can I go on a scheduled flight with a helicopter? If so, which connections?</p>",
        "Tags": "['air-travel', 'where-on-earth', 'helicopters']"
    },
    {
        "Id": "1023",
        "Title": "Is it possible to recharge an OV-chipkaart without a Dutch banking card?",
        "Body": "<p>I have an anonymous <a href=\"http://www.ov-chipkaart.nl/\">OV-chipkaart</a> (Dutch public transport electronic card). I don't have a Dutch banking card. (In other words, I'm a foreigner who goes to the Netherlands occasionally.) What are my options to recharge the OV-chipkaart, either with cash (ideally banknotes) or with a credit card?</p><p>Would getting a nominative card enable me to recharge it through the website without a Dutch banking card?</p>",
        "Tags": "['public-transport', 'tickets', 'payment-cards', 'netherlands']"
    }
]